{"id":"349121464_Learning_Local-Global_Multiple_Correlation_Filters_for_Robust_Visual_Tracking_with_Kalman_Filter_Redetection","abstract":"Visual object tracking is a significant technology for camera-based sensor networks applications. Multilayer convolutional features comprehensively used in correlation filter (CF)-based tracking algorithms have achieved excellent performance. However, there are tracking failures in some challenging situations because ordinary features are not able to well represent the object appearance variations and the correlation filters are updated irrationally. In this paper, we propose a local–global multiple correlation filters (LGCF) tracking algorithm for edge computing systems capturing moving targets, such as vehicles and pedestrians. First, we construct a global correlation filter model with deep convolutional features, and choose horizontal or vertical division according to the aspect ratio to build two local filters with hand-crafted features. Then, we propose a local–global collaborative strategy to exchange information between local and global correlation filters. This strategy can avoid the wrong learning of the object appearance model. Finally, we propose a time-space peak to sidelobe ratio (TSPSR) to evaluate the stability of the current CF. When the estimated results of the current CF are not reliable, the Kalman filter redetection (KFR) model would be enabled to recapture the object. The experimental results show that our presented algorithm achieves better performances on OTB-2013 and OTB-2015 compared with the other latest 12 tracking algorithms. Moreover, our algorithm handles various challenges in object tracking well.","authors":["Jianming Zhang","Yang Liu","Hehua Liu","Jin Wang"],"meta":["February 2021Sensors 21(4):1129","DOI:10.3390/s21041129"],"references":["345100912_Visual_object_tracking_based_on_residual_network_and_cascaded_correlation_filters","334819523_Lightweight_deep_network_for_traffic_sign_classification","334061806_Spatially_Attentive_Visual_Tracking_Using_Multi-Model_Adaptive_Response_Fusion","332616180_A_full_convolutional_network_based_on_DenseNet_for_remote_sensing_scene_classification","332134523_Dual_Model_Learning_Combined_With_Multiple_Feature_Selection_for_Accurate_Visual_Tracking","330229400_The_visual_object_tracking_algorithm_research_based_on_adaptive_combination_kernel","327188485_Spatial_and_semantic_convolutional_features_for_robust_visual_object_tracking","342604473_Multi-Hierarchical_Independent_Correlation_Filters_For_Visual_Tracking","338511872_Fast_Online_Object_Tracking_and_Segmentation_A_Unifying_Approach","329745791_High_Performance_Visual_Tracking_with_Siamese_Region_Proposal_Network"]}