{"id":"349128540_Deep_action_learning_enables_robust_3D_segmentation_of_body_organs_in_various_CT_and_MRI_images","abstract":"In this study, we propose a novel point cloud based 3D registration and segmentation framework using reinforcement learning. An artificial agent, implemented as a distinct actor based on value networks, is trained to predict the optimal piece-wise linear transformation of a point cloud for the joint tasks of registration and segmentation. The actor network estimates a set of plausible actions and the value network aims to select the optimal action for the current observation. Point-wise features that comprise spatial positions (and surface normal vectors in the case of structured meshes), and their corresponding image features, are used to encode the observation and represent the underlying 3D volume. The actor and value networks are applied iteratively to estimate a sequence of transformations that enable accurate delineation of object boundaries. The proposed approach was extensively evaluated in both segmentation and registration tasks using a variety of challenging clinical datasets. Our method has fewer trainable parameters and lower computational complexity compared to the 3D U-Net, and it is independent of the volume resolution. We show that the proposed method is applicable to mono- and multi-modal segmentation tasks, achieving significant improvements over the state-of-the-art for the latter. The flexibility of the proposed framework is further demonstrated for a multi-modal registration application. As we learn to predict actions rather than a target, the proposed method is more robust compared to the 3D U-Net when dealing with previously unseen datasets, acquired using different protocols or modalities. As a result, the proposed method provides a promising multi-purpose segmentation and registration framework, particular in the context of image-guided interventions.","authors":["Xia Zhong","Mario Amrehn","Nishant Ravikumar","Shuqing Chen"],"meta":["February 2021Scientific Reports 11(1)","DOI:10.1038/s41598-021-82370-6"],"references":["337847178_Automatic_Multi-organ_Segmentation_in_Dual_Energy_CT_DECT_with_Dedicated_3D_Fully_Convolutional_DECT_Networks","335156767_Evaluation_of_MRI_to_Ultrasound_Registration_Methods_for_Brain_Shift_Correction_The_CuRIOUS2018_Challenge","327659688_Resolve_Intraoperative_Brain_Shift_as_Imitation_Game_International_Workshops_POCUS_2018_BIVPCS_2018_CuRIOUS_2018_and_CPM_2018_Held_in_Conjunction_with_MICCAI_2018_Granada_Spain_September_16-20_2018_Pr","327100439_Resolve_Intraoperative_Brain_Shift_as_Imitation_Game","326327430_Automatic_multi-organ_segmentation_in_dual_energy_CT_using_3D_fully_convolutional_network","336391318_A_Joint_3D_UNet-Graph_Neural_Network-Based_Method_for_Airway_Segmentation_from_Chest_CTs","334440475_Unsupervised_Learning_of_Probabilistic_Diffeomorphic_Registration_for_Images_and_Surfaces","329747212_An_Unsupervised_Learning_Model_for_Deformable_Medical_Image_Registration","327629575_The_Deep_Poincare_Map_A_Novel_Approach_for_Left_Ventricle_Segmentation_21st_International_Conference_Granada_Spain_September_16-20_2018_Proceedings_Part_IV","327626921_Unsupervised_Learning_for_Fast_Probabilistic_Diffeomorphic_Registration_21st_International_Conference_Granada_Spain_September_16-20_2018_Proceedings_Part_I"]}