{"id":"349195067_Serious_Games_-_Communication_Aspects_of_VR_Cadet_Training_Information_Model","abstract":"The paper deals with the communication aspects of training cadets using serious virtual reality games and is an initial step in defining the framework of a standard VR information model in the military training aimed at defining additional categories of data that do not appear in any of the existing information models. The first part of the paper deals with the conceptual definition of serious games, and in the following, the process of simulating serious games in training cadets is elaborated. The research problem is primarily focused on examining the communication aspects of a theoretically designed serious game and its effects. For the purpose of designing the VR information model, a pilot survey was conducted with cadets of the Croatian Military Academy, using 113 questionnaires, with 113 of them from all generations of training. The obtained results confirmed the initial assumption about the correlation of serious game and simulation game in the domain of virtual reality. In addition, the results indicate a potential correlation between the frequency of performing a particular type of serious play and the selection of military service. All of the above implies the need for further systematic research into the subject matter.","authors":["Jadranko Tuta","Ljerka Luić"],"meta":["May 2020WSEAS Transactions on Business and Economics 17:560-569","DOI:10.37394/23207.2020.17.55"],"references":["321666420_Virtual_Reality_Applications_for_the_Assessment_and_Treatment_of_PTSD","274775610_The_Impact_of_Gamification_-_Recommending_Education_Scenarios","259132830_L'utilisation_de_la_realite_virtuelle_dans_le_traitement_des_troubles_mentaux","251188523_Virtual_reality_and_its_military_utility","241093193_A_Virtual_Reality_Exposure_Therapy_Application_for_Iraq_War_Military_Personnel_with_Post_Traumatic_Stress_Disorder_From_Training_to_Toy_to_Treatment","264594690_Virtual_Reality_Technology"]}