{"id":"349214021_Intelligent_Neutrosophic_Diagnostic_System_for_Cardiotocography_Data","abstract":"Cardiotocography data uncertainty is a critical task for the classification in biomedical field. Constructing good and efficient classifier via machine learning algorithms is necessary to help doctors in diagnosing the state of fetus heart rate. The proposed neutrosophic diagnostic system is an Interval Neutrosophic Rough Neural Network framework based on the backpropagation algorithm. It benefits from the advantages of neutrosophic set theory not only to improve the performance of rough neural networks but also to achieve a better performance than the other algorithms. The experimental results visualize the data using the boxplot for better understanding of attribute distribution. The performance measurement of the confusion matrix for the proposed framework is 95.1, 94.95, 95.2, and 95.1 concerning accuracy rate, precision, recall, and F1-score, respectively. WEKA application is used to analyse cardiotocography data performance measurement of different algorithms, e.g., neural network, decision table, the nearest neighbor, and rough neural network. The comparison with other algorithms shows that the proposed framework is both feasible and efficient classifier. Additionally, the receiver operation characteristic curve displays the proposed framework classifications of the pathologic, normal, and suspicious states by 0.93, 0.90, and 0.85 areas that are considered high and acceptable under the curve, respectively. Improving the performance measurements of the proposed framework by removing ineffective attributes via feature selection would be suitable advancement in the future. Moreover, the proposed framework can also be used in various real-life problems such as classification of coronavirus, social media, and satellite image.","authors":["Belal Amin","A. A. Salama","I M El-Henawy","Khaled Mahfouz"],"meta":["February 2021Computational Intelligence and Neuroscience 2021(1)","DOI:10.1155/2021/6656770","Projects: Arabian ScientistsNew Trends in Neutrosophic Theory and Applications"],"references":["350133791_A_Comparative_Performance_Analysis_of_Classification_Algorithms_Using_Weka_Tool_Of_Data_Mining_Techniques","341446306_Performance_evaluation_of_Machine_learning_algorithms_in_Biomedical_Document_Classification","339621732_A_Hybrid_Neuro-Fuzzy_and_Feature_Reduction_Model_for_Classification","336202266_Classifying_Cardiotocography_Data_based_on_Rough_Neural_Network","330103170_Cardiotocography_Data_Set_Classification_with_Extreme_Learning_Machine","327138664_A_Novel_approach_for_classify_MANETs_attacks_with_a_neutrosophic_intelligent_system_based_on_genetic_algorithm","324614284_A_comparison_of_performance_metrics_for_event_classification_in_Non-Intrusive_Load_Monitoring","337286920_Back_To_The_Future_Radial_Basis_Function_Network_Revisited","336420026_Introducing_Fuzzy_Layers_for_Deep_Learning","321398185_A_Neuro-Fuzzy_Approach_to_Simulate_the_User_Mode_Choice_Behaviour_in_a_Travel_Decision_Framework"]}