{"id":"349247284_Few-shot_pulse_wave_contour_classification_based_on_multi-scale_feature_extraction","abstract":"The annotation procedure of pulse wave contour (PWC) is expensive and time-consuming, thereby hindering the formation of large-scale datasets to match the requirements of deep learning. To obtain better results under the condition of few-shot PWC, a small-parameter unit structure and a multi-scale feature-extraction model are proposed. In the small-parameter unit structure, information of adjacent cells is transmitted through state variables. Simultaneously, a forgetting gate is used to update the information and retain long-term dependence of PWC in the form of unit series. The multi-scale feature-extraction model is an integrated model containing three parts. Convolution neural networks are used to extract spatial features of single-period PWC and rhythm features of multi-period PWC. Recursive neural networks are used to retain the long-term dependence features of PWC. Finally, an inference layer is used for classification through extracted features. Classification experiments of cardiovascular diseases are performed on photoplethysmography dataset and continuous non-invasive blood pressure dataset. Results show that the classification accuracy of the multi-scale feature-extraction model on the two datasets respectively can reach 80% and 96%, respectively.","authors":["Peng Lu","Chao Liu","Xiaobo Mao","Yvping Zhao"],"meta":["February 2021Scientific Reports 11(1)","DOI:10.1038/s41598-021-83134-y"],"references":["342842327_Adaptive_time_scales_in_recurrent_neural_networks","341438732_A_Comparative_Study_and_Analysis_of_Time_Series_Forecasting_Techniques","341350027_Signal_Quality_Evaluation_of_Single-period_Radial_Artery_Pulse_Wave_Based_on_Machine_Learning_Preprint","340949993_Optimized_Mahalanobis-Taguchi_System_for_High-Dimensional_Small_Sample_Data_Classification","343279133_A_non-invasive_continuous_cuffless_blood_pressure_estimation_using_dynamic_Recurrent_Neural_Networks","342643053_A_novel_optimized_repeatedly_random_undersampling_for_selecting_negative_samples_A_case_study_in_an_SVM-based_forest_fire_susceptibility_assessment","342228969_Random_recurrent_neural_networks_with_delays","341349632_Fault_diagnosis_of_high-speed_train_bogie_based_on_LSTM_neural_network","341082932_Fusion_enhancement_for_tracking_of_respiratory_rate_through_intrinsic_mode_functions_in_photoplethysmography","339550723_Speech_emotion_recognition_with_deep_convolutional_neural_networks"]}