{"id":"349259701_Dashboard_COMPRIME_COMPRI_MOv_Multiscalar_Spatio-Temporal_Monitoring_of_the_COVID-19_Pandemic_in_Portugal","abstract":"Due to its novelty, the recent pandemic of the coronavirus disease (COVID-19), which is associated with the spread of the new severe acute respiratory syndrome coronavirus (SARS-CoV-2), triggered the public’s interest in accessing information, demonstrating the importance of obtaining and analyzing credible and updated information from an epidemiological surveillance context. For this purpose, health authorities, international organizations, and university institutions have published online various graphic and cartographic representations of the evolution of the pandemic with daily updates that allow the almost real-time monitoring of the evolutionary behavior of the spread, lethality, and territorial distribution of the disease. The purpose of this article is to describe the technical solution and the main results associated with the publication of the COMPRIME_COMPRI_MOv dashboard for the dissemination of information and multi-scale knowledge of COVID-19. Under two rapidly implementing research projects for innovative solutions to respond to the COVID-19 pandemic, promoted in Portugal by the FCT (Foundation for Science and Technology), a website was created. That website brings together a diverse set of variables and indicators in a dynamic and interactive way that reflects the evolutionary behavior of the pandemic from a multi-scale perspective, in Portugal, constituting itself as a system for monitoring the evolution of the pandemic. In the current situation, this type of exploratory solutions proves to be crucial to guarantee everyone’s access to information while simultaneously emerging as an epidemiological surveillance tool that is capable of assisting decision-making by public authorities with competence in defining control policies and fight the spread of the new coronavirus.","authors":["Nuno Costa","Nelson Mileu","André Alves"],"meta":["February 2021Future Internet 13(2):45","DOI:10.3390/fi13020045"],"references":["345807019_O_mosaico_territorial_do_risco_ao_contagio_e_a_mortalidade_por_COVID-19_em_Portugal_continental","343792367_Shiny_Dashboard_for_Monitoring_the_COVID-19_Pandemic_in_Spain","343276683_A_PANDEMIA_COVID-19_EM_PORTUGAL_CONTINENTAL_-_UMA_ANALISE_GEOGRAFICA_DA_EVOLUCAO_VERIFICADA_NOS_MESES_DE_MARCO_E_ABRIL","342692349_Application_of_Geospatial_Technologies_in_the_COVID-19_Fight_of_Ghana","342011335_Online_dashboard_and_data_analysis_approach_for_assessing_COVID-19_case_and_death_data","342006630_Spatial_analysis_and_GIS_in_the_study_of_COVID-19_A_review","340072277_COVID-19_Challenges_to_GIS_with_Big_Data","339401203_Geographical_tracking_and_mapping_of_coronavirus_disease_COVID-19severe_acute_respiratory_syndrome_coronavirus_2_SARS-CoV-2_epidemic_and_associated_events_around_the_world_How_21st_century_GIS_technol","354354210_O_processo_pandemico_da_COVID-19_Em_Portugal_Continental_Analise_geografica_dos_primeiros_100_dias","341941348_Building_a_statistical_surveillance_dashboard_for_COVID-19_infection_worldwide_Building_a_statistical_surveillance_dashboard_for_COVID-19_infection_worldwide"]}