{"id":"349256952_Assessing_the_significance_of_directed_and_multivariate_measures_of_linear_dependence_between_time_series","abstract":"Inferring linear dependence between time series is central to our understanding of natural and artificial systems. Unfortunately, the hypothesis tests that are used to determine statistically significant directed or multivariate relationships from time-series data often yield spurious associations (Type I errors) or omit causal relationships (Type II errors). This is due to the autocorrelation present in the analyzed time series—a property that is ubiquitous across diverse applications, from brain dynamics to climate change. Here we show that, for limited data, this issue cannot be mediated by fitting a time-series model alone (e.g., in Granger causality or prewhitening approaches), and instead that the degrees of freedom in statistical tests should be altered to account for the effective sample size induced by cross-correlations in the observations. This insight enabled us to derive modified hypothesis tests for any multivariate correlation-based measures of linear dependence between covariance-stationary time series, including Granger causality and mutual information with Gaussian marginals. We use both numerical simulations (generated by autoregressive models and digital filtering) as well as recorded fMRI-neuroimaging data to show that our tests are unbiased for a variety of stationary time series. Our experiments demonstrate that the commonly used F- and χ2-tests can induce significant false-positive rates of up to 100% for both measures, with and without prewhitening of the signals. These findings suggest that many dependencies reported in the scientific literature may have been, and may continue to be, spuriously reported or missed if modified hypothesis tests are not used when analyzing time series.","authors":["Oliver Michael Cliff","Leonardo Novelli","Ben Fulcher","James M Shine"],"meta":["February 2021Physical Review Research 3(1)","DOI:10.1103/PhysRevResearch.3.013145"],"references":["333533125_Effective_degrees_of_freedom_of_the_Pearson's_correlation_coefficient_under_autocorrelation","322667904_Minimising_the_Kullback-Leibler_Divergence_for_Model_Selection_in_Distributed_Nonlinear_Systems","321325142_Accurate_autocorrelation_modeling_substantially_improves_fMRI_reliability","321139394_The_influence_of_filtering_and_downsampling_on_the_estimation_of_transfer_entropy","332745276_Large-scale_directed_network_inference_with_multivariate_transfer_entropy_and_hierarchical_statistical_testing","332729427_The_Analysis_of_Time_Series_An_Introduction_with_R","316806505_Springer_Series_in_Statistics","313617155_Dynamical_systems_and_turbulence","310543893_An_Introduction_to_Transfer_Entropy","307204922_Certain_generalizations_in_the_analysis_of_variance_Biometrika"]}