{"id":"349220417_Driven_by_Emotions_The_Effect_of_Attitudes_on_Intention_and_Behaviour_regarding_Open_Educational_Resources_OER","abstract":"Open Educational Resources (OER) have become widespread, but constantly lack adoption. The various studies that address this lack predominantly focus on structural causes (e.g. lack of time, legal uncertainty) while omitting individual factors. However, the latter especially can yield insights into the 'black box' of individual drivers for OER engagement. Employing a theoretical concept of attitudes, we investigate whether feelings and emotions or knowledge and beliefs mainly drive intention and behaviour regarding OER. Based on our theoretical concept, we designed a survey and distributed it in OER related occasions to scrutinise the participants' attitudes. Our findings disclose that intention and behaviour correlate with strong emotions and feelings for the underlying core ideas and values of OER. Beliefs are more robust in the abstract than in the concrete OER benefits. It is noteworthy that beliefs are widely absent from the level of knowledge about OER. The actual use of OER, however, correlates with the level of knowledge. Against this background, it is reasonable to argue that neither exclusively dismantling structural barriers nor solely promoting OER is a suitable strategy for increasing adoption. Not until educational institutions are guided and act on the basis of the key drivers of OER, their underlying ideas and value, can they spur engagement for OER among educational practitioners. Strengthening knowledge and beliefs about OER must therefore be the next logical step.","authors":["Daniel Otto"],"meta":["February 2021Journal of Interactive Media in Education 2021(1):1","DOI:10.5334/jime.606"],"references":["337906432_Adoption_and_Diffusion_of_Open_Educational_Resources_OER_in_Education_A_Meta-Analysis_of_25_OER-Projects","328384590_An_exploratory_literature_review_on_open_educational_practices","324678551_Conceptualising_OEP_A_review_of_theoretical_and_empirical_literature_in_Open_Educational_Practices","316064676_What_is_Open_Pedagogy","290151640_The_Limitations_of_Access_Alone_moving_towards_open_processes_in_education_technology","287835318_A_Path_Analysis_of_Educator_Perceptions_of_Open_Educational_Resources_Using_the_Technology_Acceptance_Model","286535713_Exploring_the_Barriers_and_Enablers_to_the_Use_of_Open_Educational_Resources_by_University_Academics_in_Africa","286239331_ATTITUDES_AND_UTILIZATION_OF_OPEN_EDUCATIONAL_RESOURCES","325170463_German_OER_Practices_and_Policy_-_from_Bottom-up_to_Top-down_Initiatives","319280238_Open_educational_resources_removing_barriers_from_within"]}