{"id":"349286607_Elderly_Perception_on_the_Internet_of_Things-Based_Integrated_Smart-Home_System","abstract":"An integrated smart home system (ISHS) is an effective way to improve the quality of life of the elderly. The elderly’s willingness is essential to adopt an ISHS; to the best of our knowledge, no study has investigated the elderly’s perception of ISHS. Consequently, this study aims to investigate the elderly’s perception of the ISHS by comprehensively evaluating its possible benefits and negative responses. A set of sensors required for an ISHS was determined, and interviews were designed based on four factors: perceived comfort, perceived usability, perceived privacy, and perceived benefit. Subsequently, technological trials of the sensor-set followed by two focus group interviews were conducted on nine independently living elderly participants at a senior welfare center in South Korea. Consistent with previous studies, the results of this investigation indicate that elderly participants elicited negative responses regarding usability complexity, and discomfort to daily activities. Despite such negative responses, after acquiring enough awareness about the ISHS’s benefits, the elderly acknowledged its necessity and showed a high level of willingness. Furthermore, these results indicate that for a better adoption of an ISHS, sufficient awareness regarding its benefits and development of elderly-friendly smart home sensors that minimize negative responses are required.","authors":["Tae Hee Jo","Jaehoon Ma","Seung Hyun Cha"],"meta":["February 2021Sensors 21(4):1284","DOI:10.3390/s21041284"],"references":["342050461_Design_and_evaluation_of_a_mobile_smart_home_interactive_system_with_elderly_users_in_Brazil","341765481_Perceptions_on_smart_home_concept_among_the_millennials_in_Johor","338794775_A_Critical_Review_of_Smart_Residential_Environments_for_Older_Adults_With_a_Focus_on_Pleasurable_Experience","332727987_Smart_technology_for_healthcare_Exploring_the_antecedents_of_adoption_intention_of_healthcare_wearable_technology","332414426_The_responses_of_older_adults_to_smart_energy_monitors","332284670_Accelerometer-Based_Human_Fall_Detection_Using_Convolutional_Neural_Networks","345839128_Identifying_user_requirements_of_wearable_healthcare_technologies_for_Chinese_ageing_population","339780423_Aging_Population_Perception_and_Post_Adoption_Behavior_About_the_Usability_of_Smart_Home_Technology_of_Pakistani_Culture","337712833_User_acceptance_of_smart_wearable_devices_An_expectation-confirmation_model_approach","332060048_Older_women's_perceptions_of_wearable_and_smart_home_activity_sensors"]}