{"id":"349236340_Penentuan_Centroid_Awal_Pada_Algoritma_K-Means_Dengan_Dynamic_Artificial_Chromosomes_Genetic_Algorithm_Untuk_Tuberculosis_Dataset_Pre-Centroid_Determination_in_K-Means_Algorithm_using_Dynamic_Artifici","abstract":"Abstrak Data mining merupakan disiplin ilmu yang mempelajari metode untuk mengekstraksi data menghasilkan informasi. Salah satunya adalah klastering yang berfungsi untuk mengelompokkan data berdasarkan tingkat kemiripan dan jarak minimum. Algoritma K-Means sangat populer dan banyak digunakan diberbagai bidang seperti bidang pendidikan, kesehatan, sosial, biologi, ilmu komputer. Metode K-Means sering dikombinasikan dengan metode optimasi seperti algoritma genetika atau GA untuk mengatasi permasalah pada K-Means yaitu sensitif dalam penentuan centroid awal. Penelitian ini mengkombinasikan Dynamic Artificial Cromosomes Genetic Algorithm atau DAC GA dengan K-Means dalam menentukan nilai centroid awal. Hasil eksperimen menunjukkan bahwa metode DAC GA + K-Means lebih unggul dibandingkan dengan K-Means dan GA + K-Means. 2 dataset yang diuji dengan optimal nilai klaster sebanyak 2 dan 1 dataset sebanyak 3 klaster. Metode tersebut perolehan nilai DBI sebesar 0.138, 0.279 serta 0.382, nilai Sum Square Error sebesar 92.56, 332,39 dan 1280.68 serta nilai fitness yang tebentuk adalah 7.12, 3.57 dan 2.13. Abstract Data mining is a scientific discipline that studies methods for extracting data to produce information. One of them is clustering which functions to classify data based on the level of similarity and minimum distance. The K-Means algorithm is very popular and widely used in various fields such as education, health, social, biology, computer science. The K-Means method is often combined with optimization methods such as genetic algorithms or GA to solve the problem of K-Means, which is sensitive in determining the initial centroid. This study combines Dynamic Artificial Chromosomes Genetic Algorithm or DAC GA with K-Means in determining the initial centroid value. The experimental results show that the GA + K-Means DAC method is superior to the K-Means and GA + K-Means methods. 2 datasets were tested with optimal cluster values of 2 and 1 dataset of 3 clusters. This method obtains DBI values of 0.138, 0.279 and 0.382, the Sum Square Error values of 92.56, 332.39 and 1280.68 and the formed fitness values are 7.12, 3.57 and 2.13.","authors":["Mur Salim","Purwanto Purwanto","M Arief Soeleman"],"meta":["February 2021Techno Com 20(1):97-108"],"references":["345263328_Integrasi_Kromosom_Buatan_Dinamis_untuk_Memecahkan_Masalah_Konvergensi_Prematur_pada_Algoritma_Genetika_untuk_Traveling_Salesman_Problem","335938455_Optimasi_Pengelompokan_Data_Pada_Metode_K-means_dengan_Analisis_Outlier","322276943_Combination_of_K-means_clustering_with_Genetic_Algorithm_A_review","316431082_A_Novel_Cluster_Center_Fast_Determination_Clustering_Algorithm","266646740_A_new_algorithm_for_choosing_initial_cluster_centers_for_k-means","264623472_A_Hybrid_Clustering_Technique_Combining_a_Novel_Genetic_Algorithm_with_K-Means","332805999_Introduction_to_Data_Mining","282373596_New_improved_technique_for_initial_cluster_centers_of_K_means_clustering_using_Genetic_Algorithm","273401607_Using_group_genetic_algorithm_to_improve_performance_of_attribute_clustering","261851608_A_new_grouping_genetic_algorithm_for_clustering_problems","224377470_A_Cluster_Separation_Measure","257404536_A_Comparative_Study_of_Efficient_Initialization_Methods_for_the_K-Means_Clustering_Algorithm","224839970_Some_Methods_for_Classification_and_Analysis_of_MultiVariate_Observations","220647183_A_new_algorithm_for_initial_cluster_centers_in_k-means_algorithm","220215479_Dynamic_diversity_control_in_genetic_algorithm_for_mining_unsearched_solution_space_in_TSP_problems"]}