{"id":"349286720_Using_Unplugged_Computational_Thinking_to_Scaffold_Natural_Selection_Learning","abstract":"Computational thinking (CT) is a thought process composed of computer science ideas and skills that can be applied to solve problems and better understand the world around us. With the increase in technology and computing, STEM disciplines are becoming interwoven with computing. In order to better prepare students for STEM careers, computational literacy needs to be developed in K–12 education. We advocate the introduction of computational literacy through the incorporation of CT in core science courses, such as biology. Additionally, at least some of this integration should be unplugged, or without computers, so that all schools can participate in developing computational literacy. These lessons integrate unplugged CT and science content to help students develop CT competencies and learn natural selection content simultaneously through a series of lessons in which unplugged CT is leveraged for natural selection learning within varying contexts. In these lessons, students engage in the creation of handwritten algorithmic explanations of natural selection. Students build CT skills while making sense of the process, resulting in converged learning about CT and science. This article presents a description of CT, the specifics of the classroom implementation and lessons, student work and outcomes, and conclusions drawn from this work.","authors":["Amanda Peel","Troy D. Sadler","Patricia Friedrichsen"],"meta":["February 2021The American Biology Teacher 83(2):112-117","DOI:10.1525/abt.2021.83.2.112"],"references":["323662208_Modeling_the_Emergence_of_Antibiotic_Resistance_in_Bacterial_Populations","311242962_Exploring_the_influence_of_plant_and_animal_item_contexts_on_student_response_patterns_to_natural_selection_multiple_choice_items","274309848_Computational_Thinking","228030199_The_future_of_natural_selection_knowledge_measurement_A_reply_to_Anderson_et_al_2010","225401882_Understanding_Natural_Selection_Essential_Concepts_and_Common_Misconceptions","331347964_Learning_natural_selection_through_computational_thinking_Unplugged_design_of_algorithmic_explanations","330232468_Students'_model-based_explanations_about_natural_selection_and_antibiotic_resistance_through_socio-scientific_issues-based_learning","327025793_Characteristics_of_Studies_Conducted_on_Computational_Thinking_A_Content_Analysis_Foundations_and_Research_Highlights","321990920_Algorithms_Abstractions_and_Iterations_Teaching_Computational_Thinking_Using_Protein_Synthesis_Translation"]}