{"id":"349271122_The_Entropy_Universe","abstract":"About 160 years ago, the concept of entropy was introduced in thermodynamics by Rudolf Clausius. Since then, it has been continually extended, interpreted, and applied by researchers in many scientific fields, such as general physics, information theory, chaos theory, data mining, and mathematical linguistics. This paper presents The Entropy Universe, which aims to review the many variants of entropies applied to time-series. The purpose is to answer research questions such as: How did each entropy emerge? What is the mathematical definition of each variant of entropy? How are entropies related to each other? What are the most applied scientific fields for each entropy? We describe in-depth the relationship between the most applied entropies in time-series for different scientific fields, establishing bases for researchers to properly choose the variant of entropy most suitable for their data. The number of citations over the past sixteen years of each paper proposing a new entropy was also accessed. The Shannon/differential, the Tsallis, the sample, the permutation, and the approximate entropies were the most cited ones. Based on the ten research areas with the most significant number of records obtained in the Web of Science and Scopus, the areas in which the entropies are more applied are computer science, physics, mathematics, and engineering. The universe of entropies is growing each day, either due to the introducing new variants either due to novel applications. Knowing each entropy’s strengths and of limitations is essential to ensure the proper improvement of this research field.","authors":["Maria Ribeiro","Teresa Henriques","Luísa Castro","André Souto"],"meta":["February 2021Entropy 23(2):222","DOI:10.3390/e23020222"],"references":["342688477_Connections_between_Weighted_Generalized_Cumulative_Residual_Entropy_and_Variance","338593920_Funding_information_in_Web_of_Science_An_updated_overview","336061532_A_Dynamical_Systems-Based_Hierarchy_for_Shannon_Metric_and_Topological_Entropy","333800532_A_review_of_entropy_measures_for_uncertainty_quantification_of_stochastic_processes","333769329_A_Note_on_the_Notions_of_Topological_Entropy","328481053_A_Brief_Review_of_Generalized_Entropies","328033163_Entropy_Power_Autoregressive_Models_and_Mutual_Information","353355052_This_is_IT_A_Primer_on_Shannon's_Entropy_and_Information","343439118_Analytical_Formulation_of_Bubble_Entropy_for_Autoregressive_Processes","340836241_Gibbs_and_Boltzmann_Entropy_in_Classical_and_Quantum_Mechanics"]}