{"id":"349282528_Taxonomia_de_actividades_desconectadas_para_el_desarrollo_de_pensamiento_computacional_A_taxonomy_of_unplugged_activities_for_computational_thinking_development","abstract":"En los últimos años, las habilidades y los conocimientos relacionados con la programación y la resolución de problemas, enmarcados bajo el nombre de pensamiento computacional, han adquirido cada vez más importancia para la educación de los jóvenes. Existen, por ello, diferentes estrategias y recursos educativos que pueden utilizarse para promover y trabajar esos temas. Las actividades desconectadas se constituyen como una estrategia posible a utilizar y están compuestas de actividades que no requieren de tecnologías digitales ni de conocimientos técnicos para realizarse. Además, su oferta es amplia y variada. Sin embargo, la efectividad y la caracterización de este tipo de propuestas aún no han sido analizadas en profundidad. Por tal motivo, en este trabajo, se propone una taxonomía destinada a facilitar la comprensión y el análisis de las actividades desconectadas, ayudando así a identificar sus potencialidades y a plantear oportunidades de apropiación docente.\n\nPalabras clave: pensamiento computacional; ciencias de la computación; actividades desconectadas; taxonomía; recursos educativos.\n\nIn the last years, skills and knowledge related to programming and problem-solving skills, framed under the name of computational thinking, have become increasingly important in the educational context. There are, therefore, several educational strategies and resources for the development of computational thinking, for example, the unplugged activities. Such activities do not require digital technologies or technical knowledge to be carried out, and there is a big and diverse offer of them on the internet. However, the effectiveness and characterization of this type of proposal have not yet been deeply analysed. For this reason, this article offers a taxonomy and theoretical tools to facilitate the understanding and the analysis of unplugged activities, thus helping to identify their potentialities and to propose opportunities for teachers’ appropriation.\n\nKeywords: computational thinking; computer sciences; unplugged activities; taxonomy; educational resources\n\nIGLESIAS, A. Y BORDIGNON, F. (2021). Taxonomía de actividades desconectadas para el desarrollo de pensamiento computacional. Virtualidad, Educación y Ciencia, 22 (12), pp. 119-135.","authors":["Alejandro Iglesias","Fernando R. A. Bordignon"],"meta":["February 2021"],"references":["336863867_Saberes_digitales_en_la_educacion_primaria_y_secundaria_de_la_Republica_Argentina","326002159_Training_Computational_Thinking_through_board_games_The_case_of_Crabs_Turtles","317013386_Exploring_Bebras_Tasks_Content_and_Performance_A_Multinational_Study","305092381_Programming_Unplugged_Bridging_CS_Unplugged_Activities_Gap_for_Learning_Key_Programming_Concepts","301463521_Teaching_Computer_Science_to_5-7_year-olds_An_initial_study_with_Scratch_Cubelets_and_unplugged_computing","274309848_Computational_Thinking","266882704_Computer_Science_Unplugged_school_students_doing_real_computing_without_computers","319360207_Engaging_young_learners_in_making_games_an_exploratory_study","305081780_Back_to_School_Computer_Science_Unplugged_in_the_Wild","300918005_Scratch_A_Way_to_Logo_and_Python","241623893_CS_Unplugged_and_Middle-School_Students'_Views_Attitudes_and_Intentions_Regarding_CS","228717382_Developing_Algorithmic_Thinking_by_Inventing_and_Playing_Algorithms","262175270_Digital_playgrounds_for_early_computing_education","237540181_Bebras_International_Contest_on_Informatics_and_Computer_Literacy_The_Educational_Benefit_of_Solving_Short_Informatics_Tasks","227075311_Rediscovering_Froebel_A_Call_to_Re-examine_his_Life_Gifts"]}