{"id":"349384610_Research_Status_and_Future_Development_of_Endpoint_Detection_Algorithms_Based_on_Computer_Science_Language_Signals","abstract":"Today is an information technology era, language signal recognition technology, language signal coding technology and a variety of new language technology will be widely used in all areas of our life, such as: security field, human-computer interaction, communication field. We can accurately analyze pure speech signals and silent segments in a speech by using language signal endpoint detection technology, which will bring decisive effects to the efficiency of ASR and ASC. Three steps can be used to represent the language endpoint detection model, namely, the language signal preprocessing step, the extraction of the characteristic vector of the whole language flow, and the establishment of the language endpoint discrimination model. Finally, the speech endpoint discrimination model is established. The traditional speech endpoint detection algorithms include the two threshold method based on time domain, the universal entropy method based on frequency domain and the invert characteristic method. Aiming at the low SNR and complex noise environment, in order to obtain satisfactory endpoint detection effect, this paper proposes an endpoint detection model based on optimized Extreme Learning machine (ELM), and makes up for the deficiencies of the algorithm itself by optimizing network connection parameters [1-2] .","authors":["Juan Wang"],"meta":["February 2021Journal of Physics Conference Series 1744(3):032128","DOI:10.1088/1742-6596/1744/3/032128"],"references":["315447566_Speech_endpoint_detection_based_on_critical_band_and_energy_entropy","301443269_Modified_energy_based_method_for_word_endpoints_detection_of_continuous_speech_signal_in_real_world_environment","287504293_Weighted_Finite_State_Transducer-Based_Endpoint_Detection_Using_Probabilistic_Decision_Logic","272114438_The_Research_of_Speech_Recognition_in_Low_SNR_Based_on_GA-SVM","262424734_Speech_endpoint_detection_with_low_SNR_based_on_HHTSM","220321951_Voice_activity_detection_based_on_multiple_statistical_models"]}