{"id":"349352389_An_ecologically_motivated_image_dataset_for_deep_learning_yields_better_models_of_human_vision","abstract":"Deep neural networks provide the current best models of visual information processing in the primate brain. Drawing on work from computer vision, the most commonly used networks are pretrained on data from the ImageNet Large Scale Visual Recognition Challenge. This dataset comprises images from 1,000 categories, selected to provide a challenging testbed for automated visual object recognition systems. Moving beyond this common practice, we here introduce ecoset , a collection of >1.5 million images from 565 basic-level categories selected to better capture the distribution of objects relevant to humans. Ecoset categories were chosen to be both frequent in linguistic usage and concrete, thereby mirroring important physical objects in the world. We test the effects of training on this ecologically more valid dataset using multiple instances of two neural network architectures: AlexNet and vNet, a novel architecture designed to mimic the progressive increase in receptive field sizes along the human ventral stream. We show that training on ecoset leads to significant improvements in predicting representations in human higher-level visual cortex and perceptual judgments, surpassing the previous state of the art. Significant and highly consistent benefits are demonstrated for both architectures on two separate functional magnetic resonance imaging (fMRI) datasets and behavioral data, jointly covering responses to 1,292 visual stimuli from a wide variety of object categories. These results suggest that computational visual neuroscience may take better advantage of the deep learning framework by using image sets that reflect the human perceptual and cognitive experience. Ecoset and trained network models are openly available to the research community.","authors":["Johannes Mehrer","Courtney J. Spoerer","Emer C. Jones","Nikolaus Kriegeskorte"],"meta":["February 2021Proceedings of the National Academy of Sciences 118(8):e2011417118","DOI:10.1073/pnas.2011417118"],"references":["351370658_Unsupervised_learning_predicts_human_perception_and_misperception_of_gloss","347339501_Going_in_circles_is_the_way_forward_the_role_of_recurrence_in_visual_inference","346527091_Individual_differences_among_deep_neural_network_models","346064398_Recurrent_neural_networks_can_explain_flexible_trading_of_speed_and_accuracy_in_biological_vision","344667279_Revealing_the_multidimensional_mental_representations_of_natural_objects_underlying_human_similarity_judgements","341889645_A_map_of_object_space_in_primate_inferotemporal_cortex","341268229_Diverse_deep_neural_networks_all_predict_human_IT_well_after_training_and_fitting","338285251_The_infant's_face_diet_Data_on_3-month-old_infant-perspective_experience_with_faces_video-recorded_in_their_typical_daily_environment","338586262_SAYCam_A_large_longitudinal_audiovisual_dataset_recorded_from_the_infant's_perspective","336860572_A_deep_learning_framework_for_neuroscience"]}