{"id":"349310241_Risk_Analysis_Model_That_Uses_Machine_Learning_to_Predict_the_Likelihood_of_a_Fire_Occurring_at_A_Given_Property","abstract":"Combining multiple datasets and applying machine learning algorithms would help city officials and fire services direct their resources more efficiently, avoid disasters, and save lives in the occurrence of a fire incident. Also, it might at most help in making accurate forecasts about where fires are going to occur. Every year, the risk analysis model that implements machine learning responds to emergency calls and helps prevent the occurrence of a fire incident. It is because they can give out smoke alarms, inspect commercial buildings, and educate the community on matters that surround risky behaviors that may trigger fire, among other preemptive actions. Additionally, this success comes along with challenges and associated problems such as limited resources. For this very time, they have only achieved very little in terms of risk analysis mechanisms. Predicting the occurrence of fire in property constitutes a very significant component in management and analysis of fire. This is because it plays a significant role in recovery efforts, mitigation, and resource allocation. It is challenging to accurately predict a fire incident, although it is an essential factor in protecting property and human life. This paper provides the proposed models, which are focused on statistical machine learning and risks optimized by the use of indexing for assessment fire risks. Generally, the models that are currently used in predicting fire does not provide satisfaction and accuracy. The factors that affect the occurrence of fire are the frequency of fire occurrence and diversity, which are very sparse. Therefore, to improve the accuracy of predicting fire occurrence, there must be a risk analysis model that implements smart machine learning technology. This research paper presents an analysis and description of property fire prediction methods based on machine learning. A novel algorithm for property fire risk prediction, which is based on machine learning, is presented. Also, the implementation of the algorithm that uses data from different frameworks is demonstrated in having the ability to predict the fire occurrence accurately.","authors":["Lakshmisri Surya"],"meta":["March 2017SSRN Electronic Journal 5(1):959","DOI:10.1729/Journal.25787","Project: Artificial Intelligence"],"references":["319769912_Hidden_Technical_Debt_in_Machine_Learning_Systems","299423480_Data_Mining_Techniques_Applied_to_Wireless_Sensor_Networks_for_Early_Forest_Fire_Detection","287863331_Applying_Decision_Tree_Algorithm_and_Neural_Networks_to_Predict_Forest_Fires_in_Lebanon","283830148_Fire_risk_assessment_with_scoring_system_using_the_support_vector_machine_approach","274889641_Predicting_Burned_Areas_of_Forest_Fires_An_Artificial_Intelligence_Approach","269113003_A_review_on_wireless_sensor_node_architectures","299317381_Building_Fire_Risk_Analysis","289527893_Investigation_of_general_indicators_influencing_on_forest_fire_and_its_susceptibility_modeling_using_different_data_mining_techniques","271767718_Introduction_to_Fire_Risk_Analysis","262030045_Deep_Learning_in_Neural_Networks_An_Overview"]}