{"id":"349351407_A_parametrized_ranking-based_semantics_compatible_with_persuasion_principles","abstract":"In this work, we question the ability of existing ranking-based semantics to capture persuasion settings, emphasising in particular the phenomena of procatalepsis (the fact that it is often efficient to anticipate the counter-arguments of the audience) and of fading (the fact that long lines of argumentation become ineffective). Some widely accepted principles of ranking-based semantics (like Void Precedence) are incompatible with a faithful treatment of these phenomena, which means that no existing ranking-based semantics can capture these two principles together. This motivates us to introduce a new parametrized ranking-based semantics based on the notion of propagation which extends the existing propagation semantics (In Proceedings of the 6th International Conference on Computational Models of Argument (COMMA’16) (2016) 139–150) by adding an additional parameter allowing us to gradually decrease the impact of arguments when the length of the path between two arguments increases. We show that this parameter gives the possibility of choosing if one wants to satisfy the property Void Precedence or not (and then capture procatalepsis) and to control the scope of the impact of the arguments (and then to capture fading principle). We also propose an experiment to show that the new semantics remains stable when this parameter varies and an axiomatic evaluation to compare it with existing ranking-based semantics in the literature.","authors":["Elise Bonzon","Jérôme Delobelle","Sébastien Konieczny","Nicolas Maudet"],"meta":["February 2021Argument and Computation 12(1):49-85","DOI:10.3233/AAC-200905"],"references":["322326235_Towards_a_framework_for_computational_persuasion_with_applications_in_behaviour_change1","316856422_Argumentation_Ranking_Semantics_based_on_Propagation","346469251_Elements_of_Argumentation","344872346_Dialog_Theory_for_Critical_Argumentation","334843586_A_Replication_Study_of_Semantics_in_Argumentation","333005728_On_the_graded_acceptability_of_arguments_in_abstract_and_instantiated_argumentation","329384965_From_Fine-Grained_Properties_to_Broad_Principles_for_Gradual_Argumentation_a_Principled_Spectrum","326206291_Five_Years_of_Argument_Mining_a_Data-driven_Analysis","325633143_Subsumption_and_Incompatibility_between_Principles_in_Ranking-Based_Argumentation","319675746_A_Parametrized_Ranking-Based_Semantics_for_Persuasion"]}