{"id":"349310520_An_exploratory_study_of_Machine_Learning_and_It's_future_in_the_United_States","abstract":"This paper explores the concept of Machine learning and its emergence as a useful technological advancement in various industries over the years as well as what its future looks like in the United States. This research paper is exploratory. There will be the use of secondary data obtained from various scholars who have documented how Machine Learning has been growing and transforming various sectors of the economy over the years. Most organizations have adopted the use of Machine Learning in this competitive era as most industries look at taking over huge segments of the economy. Machine Learning has been the talk of various stakeholders in the technological world but there are high expectations that it will grow more beyond its current status. Most industries have undergone massive technological changes in this competitive era. Many organizations are prepared to embrace the changes and as they intend to be more competitive [1]. The scope of artificial intelligence (AI) in various sectors of the economy like e-commerce, education, and health has increased over the years.\nMany companies are now investing in developing their AI and machine learning technologies to be efficient as compared to the traditional approaches. In the education field, Artificial intelligence has been adopted to reach out to students in remote areas. AI applications have supported personalized education and dialog system, a review of student progress reports, facilitate in game-based education as well as student support Chabot system. The study concludes that all sectors need to embrace the Machine learning framework to boost business operations in various economic sectors [2]. Since its inception, technologists have taken great steps to benefit from machine learning. Despite progress and advancements in machine learning, several main issues still prevail in organizational scaling due to manual processes and poor collaboration as well as overlapping resources that impede agility. Luckily, organizations particularly strive to make the most out of machine learning in the future [3]. Computer system specialists will now continue to increase their skills by designing, delivering, and improving on quality assurance to be prepared for the future artificial intelligence level. Every project team must be equipped to confront many important challenges that may arise. With the introduction of a robotic system, this trend has taken an exponential pace. Currently, the machine learning progression continues to build on improved coordination and automation concepts to improve application features, designs, and testing. In the U.S. the ongoing improvements of machine learning are noticeable in an almost limitless market. Machine learning is becoming a critical component of economic growth in this highly competitive age of technology [3]. Machine learning was a key element and shaped the technological environment, and many experts expect machine learning to be the norm and increase dramatically in the coming years.","authors":["Lakshmisri Surya"],"meta":["January 2016SSRN Electronic Journal 4(1):862","DOI:10.1729/Journal.25713","Project: Artificial Intelligence"],"references":["283174240_A_Study_of_Machine_Learning_Techniques_for_Detecting_and_Classifying_Structural_Damage","271297360_Identifying_At-Risk_Students_Using_Machine_Learning_Techniques_A_Case_Study_with_IS_100","312469285_Machine_learning_an_algorithmic_perspective","284489479_Early_Prediction_of_Students_Performance_using_Machine_Learning_Techniques","271630759_A_Comparative_Assessment_of_Support_Vector_Machines_Probabilistic_Neural_Networks_and_K-Nearest_Neighbor_Algorithms_for_Water_Quality_Classification","270492323_Predicting_Software_Faults_in_Large_Space_Systems_using_Machine_Learning_Techniques","263753111_Experimental_Goal_Regression_A_Method_for_Learning_Problem-Solving_Heuristics","254659545_Intelligent_Music_Information_Systems_Tools_and_Methodologies","223539009_Underlying_assumptions_of_knowledge_acquisition_and_machine_learning","223457886_A_comparative_analysis_of_machine_learning_techniques_for_student_retention_management"]}