{"id":"349310211_SECURITY_CHALLENGES_AND_STRATEGIES_FOR_THE_IOT_IN_CLOUD_COMPUTING","abstract":"The Internet of Things has reshaped the way things are performed across the computing world. This is why integration between cloud computing and IoT devices is crucial because the amount of data being produced by IoT devices requires proper and secure storage as well as a processing system. Even so, security concerns remain more important because people share a wide range of cloud computing resources in their devices in numerous ways. Privacy is much more critical in a world where our wellbeing could be jeopardized by unsecured data. Therefore, the internet of things in cloud computing must always ensure the security and privacy concerns of users are always guaranteed. This research paper looked at issues like the security and strategies that can be applied in IoT in cloud computing. The findings indicate that there are major security problems and threats that still need to be addressed. To design architecture and to make changes to current software to achieve that goal. This paper discusses multiple security challenges facing the IoT in cloud computing especially concerns surrounding privacy and cybersecurity threats of the users. INTRODUCTION IoT and cloud are working together to form a data-storage-intensive framework where security is the most critical consideration for the protection of data. Cloud Computing refers to services that provide highly scalable, flexible, and storage computing resources on a pay-per-use basis [1]. Cloud computing services for computation and storage are becoming more prominent and several companies are already opting to transfer their data from the in-house network infrastructure to the Cloud Storage Providers (CSPs). With the rise in the demand for certain IoT devices, there will also be a rise in the development of apps that will have security challenges while connecting to cloud services. In the future, a new generation of Internet of Things systems will be able to provide more sophisticated services focused on increasingly fine-grained data collection in a world densely packed with smart things. In the past years, there has been a large number of IoT devices like advanced building management systems, public surveillance, smart city services, and even participatory sensing that allow users to do their work easily [1]. To handle time-varying workloads and big data in IoT applications, both traditional processing and cloud computing will present a challenge to achieving the intended goal. Furthermore, the encryption methods are not yet as powerful as they ought to be, and the third-party auditors tasked with handling the data and maintaining its integrity are also in their early stage of development. The amount of data collected on individuals by many government departments is growing faster annually, and becoming harder, for people to understand its impacts. This form of data makes privacy issues more likely. Ignorance about these problems can have long-term negative effects causing non-acceptance of the technology, failure of new technology due to credibility issues, and expensive lawsuits [2]. The study will present the evolution of IoT in cloud computing, the security challenges in IoT, and the numerous strategies that can be implemented to resolve the issues. The main objective of the study is to understand the security challenges and strategies that can be adapted by IoT in Cloud Computing to enable secure storage and safe transfer of IoT data in Cloud computing.","authors":["Lakshmisri Surya"],"meta":["September 2016SSRN Electronic Journal 3(9)","Project: Artificial Intelligence"],"references":["286342403_A_view_on_privacy_trust_in_IoT","278726195_Privacy_in_Internet_of_Things_A_Model_and_Protection_Framework","277311879_Privacy_Information_Security_Classification_Study_in_Internet_of_Things","273303094_Toward_a_Lightweight_Authentication_and_Authorization_Framework_for_Smart_Objects","270225455_BlinkToSCoAP_An_End-to-End_Security_Framework_for_IoT","264725343_Privacy_in_the_Internet_of_Things_Threats_and_Challenges","283433967_Experiments_with_security_and_privacy_in_IoT_networks","272297653_Survey_on_Secure_Communication_Protocols_for_the_Internet_of_Things","269309103_A_standard_compliant_security_framework_for_IEEE_802154_networks","263024551_A_Survey_on_Internet_of_Things_Security_and_Privacy_Issues"]}