{"id":"349491078_Innovative_design_of_a_helmet_based_on_reverse_engineering_and_3D_printing","abstract":"Based on reverse engineering, product innovation design and 3D-printing technology, a technical route for the rapid design and development of helmet products has been constructed, and optimize the product production process, reduce the product development cycle, improve production efficiency, and complete the personalized design of helmets to improve the comfort of personnel wearing. The point cloud data of the physical model were collected by the 3D scanner, and imported to the reverse processing software (Geomagic Studio) for data processing, surface reconstruction and surface fitting. In this way, the section curve of the repaired head surface was extracted. Then, the extracted information was sent to the forward design software (SolidWorks) through the parameter exchange command for the forward design of the helmet, and the 3D model was subsequently printed. Effectively solve the traditional design method for complex surface modelling design and manufacturing, forward software measurement deviation, modelling design process is complex and tedious, time-consuming and labor-intensive, cannot well meet the product design, processing and manufacturing process is relatively cumbersome, long production cycle and other design defects, speed up enterprise product development, shorten the cycle and reduce costs. Furthermore, the adoption of 3D printing technology to output the designed 3D digital model effectively shortens the product development cycle.","authors":["Pengwen Wang","Jing Yang","Yanan Hu","Jiaofei Huo"],"meta":["June 2021AEJ - Alexandria Engineering Journal 60(3):3445-3453","DOI:10.1016/j.aej.2021.02.006"],"references":["306022965_A_Critical_Analysis_of_a_Hand_Orthosis_Reverse_Engineering_and_3D_Printing_Process","279951905_3D_printer_selection_A_decision-making_evaluation_and_ranking_model","342547268_Three-dimensional_3D_scanning_and_additive_manufacturing_AM_allows_the_fabrication_of_customised_crutch_grips","334512240_Evaluation_of_Third-party_Reverse_Logistics_Providers_Based_on_Extension_Superiority_Method","329278709_Three-Dimensional_Point_Cloud_Registration_Based_on_Normal_Vector_Angle","313831117_Printing_cures_Organovo_advances_with_3D-printed_liver_tissue","306026400_Frontiers_of_3D_PrintingAdditive_Manufacturing_From_Human_Organs_to_Aircraft_Fabrication","303797570_Safety_efficacy_and_repeatability_of_a_novel_house_dust_mite_allergen_challenge_technique_in_the_Fraunhofer_Allergen_Challenge_Chamber","302595064_Overview_of_3D_printing_technologies_for_reverse_engineering_product_design","288801988_Automatic_construction_of_3D_valid_solids_for_3D_cadastral_objects_based_on_facet_sets"]}