{"id":"349437983_Should_I_stay_or_should_I_go_Indicators_of_Dropping_Out_Thoughts_of_Doctoral_Students_in_Computer_Science","abstract":"Evidence in the literature indicates that doctoral candidates may experience increased levels of stress and worry about successfully completing their doctorate degrees. As a result, a significant number of doctoral candidates drop out. In our study with 424 doctoral students in computer science (113 women, 311 men), we ask about the frequency of dropout thoughts as an indicator of possible premature termination. By means of machine learning algorithms, we extract variables associated with higher or lower likelihood of dropout thoughts. In particular, satisfaction with advisor’s support, experiencing a crisis, professional self-efficacy, choice of advisor, and perceived meaningfulness of additional work tasks proved to be of central importance. Based on these results, we suggest taking steps to improve professional and social support for doctoral students. Recommendations include implementing more intensive supervision in the early stages of the doctorate, improve the match between doctoral candidates’ expectations and the requirements of the respective institute, monitor progress during the doctorate (e.g., with the help of an advisor agreement), and increase the qualifications of advisors to include leadership and communication skills.","authors":["Dorothee Alfermann","Christopher Holl","Swantje Reimann"],"meta":["February 2021International Journal of Higher Education 10(3):246","DOI:10.5430/ijhe.v10n3p246"],"references":["332762681_I_Need_Somebody_to_Lean_on_The_Effect_of_Peer_Relative_and_Supervisor_Support_on_Emotions_Perceived_Progress_and_Persistence_in_Different_Stages_of_Doctoral_Advancement","327054641_Who_Are_the_Doctoral_Students_Who_Drop_Out_Factors_Associated_with_the_Rate_of_Doctoral_Degree_Completion_in_Universities","327005544_Doctoral_students'_well-being_a_literature_review","339203786_Early_Prediction_of_University_Dropouts_-_A_Random_Forest_Approach","333064140_Machine_Learning_for_Sociology","328534086_Stressors_in_early-stage_doctoral_students","327606791_Classification_And_Regression_Trees","326133649_Harness_the_power_of_groups_to_beat_the_'PhD_blues'","322620462_Psychological_health_of_doctoral_candidates_study-related_challenges_and_perceived_performance","320655419_The_Relationships_between_Doctoral_Students'_Perceptions_of_Supervision_and_Burnout"]}