{"id":"349426214_Scaling_advantage_over_path-integral_Monte_Carlo_in_quantum_simulation_of_geometrically_frustrated_magnets","abstract":"The promise of quantum computing lies in harnessing programmable quantum devices for practical applications such as efficient simulation of quantum materials and condensed matter systems. One important task is the simulation of geometrically frustrated magnets in which topological phenomena can emerge from competition between quantum and thermal fluctuations. Here we report on experimental observations of equilibration in such simulations, measured on up to 1440 qubits with microsecond resolution. By initializing the system in a state with topological obstruction, we observe quantum annealing (QA) equilibration timescales in excess of one microsecond. Measurements indicate a dynamical advantage in the quantum simulation compared with spatially local update dynamics of path-integral Monte Carlo (PIMC). The advantage increases with both system size and inverse temperature, exceeding a million-fold speedup over an efficient CPU implementation. PIMC is a leading classical method for such simulations, and a scaling advantage of this type was recently shown to be impossible in certain restricted settings. This is therefore an important piece of experimental evidence that PIMC does not simulate QA dynamics even for sign-problem-free Hamiltonians, and that near-term quantum devices can be used to accelerate computational tasks of practical relevance.","authors":["Andrew D. King","Jack Raymond","Trevor Lanting","Sergei V. Isakov"],"meta":["February 2021Nature Communications 12(1)","DOI:10.1038/s41467-021-20901-5"],"references":["344166630_Probing_the_universality_of_topological_defect_formation_in_a_quantum_annealer_Kibble-Zurek_mechanism_and_beyond","339570878_Kosterlitz-Thouless_melting_of_magnetic_order_in_the_triangular_quantum_Ising_material_TmMgGaO4","336744162_Quantum_supremacy_using_a_programmable_superconducting_processor","332132625_Quantum_Kibble-Zurek_mechanism_and_critical_dynamics_on_a_programmable_Rydberg_simulator","330970473_Emergent_magnetic_monopole_dynamics_in_macroscopically_degenerate_artificial_spin_ice","326495873_Demonstration_of_a_Scaling_Advantage_for_a_Quantum_Annealer_over_Simulated_Annealing","323597968_Observation_of_topological_phenomena_in_a_programmable_lattice_of_1800_qubits","322243414_Quantum_Computing_in_the_NISQ_era_and_beyond","330816202_Dynamics_of_simulated_quantum_annealing_in_random_Ising_chains","326399373_Phase_transitions_in_a_programmable_quantum_spin_glass_simulator"]}