{"id":"349493950_Effect_of_Tinkercad_on_Students'_Computational_Thinking_Skills_and_Perceptions_A_Case_of_Ankara_Province","abstract":"This study was conducted to determine the effect of Tinkercad use in computer programming education on students ' computational thinking skills and perceptions. In this context, 583 secondary school students studying in Ankara province of Turkey at the fifth, sixth, seventh and eighth grade level in the 2019-2020 academic year constitute the sample of the research. The research was carried out using an enriched pattern, one of the mixed research methods in which quantitative and qualitative research designs were used together. Research data were collected using Personal Information Form, Student Perception Questionnaire about Tinkercad Software and Information Processing Thinking Scale (For Secondary School Level). The data obtained were analyzed using the SPSS 25 program. Using the results of normality analysis, Mann Whitney U test and Kruskal Wallis H test were used among non-parametric tests. In addition, Tamhane's T2 and LSD tests from Post Hoc analyzes and Spearman correlation test from correlation tests were used. When looking at students' perceptions of Tinkercad, it was determined that they were highly motivated for interest and appreciation and found Tinkercad to be generally useful and easy to use according to research findings. It was determined that the students ' perception of computational thinking was moderate. It was found that there was a positive low-level relationship between the frequency of Tinkercad use of students and their perception of Tinkercad, while there was a positive moderate-level relationship between their perception of Tinkercad and their computational thinking skills. In addition, it has been determined that the frequency of students ' use of Tinkercad is affected by internal and external reasons, so recommendations for parents and programmers are included.","authors":["Selami Eryilmaz","Gülhanım Deniz"],"meta":["January 2021"],"references":["338800115_Scratch_and_Arduino_for_Effectively_Developing_Programming_and_Computing-Electronic_Competences_in_Primary_School_Children","329905683_The_Influence_of_Educational_Robotics_to_Computational_Thinking_Skill_in_Early_Childhood_Education","327302966_Computational_thinking_-_a_guide_for_teachers","319959476_Demystifying_computational_thinking","318137273_Exploring_the_use_of_3D_Computer-Aided_Design_and_3D_Printing_for_STEAM_Learning_in_Mathematics","338364360_Tinkercad_and_Codeblocks_in_a_Summer_Course_an_Attempt_to_Explain_Observed_Engagement_and_Enthusiasm","337164565_The_Effect_of_the_Integrative_Education_Using_a_3D_Printer_on_the_Computational_Thinking_Ability_of_Elementary_School_Students","332679032_Creativity_in_the_acquisition_of_computational_thinking","329561685_Application_of_Digital_Modeling_in_the_Elementary_School_Digital_Dessert_Workshop","317158625_Remaining_trouble_spots_with_computational_thinking"]}