{"id":"349414468_Dynamic_graph_embedding_for_outlier_detection_on_multiple_meteorological_time_series","abstract":"Existing dynamic graph embedding-based outlier detection methods mainly focus on the evolution of graphs and ignore the similarities among them. To overcome this limitation for the effective detection of abnormal climatic events from meteorological time series, we proposed a dynamic graph embedding model based on graph proximity, called DynGPE. Climatic events are represented as a graph where each vertex indicates meteorological data and each edge indicates a spurious relationship between two meteorological time series that are not causally related. The graph proximity is described as the distance between two graphs. DynGPE can cluster similar climatic events in the embedding space. Abnormal climatic events are distant from most of the other events and can be detected using outlier detection methods. We conducted experiments by applying three outlier detection methods (i.e., isolation forest, local outlier factor, and box plot) to real meteorological data. The results showed that DynGPE achieves better results than the baseline by 44.3% on average in terms of the F-measure. Isolation forest provides the best performance and stability. It achieved higher results than the local outlier factor and box plot methods, namely, by 15.4% and 78.9% on average, respectively.","authors":["Gen Li","Jason J. Jung"],"meta":["February 2021PLoS ONE 16(2):e0247119","DOI:10.1371/journal.pone.0247119"],"references":["346355501_Maximum_Marginal_Approach_on_EEG_Signal_Preprocessing_for_Emotion_Detection","344189356_Series2Graph_Graph-based_Subsequence_Anomaly_Detection_in_Time_Series","343653895_Rejoinder_Nonparametric_regression_using_deep_neural_networks_with_ReLU_activation_function","342730338_Sec2graph_Network_Attack_Detection_Based_on_Novelty_Detection_on_Graph_Structured_Data","339115213_Anomaly_Detection_Based_on_Convolutional_Recurrent_Autoencoder_for_IoT_Time_Series","338662842_Community-aware_Dynamic_Network_Embedding_by_Using_Deep_Autoencoder","338359433_TDAE_An_Approach_for_Predicting_Communities_on_Dynamic_Network_Based_on_Deep_Auto-Encoder","337738242_Similarity-based_Android_malware_detection_using_Hamming_distance_of_static_binary_features","336004569_Parallel_Graph-based_Anomaly_Detection_Technique_for_Sequential_Data","335361322_Forecasting_of_Meteorological_Weather_Time_Series_Through_a_Feature_Vector_Based_on_Correlation"]}