{"id":"349468804_Scaling_Equilibrium_Propagation_to_Deep_ConvNets_by_Drastically_Reducing_Its_Gradient_Estimator_Bias","abstract":"Equilibrium Propagation is a biologically-inspired algorithm that trains convergent recurrent neural networks with a local learning rule. This approach constitutes a major lead to allow learning-capable neuromophic systems and comes with strong theoretical guarantees. Equilibrium propagation operates in two phases, during which the network is let to evolve freely and then “nudged” toward a target; the weights of the network are then updated based solely on the states of the neurons that they connect. The weight updates of Equilibrium Propagation have been shown mathematically to approach those provided by Backpropagation Through Time (BPTT), the mainstream approach to train recurrent neural networks, when nudging is performed with infinitely small strength. In practice, however, the standard implementation of Equilibrium Propagation does not scale to visual tasks harder than MNIST. In this work, we show that a bias in the gradient estimate of equilibrium propagation, inherent in the use of finite nudging, is responsible for this phenomenon and that canceling it allows training deep convolutional neural networks. We show that this bias can be greatly reduced by using symmetric nudging (a positive nudging and a negative one). We also generalize Equilibrium Propagation to the case of cross-entropy loss (by opposition to squared error). As a result of these advances, we are able to achieve a test error of 11.7% on CIFAR-10, which approaches the one achieved by BPTT and provides a major improvement with respect to the standard Equilibrium Propagation that gives 86% test error. We also apply these techniques to train an architecture with unidirectional forward and backward connections, yielding a 13.2% test error. These results highlight equilibrium propagation as a compelling biologically-plausible approach to compute error gradients in deep neuromorphic systems.","authors":["Axel Laborieux","Maxence Ernoult","Benjamin Scellier","Yoshua Bengio"],"meta":["February 2021Frontiers in Neuroscience 15:633674","DOI:10.3389/fnins.2021.633674"],"references":["349487664_EqSpike_Spike-driven_Equilibrium_Propagation_for_Neuromorphic_Implementations","340348817_Burst-dependent_synaptic_plasticity_can_coordinate_learning_in_hierarchical_circuits","340125048_Equilibrium_Propagation_for_Memristor-Based_Recurrent_Neural_Networks","338480830_Digital_Biologically_Plausible_Implementation_of_Binarized_Neural_Networks_With_Differential_Hafnium_Oxide_Resistive_Memory_Arrays","349293283_Analog_Circuits_to_Accelerate_the_Relaxation_Process_in_the_Equilibrium_Propagation_Algorithm","349293262_Towards_Efficient_On-Chip_Learning_using_Equilibrium_Propagation","340715986_Backpropagation_and_the_brain","336860572_A_deep_learning_framework_for_neuroscience","321242020_Equivalence_of_Equilibrium_Propagation_and_Recurrent_Backpropagation","319770226_SGDR_Stochastic_Gradient_Descent_with_Restarts"]}