{"id":"349486657_An_exploratory_study_of_COVID-19_misinformation_on_Twitter","abstract":"During the COVID-19 pandemic, social media has become a home ground for misinformation. To tackle this infodemic, scientific oversight, as well as a better understanding by practitioners in crisis management, is needed. We have conducted an exploratory study into the propagation, authors and content of misinformation on Twitter around the topic of COVID-19 in order to gain early insights. We have collected all tweets mentioned in the verdicts of fact-checked claims related to COVID-19 by over 92 professional fact-checking organisations between January and mid-July 2020 and share this corpus with the community. This resulted in 1500 tweets relating to 1274 false and 226 partially false claims, respectively. Exploratory analysis of author accounts revealed that the verified twitter handle(including Organisation/celebrity) are also involved in either creating(new tweets) or spreading(retweet) the misinformation. Additionally, we found that false claims propagate faster than partially false claims. Compare to a background corpus of COVID-19 tweets, tweets with misinformation are more often concerned with discrediting other information on social media. Authors use less tentative language and appear to be more driven by concerns of potential harm to others. Our results enable us to suggest gaps in the current scientific coverage of the topic as well as propose actions for authorities and social media users to counter misinformation.","authors":["Gautam Kishore Shahi","Anne Dirkson","Tim A. Majchrzak"],"meta":["February 2021Online Social Networks and Media 22(10228):100104","DOI:10.1016/j.osnem.2020.100104"],"references":["344949844_Assessing_the_risks_of_'infodemics'_in_response_to_COVID-19_epidemics","342314742_A_first_look_at_COVID-19_information_and_misinformation_sharing_on_Twitter","341292592_The_role_of_bot_squads_in_the_political_propaganda_on_Twitter","340523361_Assessing_the_risks_of_infodemics_in_response_to_COVID-19_epidemics","340432016_Evaluating_the_fake_news_problem_at_the_scale_of_the_information_ecosystem","339923047_Coronavirus_Goes_Viral_Quantifying_the_COVID-19_Misinformation_Epidemic_on_Twitter","341142126_Gender_and_Age_Influences_on_Interpretation_of_Emoji_Functions","341122502_A_Kernel_of_Truth_Determining_Rumor_Veracity_on_Twitter_by_Diffusion_Pattern_Alone","340669947_Corrigendum_to_World_Health_Organization_declares_Global_Emergency_A_review_of_the_2019_Novel_Coronavirus_COVID-19_Int_J_Surg_76_2020_71-76","340520148_Beware_of_the_second_wave_of_COVID-19"]}