{"id":"349504218_CogNet_classification_of_gene_expression_data_based_on_ranked_active-subnetwork-oriented_KEGG_pathway_enrichment_analysis","abstract":"Most of the traditional gene selection approaches are borrowed from other fields such as statistics and computer science, However, they do not prioritize biologically relevant genes since the ultimate goal is to determine features that optimize model performance metrics not to build a biologically meaningful model. Therefore, there is an imminent need for new computational tools that integrate the biological knowledge about the data in the process of gene selection and machine learning. Integrative gene selection enables incorporation of biological domain knowledge from external biological resources. In this study, we propose a new computational approach named CogNet that is an integrative gene selection tool that exploits biological knowledge for grouping the genes for the computational modeling tasks of ranking and classification. In CogNet, the pathfindR serves as the biological grouping tool to allow the main algorithm to rank active-subnetwork-oriented KEGG pathway enrichment analysis results to build a biologically relevant model. CogNet provides a list of significant KEGG pathways that can classify the data with a very high accuracy. The list also provides the genes belonging to these pathways that are differentially expressed that are used as features in the classification problem. The list facilitates deep analysis and better interpretability of the role of KEGG pathways in classification of the data thus better establishing the biological relevance of these differentially expressed genes. Even though the main aim of our study is not to improve the accuracy of any existing tool, the performance of the CogNet outperforms a similar approach called maTE while obtaining similar performance compared to other similar tools including SVM-RCE. CogNet was tested on 13 gene expression datasets concerning a variety of diseases.","authors":["Malik Yousef","Ege Ülgen","O. Uğur Sezerman"],"meta":["February 2021PeerJ Computer Science 7(1):e336","DOI:10.7717/peerj-cs.336"],"references":["337020286_The_DisGeNET_knowledge_platform_for_disease_genomics_2019_update","336021506_pathfindR_An_R_Package_for_Comprehensive_Identification_of_Enriched_Pathways_in_Omics_Data_Through_Active_Subnetworks","329874974_Integrative_Gene_Selection_on_Gene_Expression_Data_Providing_Biological_Context_to_Traditional_Approaches","326784897_Feature_clustering_and_ranking_for_selecting_stable_features_from_high_dimensional_remotely_sensed_data","321229442_Unsupervised_gene_selection_using_biological_knowledge_Application_in_sample_clustering","318457536_Joint_Covariate_Detection_on_Expression_Profiles_for_Identifying_MicroRNAs_Related_to_Venous_Metastasis_in_Hepatocellular_Carcinoma","318120029_RGIFE_A_ranked_guided_iterative_feature_elimination_heuristic_for_the_identification_of_biomarkers","334888424_A_Review_on_Feature_Selection_Techniques_for_Gene_Expression_Data","331960804_maTE_Discovering_Expressed_MicroRNA_-_Target_Interactions","317071797_Integrated_Theory-and_Data-Driven_Feature_Selection_in_Gene_Expression_Data_Analysis"]}