{"id":"349526882_Automatic_Feature_Selection_for_Improved_Interpretability_on_Whole_Slide_Imaging","abstract":"Deep learning methods are widely used for medical applications to assist medical doctors in their daily routine. While performances reach expert’s level, interpretability (highlighting how and what a trained model learned and why it makes a specific decision) is the next important challenge that deep learning methods need to answer to be fully integrated in the medical field. In this paper, we address the question of interpretability in the context of whole slide images (WSI) classification with the formalization of the design of WSI classification architectures and propose a piece-wise interpretability approach, relying on gradient-based methods, feature visualization and multiple instance learning context. After training two WSI classification architectures on Camelyon-16 WSI dataset, highlighting discriminative features learned, and validating our approach with pathologists, we propose a novel manner of computing interpretability slide-level heat-maps, based on the extracted features, that improves tile-level classification performances. We measure the improvement using the tile-level AUC that we called Localization AUC, and show an improvement of more than 0.2. We also validate our results with a RemOve And Retrain (ROAR) measure. Then, after studying the impact of the number of features used for heat-map computation, we propose a corrective approach, relying on activation colocalization of selected features, that improves the performances and the stability of our proposed method.","authors":["Antoine Pirovano","Hippolyte Heuberger","Sylvain Berlemont","SaÏd Ladjal"],"meta":["February 2021","DOI:10.3390/make3010012"],"references":["349707547_Data-efficient_and_weakly_supervised_computational_pathology_on_whole-slide_images","339411202_Tailored_for_Real-World_A_Whole_Slide_Image_Classification_System_Validated_on_Uncurated_Multi-Site_Data_Emulating_the_Prospective_Pathology_Workload","334473745_Clinical-grade_computational_pathology_using_weakly_supervised_deep_learning_on_whole_slide_images","333069573_Pathologist-level_interpretable_whole-slide_cancer_diagnosis_with_deep_learning","332507616_Efficient_Deep_Network_Architectures_for_Fast_Chest_X-Ray_Tuberculosis_Screening_and_Visualization","352878520_Understanding_Integrated_Gradients_with_SmoothTaylor_for_Deep_Neural_Network_Attribution","346077846_Improving_Interpretability_for_Computer-Aided_Diagnosis_Tools_on_Whole_Slide_Imaging_with_Multiple_Instance_Learning_and_Gradient-Based_Explanations","339362503_The_2019_WHO_classification_of_tumours_of_the_breast","336819471_Towards_Interpretability_of_Segmentation_Networks_by_Analyzing_DeepDreams","334410029_Predicting_Residual_Cancer_Burden_In_A_Triple_Negative_Breast_Cancer_Cohort"]}