{"id":"349579673_Theme_Evolution_of_Researches_on_Knowledge_Graphs_Based_on_Visualization_Analyses_of_Data","abstract":"The knowledge graph, as a significant branch of Library and Information Science, has also become a vital part of Computer Science. In a bid to reveal the research trend and hot topics of the knowledge graph domain, this paper collected latest data about literature on knowledge graphs from SCI-Expanded and EI Compendex database. This paper took advantage of Citespace for visualization analyses of data, which discerned the research topics, hot issues and theme changes of the knowledge graph domain over time. Through analyses, we conclude that the knowledge graph has developed greatly in both Library and Information Science and Computer Science. In Library and Information Science domain, researches focus on the issues like the plotting of knowledge graphs and visualization of knowledge. In Computer Science domain, hot issues are the techniques of constructing knowledge graphs, which include entity recognition, knowledge integration, etc., and their applications in Semantic Web. Among all the research topics, the domain knowledge graph is one of the paramount research trends. Compared with previous researches, this paper keeps up with the times and can reveal the theme evolution of researches on knowledge graphs more precisely.","authors":["Kejun Chen","Boyang Xie","Sanhong Deng"],"meta":["February 2021Journal of Physics Conference Series 1813(1):012039","DOI:10.1088/1742-6596/1813/1/012039"],"references":["341505212_Review_on_Knowledge_Graph_Techniques","341168342_Knowledge_Graph_Semantic_Enhancement_of_Input_Data_for_Improving_AI","322584212_Schema_engineering_for_enterprise_knowledge_graphs_A_reflecting_survey_and_case_study","28674282_CiteSpace_II_Detecting_and_visualizing_emerging_trends_and_transient_patterns_in_scientific_literature","355395089_Recent_advances_key_techniques_and_future_challenges_of_knowledge_graph","339132184_Scalable_aggregate_keyword_query_over_knowledge_graph","338665152_Leveraging_Knowledge_Graphs_for_Big_Data_Integration_the_XI_Pipeline","336043591_Building_a_morpho-semantic_knowledge_graph_for_Arabic_information_retrieval","257663359_Publication_trends_and_knowledge_maps_of_global_translational_medicine_research"]}