{"id":"349580403_A_chemically_consistent_graph_architecture_for_massive_reaction_networks_applied_to_solid-electrolyte_interphase_formation","abstract":"Modeling reactivity with chemical reaction networks could yield fundamental mechanistic understanding that would expedite the development of processes and technologies for energy storage, medicine, catalysis, and more. Thus far, reaction networks have been limited in size by chemically inconsistent graph representations of multi-reactant reactions (e.g. A + B → C) that cannot enforce stoichiometric constraints, precluding the use of optimized shortest-path algorithms. Here, we report a chemically consistent graph architecture that overcomes these limitations using a novel multi-reactant representation and iterative cost-solving procedure. Our approach enables the identification of all low-cost pathways to desired products in massive reaction networks containing reactions of any stoichiometry, allowing for the investigation of vastly more complex systems than previously possible. Leveraging our architecture, we construct the first ever electrochemical reaction network from first-principles thermodynamic calculations to describe the formation of the Li-ion solid electrolyte interphase (SEI), which is critical for passivation of the negative electrode. Using this network comprised of nearly 6000 species and 4.5 million reactions, we interrogate the formation of a key SEI component, lithium ethylene dicarbonate. We automatically identify previously proposed mechanisms as well as multiple novel pathways containing counter-intuitive reactions that have not, to our knowledge, been reported in the literature. We envision that our framework and data-driven methodology will facilitate efforts to engineer the composition-related properties of the SEI - or of any complex chemical process - through selective control of reactivity.","authors":["Samuel M. Blau","Hetal D Patel","Evan Walter Clark Spotte-Smith","Xiaowei Xie"],"meta":["February 2021Chemical Science 12(13)","DOI:10.1039/D0SC05647B"],"references":["338394036_Tuning_the_stability_of_organic_radicals_From_covalent_approaches_to_non-covalent_approaches","333623385_Predicting_Feasible_Organic_Reaction_Pathways_Using_Heuristically_Aided_Quantum_Chemistry","332295886_Elucidating_Non-aqueous_Solvent_Stability_and_Associated_Decomposition_Mechanisms_for_Mg_Energy_Storage_Applications_From_First-Principles","332179734_Metabolic_reaction_network-based_recursive_metabolite_annotation_for_untargeted_metabolomics","331437893_Selection_of_cost-effective_yet_chemically_diverse_pathways_from_the_networks_of_computer-generated_retrosynthetic_plans","342088363_A_Review_on_Challenges_and_Successes_in_Atomic_Scale_Design_of_Catalysts_for_Electrochemical_Synthesis_of_Hydrogen_Peroxide","339547605_The_Exploration_of_Chemical_Reaction_Networks","336582125_Fast_screening_of_homogeneous_catalysis_mechanisms_using_graph-driven_searches_and_approximate_quantum_chemistry","333529497_Learning_Retrosynthetic_Planning_through_Simulated_Experience","333010535_Performance_of_ACE-Reaction_on_26_Organic_Reactions_for_Fully_Automated_Reaction_Network_Construction_and_Microkinetic_Analysis"]}