{"id":"349595159_Analysis_of_Patterns_and_Similarities_in_Service_Tickets_using_Natural_Language_Processing","abstract":"Natural language processing (NLP) is a branch of computer science concerned with the understanding of human language and communication, and translating these into a computer-comprehensible embedding. Our goal in this paper is to capture meaning from human natural language through NLP and provide an automated solution for aiding the process of service ticket solving, through the intelligent classification of tickets, pattern recognition and similarities between texts. The difficulty of this task lies in translating the human language into a mathematical format: transforming a non-formal language, into a formal one, without losing any details. Also what raises even more complication is the context in which this language appears: service tickets, that come from a technical and specialized jargon of computer science and IT industry, and the brief manner in which the tickets are written. This paper aims to tackle this challenge through multiple methods of text classification and recognition, and data analysis, followed by comparison and interpretation of the results. In completion, we find that our methods yield plausible results to be implemented in helping the service process.","authors":["Tudor Dumitru Tolciu","Christian Sacarea","Cristian Matei"],"meta":["February 2021Journal of Communications Software and Systems 17(1):29","DOI:10.24138/jcomss.v17i1.1024"],"references":["337509813_A_Study_in_the_Automation_of_Service_Ticket_Recognition_using_Natural_Language_Processing","284576917_Glove_Global_Vectors_for_Word_Representation","220578095_Least_Squares_Support_Vector_Machine_Classifiers","16134792_The_Meaning_and_Use_of_the_Area_Under_a_Receiver_Operating_Characteristic_ROC_Curve","319770439_Efficient_Estimation_of_Word_Representations_in_Vector_Space","308797129_Distributional_structure","229091480_Learning_Representations_by_Back_Propagating_Errors","221996769_The_perceptron_A_probabilistic_model_for_information_storage_and_organization_in_the_brain_J","221158384_Recurrent_Neural_Networks_for_Robust_Real-World_Text_Classification","220931979_MCS-based_Balancing_Techniques_for_Skewed_Classes_an_Empirical_Comparison"]}