{"id":"349543541_Partial_discharge_breakdown_characteristics_under_needle-plate_defect_configuration","abstract":"Partial discharge of the dielectric is an important problem in fault detection of transmission line systems. It has gained gigantic attention to understand the breakdown characteristics of partial discharge. In this paper, the needle–plate discharge experiment is carried out by using the needle–plate defect discharge device and high voltage pulse power supply under atmospheric pressure. The breakdown characteristics are measured and analyzed by changing the needle plate clearance distance and using the step-up method. Finally, a simulation model of the needle plate was established to calculate the electric field intensity when the needle plate gap with different spacing was broken down, and the relationship between the maximum electric field intensity and the needle plate spacing was obtained. It is found that the breakdown voltage increases with the increase in the spacing between the needle and plate. The measured value is only slightly larger than the theoretical value of the breakdown voltage without the influence of harmonics. The simulation found that the larger the spacing between the needle and plate was, the smaller the maximum electric field intensity was during the breakdown, which was different from the theory.","authors":["Dandan Zou","Hanyu Pan","M. Hasnain Qaisrani"],"meta":["February 2021AIP Advances 11(2):025042","DOI:10.1063/5.0039493"],"references":["309687898_Partial_discharge_detection_in_transformer_using_adaptive_grey_wolf_optimizer_based_acoustic_emission_technique","287451660_Numerical_simulation_of_Trichel_pulse_characteristics_in_bar-plate_DC_negative_corona_discharge","286332089_Numerical_simulation_of_transient_space_charge_distribution_of_DC_positive_corona_discharge_under_atmospheric_pressure_air","3340494_Partial_discharges_at_DC_voltage_their_mechanism_detection_and_analysis","316631657_Comparison_of_positive_and_negative_ionic_wind_in_needle-to-plate_corona_discharge","289184682_Variation_of_the_characteristics_of_negative_DC_corona_streamer_pulse_with_air_pressure_and_humidity","3053468_Stochastic_Properties_of_Partial-discharge_Phenomena"]}