{"id":"349523169_DATA_ANALYSIS_AND_MODEL_OF_INFORMATION_PROCESSES_FOR_THE_FORMATION_OF_APPLIED_INFORMATION_SYSTEMS","abstract":"Взаимосвязи и взаимодействие информатики и науковедения являются одной из центральных проблем, проявляющих особенности интеграционных процессов в современной науке и намечающих пути поиска наиболее общих закономерностей развития современных научных направлений. Представлена процедурная модель информационных процессов при взаимодействии и взаимовлиянии информатики и науковедения, которая использует биографическо-библиографические данные и показывает пути поиска закономерностей развития различных научных направлений. Логика построения модели основана на анализе исходных данных – информационных структур и процессов, являющихся связующим звеном между «внутренними» (процессы проявления недокументированной виртуальной и искусственной информации) и «внешними» (документализация научной информации и её функционирование) сферами науки. Модель реализована на примере фактологического биобиблиографического потока документированной информации по публикационной активности лауреатов Нобелевской премии по химии за 1901-1988 гг.\n\nThe interrelations and interactions of computer science and science are one of the central problems manifesting the features of integration processes in modern science and outlining the search for the most common patterns in the development of modern scientific fields. The article presents a procedural mod-el of information processes in the interaction and mutual influence of informatics and science of sci-ence, which uses biographical and bibliographic data and shows ways to find patterns of development of various scientific areas. The logic of building a model is based on an analysis of the source data: in-formation structures and processes that are the connecting link between the “internal” (the manifestation processes of undocumented virtual and artificial information) and the “external” (documentation of scientific information and its functioning) areas of science. The model is implemented on the example of factual-logical bio-bibliographic flow of documented information on publication activity of Nobel Prize winners in chemistry for 1901-1988.","authors":["V.M. Tyutyunnik"],"meta":["February 2021"],"references":[]}