{"id":"349515378_Automatic_Exam_Correction_Framework_AECF_for_the_MCQs_Essays_and_Equations_Matching","abstract":"Automatic grading requires the adaption of the latest technologies. It has become essential especially when most of the courses became online courses (MOOCs). The objectives of the current work are (1) Reviewing the literature on the text semantic similarity and automatic exam correction systems, (2) Proposing an automatic exam correction framework (HMB-AECF) for MCQs, essays, and equations that is abstracted into five layers, (3) Suggesting equations similarity checker algorithm named “HMB-MMS-EMA”, (4) Presenting an expression matching dataset named “HMB-EMD-v1”, (5) Comparing the different approaches to convert textual data into numerical data (Word2Vec, FastText, Glove, and Universal Sentence Encoder (USE)) using three well-known Python packages (Gensim, SpaCy, and NLTK), and (6) Comparing the proposed equations similarity checker algorithm (HMB-MMS-EMA) with a Python package (SymPy) on the proposed dataset (HMB-EMD-v1). Eight experiments were performed on the Quora Questions Pairs and the UNT Computer Science Short Answer datasets. The best-achieved highest accuracy in the first four experiments was 77.95% without fine-tuning the pre-trained models by the USE. The best-achieved lowest root mean square error (RMSE) in the second four experiments was 1.09 without fine-tuning the used pre-trained models by the USE. The proposed equations similarity checker algorithm (HMB-MMS-EMA) reported 100% accuracy over the SymPy Python package which reported 71.33% only on “HMB-EMD-v1”.","authors":["Hossam Magdy Balaha","Mahmoud M. Saafan"],"meta":["February 2021IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2021.3060940"],"references":["345355673_Kinetic_Euclidean_Distance_Matrices","343301593_Survey_Analysis_Enhancing_the_Security_of_Vectorization_by_Using_word2vec_and_CryptDB","343301130_Multilingual_Universal_Sentence_Encoder_for_Semantic_Retrieval","340039476_Question_classification_based_on_Bloom's_taxonomy_cognitive_domain_using_modified_TF-IDF_and_word2vec","338713992_A_deep_learning_analysis_on_question_classification_task_using_Word2vec_representations","347772311_Automatic_Text_Summarization_Using_Gensim_Word2Vec_and_K-Means_Clustering_Algorithm","345474299_Automatic_Modulation_Recognition_of_Radar_Signals_Based_on_Manhattan_Distance-Based_Features","344987382_Automatic_Short_Answer_Grading_using_Siamese_Bidirectional_LSTM_Based_Regression","342483775_Sentence_Retrieval_using_Stemming_and_Lemmatization_with_Different_Length_of_the_Queries","341743597_word2vec_node2vec_graph2vec_X2vec_Towards_a_Theory_of_Vector_Embeddings_of_Structured_Data"]}