{"id":"349574130_Software_industry_awareness_on_sustainable_software_engineering_a_Brazilian_perspective","abstract":"Sustainable computing is a rapidly growing research topic spanning several areas of Computer Science. Particularly, it has received increasing attention in the Software Engineering field in the last years, with several studies discussing the topic from a range of perspectives. However, few studies have demonstrated the awareness of software practitioners about the underlying concepts of sustainability in the software development practice. In an earlier investigation, we performed a preliminary study on the practitioners' perception under four main perspectives: economic, social, environmental, and technical. This study extended the previous survey and reached a number of ninety-seven respondents from Brazilian companies. The extension aims to expand the results to compare and explore the previous findings in a more in-depth way. The novel results confirmed the evidence raised in the original survey that sustainability in the context of Software Engineering is a new subject for practitioners. However, professionals have shown interest in the topic, and there is a general understanding that sustainability should be treated as a quality attribute. Among the observed perspectives, we generated an initial theory that shows software practitioners know the subject around 'Green in Software', even unconsciously. This study brings evidence of how the industry understands and perceives sustainability practices in the software development process.","authors":["Leila Karita","Ivan Machado","Larissa Rocha Soares","Luana Almeida Martins"],"meta":["February 2021Journal of Software Engineering Research and Development 9(1):2:1--2:15","DOI:10.5753/jserd.2021.742","Project: Green and Sustainable Software Engineering"],"references":["321349992_Energy_efficiency_A_new_concern_for_application_software_developers","313185376_Sustainability_and_longevity_Two_sides_of_the_same_quality","353254345_Characterising_Sustainability_Requirements_A_New_Species_Red_Herring_or_Just_an_Odd_Fish","335951104_Software_industry_awareness_on_green_and_sustainable_software_engineering_a_state-of-the-practice_survey","328467265_Green_and_Sustainable_Software_Engineering_-_a_Systematic_Mapping_Study","321023439_Puzzling_out_Software_Sustainability","320366518_Interactions_between_environmental_sustainability_goals_and_software_product_quality_A_mapping_study","318463830_An_Interview_Study_on_Sustainability_Concerns_in_Software_Development_Projects","314027194_Editorial_Reality_check_for_software_engineering_for_sustainability-pragmatism_required_Editorial","313236892_GreCo_Green_code_of_ethics"]}