{"id":"349534303_Diabetic_Retinopathy_Detection","abstract":"Diabetic retinopathy is becoming a more prevalent disease in diabetic patients nowadays. The surprising fact about the disease is it leaves no symptoms at the beginning stage and the patient can realize the disease only when his vision starts to fall. If the disease is not found at the earliest it leads to a stage where the probability of curing the disease is less. But if we find the disease at that stage, the patient might be in a situation of losing the vision completely. Hence, this paper aims at finding the disease at the earliest possible stage by extracting two features from the retinal image namely Microaneurysms which is found to be the starting symptom showing feature and Hemorrhage which shows symptoms of the other stages. Based on these two features we classify the stage of the disease as normal, beginning, mild and severe using convolutional neural network, a deep learning technique which reduces the burden of manual feature extraction and gives higher accuracy. We also locate the position of these features in the disease affected retinal images to help the doctors offer better medical treatment. Keywords: Microneurysm; diagnose at the earliest stage; Hemorrhage; locate features; convolutional neural networks.","authors":["Sudha v.","K Priyanka","T Suvathi Kannathal","S Monisha"],"meta":["April 2020International Journal of Engineering and Advanced Technology 9(4):2249-8958","DOI:10.35940/ijeat.D7786.049420"],"references":["333585523_Recent_Development_on_Detection_Methods_for_the_Diagnosis_of_Diabetic_Retinopathy","325720060_Automated_Detection_of_Diabetic_Retinopathy_using_Deep_Learning","325666173_Diabetic_Retinopathy_Present_and_Past","279530174_Diabetic_Retinopathy_Detection_using_Image_Processing_A_Survey","241634815_Detection_and_classification_of_diabetic_retinopathy_using_retinal_images","331101438_A_brief_review_of_the_detection_of_diabetic_retinopathy_in_human_eyes_using_pre-processing_segmentation_techniques","326173413_Automatic_detection_of_diabetic_retinopathy_in_large_scale_retinal_images"]}