{"id":"349698594_Classification_of_Upper_Bound_Sequences_of_Local_Fractional_Metric_Dimension_of_Rotationally_Symmetric_Hexagonal_Planar_Networks","abstract":"The term metric or distance of a graph plays a vital role in the study to check the structural properties of the networks such as complexity, modularity, centrality, accessibility, connectivity, robustness, clustering, and vulnerability. In particular, various metrics or distance-based dimensions of different kinds of networks are used to resolve the problems in different strata such as in security to find a suitable place for fixing sensors for security purposes. In the field of computer science, metric dimensions are most useful in aspects such as image processing, navigation, pattern recognition, and integer programming problem. Also, metric dimensions play a vital role in the field of chemical engineering, for example, the problem of drug discovery and the formation of different chemical compounds are resolved by means of some suitable metric dimension algorithm. In this paper, we take rotationally symmetric and hexagonal planar networks with all possible faces. We find the sequences of the local fractional metric dimensions of proposed rotationally symmetric and planar networks. Also, we discuss the boundedness of sequences of local fractional metric dimensions. Moreover, we summarize the sequences of local fractional metric dimension by means of their graphs.","authors":["Shahbaz Ali","Muhammad Khalid Mahmood","Fairouz Tchier","Ferdous Tawfiq"],"meta":["February 2021Journal of Mathematics 2021(4):1-24","DOI:10.1155/2021/6613033"],"references":["348339356_A_Paradigmatic_Approach_to_Investigate_Restricted_Totient_Graphs_and_their_Indices","346894724_Sharp_Bounds_of_Local_Fractional_Metric_Dimensions_of_Connected_Networks","338794794_New_Labeling_Algorithm_on_Various_Classes_of_Graphs_with_Applications","335722970_NEW_NUMBERS_ON_EULER'S_TOTIENT_FUNCTION_WITH_APPLICATIONS","334546013_On_super_totient_numbers_with_applications_and_algorithms_to_graph_labelling","347505087_Graph_Theory_and_Its_Applications","341093777_Local_Fractional_Metric_Dimensions_of_Rotationally_Symmetric_and_Planar_Networks","340586286_Computing_the_Laplacian_Spectrum_of_Linear_Octagonal-Quadrilateral_Networks_and_Its_Applications","336598285_On_the_generalized_adjacency_Laplacian_and_signless_Laplacian_spectra_of_the_weighted_edge_corona_networks","335663893_On_the_Hosoya_Index_of_Graphs_Formed_by_a_Fractal_Graph"]}