{"id":"349648002_Comment_les_enseignants_assurent_la_continuite_pedagogique_et_evaluent_en_contexte_de_pandemie_Une_etude_en_Guadeloupe","abstract":"Comment les enseignants assurent la continuité pédagogique et évaluent en contexte de pandémie ? Une étude en Guadeloupe Évaluer. Journal international de recherche en éducation et formation, Numéro Hors-série, 1, 181-192 181 Comment les enseignants assurent la continuité pédagogique et évaluent en contexte de pandémie ? Une étude en Guadeloupe Manuel Lollia-Manuel-Hendy.Lollia@ac-guadeloupe.fr Académie de Guadeloupe Elisabeth Issaieva-elisabeth.issaieva@univ-antilles.fr CRREF (EA-4538), Université des Antilles Pour citer cet article : Lollia, M., & Issaieva, E. (2020). Comment les enseignants assurent la continuité pédagogique et évaluent en contexte de pandémie ? Une étude en Guadeloupe. Évaluer. Journal international de recherche en éducation et formation, Numéro Hors-série, 1, 181-192. Résumé La pandémie du Covid-19 a provoqué une situation de crise sanitaire inédite, qui a bouleversé notre planète et a conduit à des transformations des contextes (socio-politique, économique, éducatif, etc.) ainsi qu'à la prise de mesures successives dans plusieurs pays. Sur le plan éducatif, en France hexagonale ainsi que dans tous les Départements et Régions d'Outre-mer, les écoles sont fermées depuis le 16 mars 2020 et le Ministère de l'Education Nationale a recommandé à tous les enseignants d'assurer la « continuité pédagogique » en recourant à des outils numériques en vue d'organiser des situations d'enseignement et d'apprentissage à distance. Cela consistait à adapter les pratiques à un nouveau contexte complexe, rempli d'incertitudes. La tâche des enseignants est donc devenue encore plus exigeante. A cela peut s'ajouter la nécessité de faire face à des contraintes contextuelles complémentaires (socio-culturelles et matérielles) comme par exemple le fait qu'en Guadeloupe, beaucoup de familles d'élèves ne peuvent pas disposer de ressources et d'équipements numériques. Dans ces conditions, il est légitime de s'interroger sur la gestion de la continuité pédagogique par les enseignants. Comment continuent-ils à enseigner et à évaluer dans un contexte bouleversé ? Pour répondre à cette question, une enquête par questionnaire (auprès de 198 enseignants) et entretien (avec 7 enseignants) a été réalisée. L'analyse (quantitative et qualitative) a révélé que les enseignants sont conscients des enjeux de la continuité pédagogique dans ce contexte exceptionnel mais les nombreuses contraintes les empêchent de l'assurer et ceci malgré la volonté manifeste qu'ils affichent. Ils tentent aussi d'adapter, de développer et/ou de varier les démarches et les outils évaluatifs mais se sentent pris au piège par la réalité du terrain. Abstract Covid 19 pandemic has caused an unprecedented health crisis, which has turned our planet upside down and has led to changes in various contexts (socio-political, economic, educational, etc.) as well as to successive measures in several countries. Regarding education in continental France as well as in its overseas departments and areas, schools have been closed since March 16th, 2020 and the Ministry of National Education recommended to all teachers to carry on education by using digital tools in order to organize remote teaching. In other words, adapt practices to a new complex context, full of uncertainties. The teachers task has therefore become even more demanding. There is also a need to face additional contextual constraints (socio-cultural and material) such as, for example, the fact that, in Guadeloupe, many students 'families do not have digital resources and equipment. Under these conditions, it is legitimate to question the teachers' pedagogical continuity management. How do they continue to teach and give estimates in a disrupted context? To answer this question, a questionnaire survey (with 198 teachers) and an interview (with 7 teachers) were carried out. The quantitative and qualitative result revealed that teachers are aware of the challenges of pedagogical continuity under the present circumstances, but the numerous constraints prevent them from ensuring it, despite their entire willing to do so. They also try to adapt, develop and/or vary the processes and assessment procedures, but they feel trapped by the reality they encounter.","authors":["Manuel Lollia","Elisabeth Issaieva"],"meta":["May 2020"],"references":["330857282_Une_modelisation_pour_apprehender_la_referentialisation_dans_l'evaluation_des_apprentissages_des_eleves","261941977_A_quelles_conditions_l'evaluation_formative_de_l'enseignement_par_les_etudiants_est-elle_possible_en_France","346286981_Le_numerique_aujourd'hui_pour_former_des_adultes_de_demain","340037259_Dynamique_des_regulations_en_classe_virtuelle_ou_en_presentiel","337628510_Le_numerique_en_classe_en_2_temps_3_mouvements_-_Evaluation_d'un_scenario_de_formation_continuee","324479343_Vers_une_nouvelle_culture_de_l'enseignement_universitaire_L'evaluation_de_l'enseignement_par_les_etudiants_avec_les_TIC","317343700_Conceptions_et_prises_de_positions_des_enseignants_face_a_l'evaluation_scolaire_dans_quatre_systemes_educatifs_quel_est_le_reflet_des_cultures_et_politiques_evaluatives","296353045_L'analyse_de_contenu_Notions_et_etapes","273362702_Creer_de_la_presence_a_distance_en_e-learning_Cadre_theorique_definition_et_dimensions_cles","251041674_Apprivoiser_la_distance_et_supprimer_l'absence_ou_les_defis_de_la_formation_a_distance"]}