{"id":"349752613_Tsunami_simulation_for_disaster_mitigation_based_on_earthquake_scenarios_in_the_Molucca_subduction_zone_case_study_of_the_Molucca_Sea_earthquake_on_July_7_2019","abstract":"On July 7, 2019, an earthquake occurred beneath the Molucca Sea. The BMKG said the magnitude seven quakes at a depth 36 km. The next day, aftershocks occurred continuously. This data indicates that the Maluku Subduction Zone always moves dynamically, so it needs to be aware of the potential significant earthquake that can generate a tsunami in this zone. The purpose of this study is to determine the tsunami-prone areas due to earthquake activity beneath the Molucca Sea. This earthquake relates to the dynamics of plate tectonics. The location of the earthquake source is shown by the hypocenter. This location is important to know as part of pre-disaster mitigation information so that we have the preparation to handle the tsunami threat. The study was conducted using Tsunami Numerical Simulation. Earthquake parameter using the BMKG earthquake database that validated using the GFZ earthquake database. The conclusions of this study show ten locations of tsunami-prone areas. Five locations are located in North Sulawesi Province, these are Bitung, North Minahasa, Southeast Minahasa, Minahasa, East Bolaang Mongondow, and five other locations are located in North Maluku Province, those are North Halmahera, West Halmahera, Ternate, Tidore Islands, and South Halmahera.","authors":["Telly Kurniawan","Rahmat Setyo Yuliatmoko","Bambang Sunardi","Angga Setiyo Prayogo"],"meta":["March 2021AIP Conference Proceedings 2320(1):040026","DOI:10.1063/5.0037665","Conference: THE 4TH INTERNATIONAL CONFERENCE ON MATHEMATICS AND SCIENCE EDUCATION (ICoMSE) 2020: Innovative Research in Science and Mathematics Education in The Disruptive Era"],"references":["260200287_Global_relations_between_seismic_fault_parameters_and_moment_magnitude_of_earthquakes","249551333_Geochemical_evolution_of_magmatism_in_an_arc-arc_collision_The_Halmahera_and_Sangihe_arcs_eastern_Indonesia","279186482_Spatiotemporal_variation_of_b-value_in_Molucca_Collision_Zone_using_high_precision_relocated_hypocenters","244959006_Moment_magnitude_scale","222149197_Global_trench_migration_velocities_and_slab_migration_induced_upper_mantle_volume_fluxes_Constraints_to_find_an_Earth_reference_frame_based_on_minimizing_viscous_dissipation"]}