{"id":"349716355_O_uso_de_metaforas_no_portugues_academico_por_alunos_de_graduacao_uma_analise_baseada_em_corpus","abstract":"Pesquisas e estudos hoje têm demonstrado que a metáfora desempenha um papel importante no discurso acadêmico, o que tem alimentado discussões e reflexões acerca do seu uso (HERRMANN, 2013; GIANONNI, 2009; GIBBS, 2008; STEFANOWITSCH; GRIES, 2006). No discurso acadêmico de língua portuguesa, especificamente, pesquisas sobre esse fenômeno ainda são bastante incipientes, fazendo-se necessário um estudo que investigue o uso de metáforas nesse sentido. Considerando esse panorama, esta pesquisa tem por objetivo analisar e discutir o uso de metáforas no português acadêmico da graduação, promovendo uma caracterização desse discurso, bem como, futuramente, auxiliar falantes nativos do português brasileiro e de português como língua adicional que necessitam utilizar esse tipo de gênero. Assumindo a perspectiva da Linguística Cognitiva, a qual entende o sistema conceitual do ser humano como fundamentalmente metafórico por natureza (LAKOFF; JOHNSON, 1980), analisamos um corpus constituído por artigos acadêmicos de alunos de graduação (falantes nativos do português brasileiro) de uma universidade privada do Sul do Brasil. O corpus pesquisado compreende 30 trabalhos de conclusão das áreas da Comunicação Social e das Ciências da Computação. A partir da análise realizada, observamos que as áreas em questão parecem utilizar as metáforas de forma diferenciada, apresentando características distintas em cada uma delas.","authors":["Leticia Presotto","Karina Veronica Molsing"],"meta":["November 2017Entretextos 17(2):231","DOI:10.5433/1519-5392.2017v17n2p231"],"references":["28291730_Metaphor_identification_in_a_terminological_dictionary","321020623_Metaphor_in_Discourse","279235259_The_Poetics_of_Mind_Figurative_Thought_Language_and_Understanding","273947414_The_Cambridge_Handbook_of_Metaphor_and_Thought","273947202_Metaphor_A_Practical_Introduction","243653192_Variation_Across_Speech_and_Writing","2530760_The_Longman_Grammar_of_Spoken_and_Written_English"]}