{"id":"349759607_Strategies_to_manage_quality_requirements_in_agile_software_development_a_multiple_case_study","abstract":"Agile methods can deliver software that fulfills customer needs rapidly and continuously. Quality requirements (QRs) are important in this regard; however, detailed studies on how companies applying agile methods to manage QRs are limited, as are studies on the rationale for choosing specific QR management practices and related challenges. The aim of this study was to address why practitioners manage QRs as they do and what challenges they face. We also analyzed how existing practices mitigate some of the found challenges. Lastly, we connect the contextual elements of the companies with their practices and challenges. We conducted 36 interviews with practitioners from four companies of varying sizes. Since each company operates in different domains, comparing QR management strategies and related challenges in different contexts was possible. We found that the companies apply proactive, reactive, and interactive strategies to manage QRs. Additionally, our study revealed 40 challenges in six categories that companies applying agile methods may face in QR management. We also identified nine contextual elements that affect QR management practice choices and which, importantly, can explain many related challenges. Based on these findings, we constructed a theoretical model about the connection between context, QR management practices, and challenges. Practitioners in similar contexts can learn from the practices identified in this study. Our preliminary theoretical model can help other practitioners identify what challenges they can expect to face in QR management in different developmental contexts as well as which practices to apply to mitigate these challenges.","authors":["Pertti Karhapää","Woubshet Behutiye","Pilar Rodríguez","Markku Oivo"],"meta":["March 2021Empirical Software Engineering 26(2)","DOI:10.1007/s10664-020-09903-x"],"references":["342364539_Software_Engineering_Body_of_Knowledge_SWEBOK_Guide","337204616_Management_of_quality_requirements_in_agile_and_rapid_software_development_A_systematic_mapping_study","325174782_Scaling_agile_in_large_organizations_Practices_challenges_and_success_factors","320671927_Non-functional_Requirements_Documentation_in_Agile_Software_Development_Challenges_and_Solution_Proposal","320176216_Quality_Requirements_in_Agile_as_a_Knowledge_Management_Problem_More_than_Just-in-Time","320026057_Requirements_Engineering_Challenges_in_Large-Scale_Agile_System_Development","335956138_Requirements_Specification_for_Developers_in_Agile_Projects_Evaluation_by_two_Industrial_Case_Studies","331107896_Quality_requirements_challenges_in_the_context_of_large-scale_distributed_agile_An_empirical_study","322825963_Requirements_Engineering_a_systematic_mapping_study_in_agile_software_development","317486305_What_Do_We_Know_about_Alignment_of_Requirements_Engineering_and_Software_Testing"]}