{"id":"349746746_Optimizing_electric_vehicle_routing_problems_with_mixed_backhauls_and_recharging_strategies_in_multi-dimensional_representation_network","abstract":"Electric vehicles are environmental transportation modes that are widely applied in green logistics systems. To guarantee the energy efficiency, the impacts of customer service modes and recharging strategies need to be integrated into the optimization of electric logistics resource. This paper proposes an electric vehicle routing problem with mixed backhauls, time windows, and recharging strategies (EVRPMBTW-RS), minimizing the total travel cost with sophisticated constraints on the time-dependent pickup and delivery requests, limited recharging station capacity, and battery remaining capacity of electric vehicles. Mixed service sequences of linehaul and backhaul customers is allocated for the routing planning, with the synchronous optimization of recharging strategies including the selection of recharging stations and determination of recharging time. A time-discretized multi-commodity network flow model is constructed based on an extended space-time-state modeling framework, which is formulated as a quadratic 0-1 programming model by using the augmented Lagrangian relaxation technique. After the dualization and linearized transformation, we decompose the model into a sequence of least-cost path subproblems based on the alternating direction multiplier method (ADMM). The subproblems are alternately minimized and solved using the time-dependent forward dynamic programming algorithm. The solution quality can be guaranteed through calculating the optimality gap between the best lower bound and upper bound for each iteration. The proposed solution approach is examined on examples of a simple 7-node network and real-world Yizhuang road network. This paper provides a theoretical foundation for the route optimization method of electric logistics vehicles, and contributes to improve the operational efficiency of electric logistics systems.","authors":["Senyan Yang","Lianju Ning","Lu Carol Tong","Pan Shang"],"meta":["March 2021Expert Systems with Applications 176(2):114804","DOI:10.1016/j.eswa.2021.114804"],"references":["342640253_Electric_Vehicle_Routing_Problem_with_Non-Linear_Charging_and_Load-Dependent_Discharging","342046601_The_Time-Dependent_Electric_Vehicle_Routing_Problem_Model_and_Solution","336962179_ADMM-based_problem_decomposition_scheme_for_vehicle_routing_problem_with_time_windows","339979175_The_Constrained_Reliable_Shortest_Path_Problem_for_Electric_Vehicles_in_the_Urban_Transportation_Network","339398671_Augmented_Lagrangian_relaxation_approach_for_logistics_vehicle_routing_problem_with_mixed_backhauls_and_time_windows","339345967_Collaborative_two-echelon_multicenter_vehicle_routing_optimization_based_on_state-space-time_network_representation","338232674_Adoption_of_electric_vehicle_A_literature_review_and_prospects_for_sustainability","337835584_Fuzzy_optimization_model_for_electric_vehicle_routing_problem_with_time_windows_and_recharging_stations","336186827_The_electric_vehicle_routing_problem_with_time_windows_partial_recharges_and_satellite_customers","335421238_Solving_cyclic_train_timetabling_problem_through_model_reformulation_Extended_time-space_network_construct_and_Alternating_Direction_Method_of_Multipliers_methods"]}