{"id":"349759419_Diagrammatic_Formalism_for_Complex_Systems_More_than_One_Way_to_Eventize_a_Railcar_System","abstract":"This paper is in the intersection of software engineering and system engineering, two intimately intertwined disciplines. A dominating theme in this paper is the integral conceptualization of systems at large, as well as an underlying concern with software systems. In the software development life cycle, challenges still exist in translating requirements into a design artifact and then into an implementation (e.g., coding), then validating the results. From our perspective, software engineering requires an integrating paradigm toward a unified modeling orientation. Many methodologies, languages, and tools exist for facilitating system development processes. This paper is a venture into project development. To focus the materials, we concentrate on Harel's novel (and classic) development environment, which integrates a scenario-based engineering object orientation and statecharts through developing a railcar system. The railcar system is used as a detailed sample of translating requirements into a design artifact and then into an implementation, then validating the result. The project is re-cased as a single integrated modeling endeavor to be contrasted with the scenario and statecharts' development. The result of this scheme is an enriched understanding through experimenting with and contrasting various development methods of software projects.","authors":["Sabah Al-Fedaghi"],"meta":["February 2021"],"references":["349051468_UML_Modeling_to_TM_Modeling_and_Back","344120210_Computer_Program_Decomposition_and_DynamicBehavioral_Modeling","320971358_Ontology-Based_Pattern_for_System_Engineering","280610232_Extending_statecharts_to_model_system_interactions","270738094_Ontology_for_Systems_Development","270105046_Modeling_and_Calculation_of_Scenarios_Reliability_in_Component-Based_Software_Systems","340955175_Ontology_Learning_for_Systems_Engineering_Body_of_Knowledge","320747689_Towards_a_methodology_for_systems_engineering_ontology_development_-_An_ontology_for_system_life_cycle_processes","320146053_Model-based_systems_engineering_with_OPM_and_SysML","286455588_The_Engineering_Design_of_Systems_Models_and_Methods"]}