{"id":"349738313_Self-Driving_Laboratories_for_Development_of_New_Functional_Materials_and_Optimizing_Known_Reactions","abstract":"Innovations often play an essential role in the acceleration of the new functional materials discovery. The success and applicability of the synthesis results with new chemical compounds and materials largely depend on the previous experience of the researcher himself and the modernity of the equipment used in the laboratory. Artificial intelligence (AI) technologies are the next step in developing the solution for practical problems in science, including the development of new materials. Those technologies go broadly beyond the borders of a computer science branch and give new insights and practical possibilities within the far areas of expertise and chemistry applications. One of the attractive challenges is an automated new functional material synthesis driven by AI. However, while having many years of hands-on experience, chemistry specialists have a vague picture of AI. To strengthen and underline AI’s role in materials discovery, a short introduction is given to the essential technologies, and the machine learning process is explained. After this review, this review summarizes the recent studies of new strategies that help automate and accelerate the development of new functional materials. Moreover, automatized laboratories’ self-driving cycle could benefit from using AI algorithms to optimize new functional nanomaterials’ synthetic routes. Despite the fact that such technologies will shape material science in the nearest future, we note the intelligent use of algorithms and automation is required for novel discoveries.","authors":["Mikhail A Soldatov","Vera Butova","Danil Pashkov","Maria A. Butakova"],"meta":["March 2021Nanomaterials 11(3):619","DOI:10.3390/nano11030619"],"references":["348368880_Digital_Transformation_in_Materials_Science_A_Paradigm_Change_in_Material's_Development","345045741_Quantum_transport_evidence_of_Weyl_fermions_in_an_epitaxial_ferromagnetic_oxide","342790679_A_mobile_robotic_chemist","341361505_Self-driving_laboratory_for_accelerated_discovery_of_thin-film_materials","339219329_Beyond_Ternary_OPV_High-Throughput_Experimentation_and_Self-Driving_Laboratories_Optimize_Multicomponent_Systems","347911167_Electrowetting-on-dielectric_EWOD_digital_microfluidic_device_for_in-line_workup_in_organic_reactions_A_critical_step_in_the_drug_discovery_work_cycle","340947617_An_Automated_Flow_Chemistry_Platform_to_Decouple_Mixing_and_Reaction_Times","339835527_Machine-Learning-Accelerated_Perovskite_Crystallization","339746697_Big-data_driven_approaches_in_materials_science_A_survey","338100271_When_robotics_met_fluidics"]}