{"id":"349707487_Skill_levels_and_gains_in_university_STEM_education_in_China_India_Russia_and_the_United_States","abstract":"Universities contribute to economic growth and national competitiveness by equipping students with higher-order thinking and academic skills. Despite large investments in university science, technology, engineering and mathematics (STEM) education, little is known about how the skills of STEM undergraduates compare across countries and by institutional selectivity. Here, we provide direct evidence on these issues by collecting and analysing longitudinal data on tens of thousands of computer science and electrical engineering students in China, India, Russia and the United States. We find stark differences in skill levels and gains among countries and by institutional selectivity. Compared with the United States, students in China, India and Russia do not gain critical thinking skills over four years. Furthermore, while students in India and Russia gain academic skills during the first two years, students in China do not. These gaps in skill levels and gains provide insights into the global competitiveness of STEM university students across nations and institutional types.","authors":["Prashant Loyalka","Ou Lydia Liu","Guirong Li","Elena Kardanova"],"meta":["July 2021Nature Human Behaviour 5(7):1-13","DOI:10.1038/s41562-021-01062-3"],"references":["331866106_Computer_science_skills_across_China_India_Russia_and_the_United_States","336751090_University_Expansion_in_a_Changing_Global_Economy_Triumph_of_the_BRICs","333891223_The_Race_between_Education_and_Technology","322210221_Skill_Requirements_across_Firms_and_Labor_Markets_Evidence_from_Job_Postings_for_Professionals","317079298_Reservoir_of_foreign_talent","314897800_Human_Capital_and_Technology_Diffusion","313744503_Academically_Adrift_Limited_Learning_on_College_Campuses","313554320_On_the_mechanics_of_economic_development","313302179_Job_Market_Signaling","313146545_Human_Capital_and_China's_Future_Growth"]}