{"id":"349859527_An_Error_Analysis_Framework_for_Shallow_Surface_Realisation","abstract":"The metrics standardly used to evaluate Natural Language Generation (NLG) models, such as BLEU or METEOR, fail to provide information on which linguistic factors impact performance. Focusing on Surface Realization (SR), the task of converting an unordered dependency tree into a well-formed sentence, we propose a framework for error analysis which permits identifying which features of the input affect the models’ results. This framework consists of two main components: (i) correlation analyses between a wide range of syntactic metrics and standard performance metrics and (ii) a set of techniques to automatically identify syntactic constructs that often co-occur with low performance scores. We demonstrate the advantages of our framework by performing error analysis on the results of 174 system runs submitted to the Multilingual SR shared tasks; we show that dependency edge accuracy correlate with automatic metrics thereby providing a more interpretable basis for evaluation; and we suggest ways in which our framework could be used to improve models and data. The framework is available in the form of a toolkit which can be used both by campaign organizers to provide detailed, linguistically interpretable feedback on the state of the art in multilingual SR, and by individual researchers to improve models and datasets.1","authors":["Anastasia Shimorina","Yannick Parmentier","Claire Gardent"],"meta":["April 2021Transactions of the Association for Computational Linguistics 9(2)","DOI:10.1162/tacl_a_00376"],"references":["336999557_BME-UW_at_SRST-2019_Surface_realization_with_Interpreted_Regular_Tree_Grammars","335273602_Weighted_posets_Learning_surface_order_from_dependency_trees","343299443_Fast_and_Accurate_Non-Projective_Dependency_Tree_Linearization","338053321_Revisiting_the_Binary_Linearization_Technique_for_Surface_Realization","336998372_Weird_Inflects_but_OK_Making_Sense_of_Morphological_Generation_Errors","336996693_Surface_Realisation_Using_Full_Delexicalisation","336996562_IMSurReal_IMS_at_the_Surface_Realization_Shared_Task_2019","336996327_Neural_data-to-text_generation_A_comparison_between_pipeline_and_end-to-end_architectures","336995884_The_Second_Multilingual_Surface_Realisation_Shared_Task_SR'19_Overview_and_Evaluation_Results","334600982_Designing_a_Symbolic_Intermediate_Representation_for_Neural_Surface_Realization"]}