{"id":"349898220_Combining_Outcome-Based_and_Preference-Based_Matching_A_Constrained_Priority_Mechanism","abstract":"We introduce a constrained priority mechanism that combines outcome-based matching from machine learning with preference-based allocation schemes common in market design. Using real-world data, we illustrate how our mechanism could be applied to the assignment of refugee families to host country locations, and kindergarteners to schools. Our mechanism allows a planner to first specify a threshold $\\bar g$ for the minimum acceptable average outcome score that should be achieved by the assignment. In the refugee matching context, this score corresponds to the probability of employment, whereas in the student assignment context, it corresponds to standardized test scores. The mechanism is a priority mechanism that considers both outcomes and preferences by assigning agents (refugee families and students) based on their preferences, but subject to meeting the planner’s specified threshold. The mechanism is both strategy-proof and constrained efficient in that it always generates a matching that is not Pareto dominated by any other matching that respects the planner’s threshold.","authors":["Avidit Acharya","Kirk Bansak","Jens Hainmueller"],"meta":["March 2021Political Analysis","DOI:10.1017/pan.2020.48"],"references":["343516128_In_search_of_opportunity_and_community_Internal_migration_of_refugees_in_the_United_States","334768412_Ethnic_networks_can_foster_the_economic_integration_of_refugees","350382049_Placement_Optimization_in_Refugee_Resettlement","336274136_In_Search_of_Opportunity_and_Community_The_Secondary_Migration_of_Refugees_in_the_United_States","335804672_Migration_as_Submodular_Optimization","332038908_Assigning_Refugees_to_Landlords_in_Sweden_Efficient_Stable_Maximum_Matchings","328522218_Boosting_Refugee_Outcomes_Evidence_from_Policy_Academia_and_Social_Innovation","326797971_Reserve_Design_Unintended_Consequences_and_the_Demise_of_Boston's_Walk_Zones","326104848_Marketplaces_Markets_and_Market_Design","323715811_College_Admissions_and_the_Stability_of_Marriage"]}