{"id":"349809442_Escapp_A_Web_Platform_for_Conducting_Educational_Escape_Rooms","abstract":"Educational escape rooms are emerging as a new type of learning activity with the potential to enhance students’ learning through highly engaging experiences. However, conducting educational escape rooms effectively is very complex and there are no software tools available for this purpose. This lack of support is hindering the widespread use and adoption of these activities. This article presents Escapp, a web platform that allows teachers to conduct effective and highly engaging educational escape rooms. The platform has been used for conducting three different educational escape rooms (one face-to-face and two remotely) in three higher education settings. Three case studies were conducted to empirically evaluate the usefulness of Escapp for conducting these activities, which involved more than 400 students. On the one hand, a questionnaire was administered to students to gather their opinions on the Escapp platform, obtaining very positive results in terms of overall usefulness, usability and engagement. On the other hand, data automatically recorded by Escapp during the three educational escape rooms are presented as evidence of the high number of student interactions that take place during activities of this kind and the need of using a software system for conducting them in an effective way. The results of this article show that Escapp is a well-suited solution for conducting effective face-to-face and remote educational escape rooms.","authors":["Sonsoles López-Pernas","Aldo Gordillo","Enrique Barra","Juan Quemada"],"meta":["March 2021IEEE Access 9:38062 - 38077","DOI:10.1109/ACCESS.2021.3063711","Project: Educational Escape Rooms"],"references":["348870975_Escape_Room_Games_Can_you_transform_an_unpleasant_situation_into_a_pleasant_one","347833115_Escape_education_A_systematic_review_on_escape_rooms_in_education","347631440_Evaluating_an_Educational_Escape_Room_Conducted_Remotely_for_Teaching_Software_Engineering","346018836_Digital_Escape_Room_Using_GenialLy_and_A_Breakout_to_Learn_Algebra_at_Secondary_Education_Level_in_Spain","344846645_Learning_Mathematics_with_Emerging_Methodologies-The_Escape_Room_as_a_Case_Study","343201558_Escape_the_Remote_Classroom_An_Online_Escape_Room_for_Remote_Learning","352301370_The_Toxiscape_Hunt_An_Escape_Room-Scavenger_Hunt_for_Toxicology_Education","345380051_An_escape-room_inspired_game_for_genetics_review","343303955_Physical_and_Digital_Educational_Escape_Room_for_Teaching_Chemical_Bonding","342756475_Applying_Digital_Escape_Rooms_Infused_with_Science_Teaching_in_Elementary_School_Learning_Performance_Learning_Motivation_and_Problem-Solving_Ability"]}