{"id":"349865889_Geochemical_approaches_in_tsunami_research_current_knowledge_and_challenges","abstract":"Over the past decade or so, geochemical techniques have been applied to the study of modern and past tsunamis. Seawater incursions and the introduction of marine organic matter can be detected through geochemical analysis, providing strong evidence that an event deposit was formed by saltwater inundation. Furthermore, the marine geochemical signature of an event may reveal the full extent of tsunami inundation far more precisely than can be obtained from sediment alone. Based mainly on literature published during the last 4 years, this paper summarizes the latest advances in and some problems with tsunami geochemical research, and specifically addresses organic and inorganic proxies with high preservation potential, geochemical characteristics of invisible tsunami deposits, handling of data from core scanners, and offshore environmental impacts. Recent studies have proposed that some organic and inorganic geochemical proxies have high preservation potential, and sometimes such evidence can be recognized from invisible tsunami deposits. Quantitative assessments of biomarkers are also effective for detecting allochthonous materials. Organic and inorganic proxies can be applied both to identify tsunami deposits and to accurately reconstruct tsunami inundation areas; however, there are as yet no universal criteria for accurate reconstruction of tsunami inundation areas by detecting invisible tsunami deposits using geochemical approaches. For deeper understanding of the behavior of geochemical characteristics derived from tsunami events, additional knowledge of the geochemical substances associated with modern and paleo-tsunami events is required. Specifically, further work is required on assessment of the environmental selectivity of geochemical proxies and refinement of core-scanner analysis for both organic and inorganic substances.","authors":["Tetsuya Shinozaki"],"meta":["March 2021Geoscience Letters 8(1):6","DOI:10.1186/s40562-021-00177-9"],"references":["341296035_Recent_and_historical_tsunami_deposits_from_Lake_Tokotan_eastern_Hokkaido_Japan_inferred_from_nondestructive_grain_size_and_radioactive_cesium_analyses","330663403_Organic_geochemical_investigation_of_far-field_tsunami_deposits_of_the_Kahana_Valley_O'ahu_Hawai'i","330451320_Sedimentary_geochemical_evidence_of_historical_tsunamis_in_the_Eastern_Mediterranean_from_Oludeniz_Lagoon_SW_Turkey","323966841_Sedimentological_and_dendrochronological_indicators_of_coastal_storm_risk_in_western_France","343630327_A_7300_year_record_of_environmental_changes_in_a_coastal_wetland_Moawhitu_New_Zealand_and_evidence_for_catastrophic_overwash_tsunami","343355532_Post-depositional_changes_to_tsunami_deposits_and_their_preservation_potential","341644830_A_geochemical_approach_for_identifying_marine_incursions_Implications_for_tsunami_geology_on_the_Pacific_coast_of_northeast_Japan","338633803_Anthropogenic_pollutants_and_biomarkers_for_the_identification_of_2011_Tohoku-oki_tsunami_deposits_Japan","335224556_Geological_evidence_and_sediment_transport_modelling_for_the_1946_and_1960_tsunamis_in_Shinmachi_Hilo_Hawaii","334728388_Sediments_of_Matsushima_Bay_Northeastern_Japan_Insights_Gained_From_5_Years_of_Sedimentological_Analysis_Following_the_2011_Tohoku_Earthquake-Tsunami"]}