{"id":"349884636_Establishment_and_Clinical_Application_of_an_Artificial_Intelligence_Diagnostic_Platform_for_Identifying_Rectal_Cancer_Tumor_Budding","abstract":"Tumor budding is considered a sign of cancer cell activity and the first step of tumor metastasis. This study aimed to establish an automatic diagnostic platform for rectal cancer budding pathology by training a Faster region-based convolutional neural network (F-R-CNN) on the pathological images of rectal cancer budding. Postoperative pathological section images of 236 patients with rectal cancer from the Affiliated Hospital of Qingdao University, China, taken from January 2015 to January 2017 were used in the analysis. The tumor site was labeled in Label image software. The images of the learning set were trained using Faster R-CNN to establish an automatic diagnostic platform for tumor budding pathology analysis. The images of the test set were used to verify the learning outcome. The diagnostic platform was evaluated through the receiver operating characteristic (ROC) curve. Through training on pathological images of tumor budding, an automatic diagnostic platform for rectal cancer budding pathology was preliminarily established. The precision–recall curves were generated for the precision and recall of the nodule category in the training set. The area under the curve = 0.7414, which indicated that the training of Faster R-CNN was effective. The validation in the validation set yielded an area under the ROC curve of 0.88, indicating that the established artificial intelligence platform performed well at the pathological diagnosis of tumor budding. The established Faster R-CNN deep neural network platform for the pathological diagnosis of rectal cancer tumor budding can help pathologists make more efficient and accurate pathological diagnoses.","authors":["Shanglong Liu","Yuejuan Zhang","Yiheng Ju","Ying Li"],"meta":["March 2021Frontiers in Oncology 11","DOI:10.3389/fonc.2021.626626"],"references":["341144662_Tumour_Budding_Is_an_Independent_Predictive_Factor_of_Cutaneous_Squamous-cell_Carcinoma_Aggressiveness","339888854_High_tumor_budding_is_a_strong_predictor_of_poor_prognosis_in_the_resected_perihilar_cholangiocarcinoma_patients_regardless_of_neoadjuvant_therapy_showing_survival_similar_to_those_without_resection","339172506_Disease_Classification_in_Eggplant_Using_Pre-trained_VGG16_and_MSVM","336977589_Tumor_budding_outperforms_ypT_and_ypN_classification_in_predicting_outcome_of_rectal_cancer_after_neoadjuvant_chemoradiotherapy","342335771_Is_It_Time_to_Introduce_PETCT_in_Rectal_Cancer_Guidelines","337490371_Establishment_and_application_of_an_artificial_intelligence_diagnosis_system_for_pancreatic_cancer_with_a_faster_region-based_convolutional_neural_network","336433678_Convolutional_neural_networks_for_wound_detection_the_role_of_artificial_intelligence_in_wound_care","335091208_Artificial_intelligence_in_digital_pathology_-_new_tools_for_diagnosis_and_precision_oncology","334217287_Regulating_Artificial_Intelligence_for_a_Successful_Pathology_Future","333483379_Artificial_intelligence_in_digital_pathology_A_roadmap_to_routine_use_in_clinical_practice"]}