{"id":"349861824_Marigold_Blooming_Maturity_Levels_Classification_Using_Machine_Learning_Algorithms","abstract":"Image processing is swiftly progressive in the area of computer science and engineering. Image classification is a fascinating task in image processing. In this study, we have classified the marigold blooming maturity levels like a marigold bud, partial blooming marigold, and fully blooming marigold. To classify the marigold blooming maturity levels are a tough and time-consuming task for human beings. Hence, an automatic marigold maturity levels classification tool is very adjuvant even for experience humans to classify the huge number of marigolds. For the sake of that, we have deliberated a novel system to classify automatically marigold blooming maturity levels image data by using machine learning algorithms. There are three types of machine learning models namely Artificial Neural Network(ANN), Convolutional Neural Network(CNN), and Support Vector Machine(SVM) that are used to automatically classify marigold maturity levels. Hence, we have preprocessed the image at first. Then we extract the various features from the marigold images. After that, these features have fed into Machine Learning(ML) models and classify these images into the category. From the experiment, we observed that the Convolutional Neural Network (CNN) model provides a high accuracy compared to other Artificial Neural Network(ANN) and Support Vector Machine(SVM) algorithms. The Convolutional Neural Network(CNN) models performed the best among all two classifiers with an overall accuracy of 93.9%. Our proposed system is efficiently classifying marigold maturity levels.","authors":["Shuaeb Nixon"],"meta":["March 2021International Journal of Computer (IJC) 40(1):50-65","Project: Marigold Blooming Maturity Levels Classification Using Machine Learning Algorithms"],"references":["344249077_Flower_Identification_and_Classification_using_Computer_Vision_and_Machine_Learning_Techniques","328754813_Stock_Prediction_Using_Convolutional_Neural_Network","327019925_Deep_learning_for_smart_agriculture_Concepts_tools_applications_and_opportunities","326705107_Flower_classification_based_on_single_petal_image_and_machine_learning_methods","335085346_Classification_of_Blurred_Flowers_Using_Convolutional_Neural_Networks","333081995_A_New_Flower_Classification_System_Using_LBP_and_SURF_Features","312562134_Flower_classification_via_convolutional_neural_network","280486368_An_Automatic_Flower_Classification_Approach_Using_Machine_Learning_Algorithms","269322623_Blooming_flower_recognition_by_using_eigenvalues_of_shape_features","258856314_Introduction_to_Machine_Learning","224215082_Digital_Image_Classification_for_Malaysian_Blooming_Flower","221551861_Automated_Flower_Classification_over_a_Large_Number_of_Classes"]}