{"id":"349873585_ON_THE_IMPORTANCE_OF_THE_EMPIRICAL_IDIOSYNCRASY_IN_EFFICIENT_COMMUNICATION_OF_COMPUTER_SCIENCE_AND_E-BUSINESS_TERMINOLOGY","abstract":"The domain of computer science is extremely versatile and dynamic, its complexity leading to the coinage of numerous new terms in a relatively short period of time. Their origin is, more often than not, empirical and these new terms have practical value. Moreover, they are customary and easy to remember, thus making the “science” behind the domain under scrutiny more appealing and easier to understand by non-specialists. The present paper aims at investigating the computer science terminology from a different perspective; it intends to devote special attention to the words which have acquired a new meaning, transgressing boundaries from general vocabulary to the active vocabulary of the non-specialist computer user. The novelty of this research lies in its focus on devising a new classification of these words which have their origin in the general English, thus helping non-specialist computer users to easily understand and use them. Consequently, the everyday English words assimilated by the information technology domain will be divided into six broad categories, i.e. standalone words, open compounds, closed or transparent compounds, compounds written as hyphenated words or that have a preposition or a conjunction as a linking element, words derived with the suffix –er, each of these encompassing a plethora of explained examples, which are very common in the aforementioned sphere","authors":["ulia Veronica COCU","Carmen Oprit-Maftei"],"meta":["December 2020","DOI:10.26520/mcdsare.2020.4.188-198"],"references":["336498932_UNQUESTIONABLE_USE_OF_ANGLICISMS_IN_ROMANIAN_COMPUTERESE","325610785_On_the_Problem_and_Promise_of_Metaphor_Use_in_Science_and_Science_Communication","271560168_Metaphor_in_Computer_Science","350724071_The_Sociolinguistics_of_Digital_Englishes","318494453_Metaphors_We_Live_By","317349376_An_Introduction_to_Cognitive_Linguistics","316042414_Translation_Patterns_at_Term_Level_A_corpus-based_analysis_in_the_specialised_language_of_ICT","313414914_The_Imperial_Tongue_English_as_the_Dominating_Academic_Language","272747702_English_as_a_Global_Language","256980453_Technologies_and_utopias_The_cyberflaneur_and_the_experience_of_being_online","234807478_Metaphor_design_in_user_interfaces"]}