{"id":"349818074_Traffic_networks_are_vulnerable_to_disinformation_attacks","abstract":"Disinformation continues to raise concerns due to its increasing threat to society. Nevertheless, a threat of a disinformation-based attack on critical infrastructure is often overlooked. Here, we consider urban traffic networks and focus on fake information that manipulates drivers’ decisions to create congestion at a city scale. Specifically, we consider two complementary scenarios, one where drivers are persuaded to move towards a given location, and another where they are persuaded to move away from it. We study the optimization problem faced by the adversary when choosing which streets to target to maximize disruption. We prove that finding an optimal solution is computationally intractable, implying that the adversary has no choice but to settle for suboptimal heuristics. We analyze one such heuristic, and compare the cases when targets are spread across the city of Chicago vs. concentrated in its business district. Surprisingly, the latter results in more far-reaching disruption, with its impact felt as far as 2 km from the closest target. Our findings demonstrate that vulnerabilities in critical infrastructure may arise not only from hardware and software, but also from behavioral manipulation.","authors":["Marcin Waniek","Guru Raghav Raman","Bedoor Alshebli","Jimmy Chih-Hsien Peng"],"meta":["March 2021Scientific Reports 11(1):5329","DOI:10.1038/s41598-021-84291-w"],"references":["339954559_Secure_Traffic_Lights_Replay_Attack_Detection_for_Model-based_Smart_Traffic_Controllers","334853557_Cyberphysical_risks_of_hacked_internet-connected_vehicles","330710636_Fighting_misinformation_on_social_media_using_crowdsourced_judgments_of_news_source_quality","330395254_Science_audiences_misinformation_and_fake_news","329218472_The_spread_of_low-credibility_content_by_social_bots","330626092_Fake_news_on_Twitter_during_the_2016_US_presidential_election","329750836_Robust_Physical-World_Attacks_on_Deep_Learning_Visual_Classification","329472316_A_Review_on_Safety_Failures_Security_Attacks_and_Available_Countermeasures_for_Autonomous_Vehicles","327198750_Sybil_Attack_Resilient_Traffic_Networks_A_Physics-Based_Trust_Propagation_Approach","325656437_Data_Integrity_Attacks_Against_Dynamic_Route_Guidance_in_Transportation-Based_Cyber-Physical_Systems_Modeling_Analysis_and_Defense"]}