{"id":"349878609_Proyeccion_de_Matricula_para_el_Analisis_de_la_Infraestructura_de_Programas_Academicos_en_Via_de_Acreditacion","abstract":"La proyección de matrícula es una metodología útil para pronosticar el flujo educativo de cualquier institución educativa, ya que apoya la toma de decisiones. La UNESCO ha diseñado un modelo de simulación para la estrategia y política educativa llamado EPSSim. Se recuperó la información del sistema de control escolar Instituto Tecnológico Superior de Irapuato para realizar elcálculo de las tasas de transición, las cuales se usaron en el modelo de flujo educativo diseñado y aplicado a una solución de software. El modelo de flujo educativo estimó una proyección de 63 alumnos para el primer ciclo del año 2016 teniendo como base 93 alumnos de nuevo ingreso. Las dos áreas de infraestructura académica que resultaron deficientes en el análisis de la proyección considerando los lineamientos del Consejo Nacional de Acreditación en Informática y Computación son el equipamiento de los laboratorios y el acervo bibliográfico disponible en la biblioteca. Enrollment forecast is a useful methodology to estimate the educational flow of any educational institution in order to support decision making. UNESCO has developed a simulation model for both, educational strategy and educational policy called EPSSim.The information needed to calculate the transition rates was retrieved from the educational control system of the Instituto Tecnologico Superior de Irapuato, these rates were used in the educational flow model, designed and applied to a software solution. This educational flow model estimated 63 students in the first cycle in 2016 having a base of 93 of new enrollment. The academic infrastructure areas that were deficient considering this forecast regarding the guidelines of the Consejo Nacional de Acreditación en Informática y Computación (National Computing Acreditation Council) were the equipment of laboratories and the bibliographic titles available in the library.","authors":["R. Villegas Téllez","D.A. Torres Frausto","K. Palacios Gutiérrez","F. De Los Reyes Quiroz"],"meta":["February 2021Tecnología Educativa Revista CONAIC 2(1):44-56","DOI:10.32671/terc.v2i1.167"],"references":[]}