{"id":"349810082_Flow-induced_instabilities_of_springs-mounted_plates_in_viscous_flows_A_global_stability_approach","abstract":"The linear stability of a typical aeroelastic section, consisting in a rectangular plate mounted on flexion and torsion springs, is revisited here for low-Reynolds-number incompressible flows. By performing global stability analyses of the coupled fluid-solid equations, we find four types of unstable modes related to different physical instabilities and classically investigated with separate flow models: coupled-mode flutter, single-mode flutter and static divergence at high reduced velocity U* and vortex-induced vibrations at low U*. Neutral curves for\nthese modes are presented in the parameter space composed of the solid-to-fluid mass ratio and the reduced velocity. Interestingly, the \nflutter mode is seen to restabilize for high reduced velocities thus leading to a finite extent flutter region, delimited by low-U* and high-U* boundaries. At a particular low mass ratio, both boundaries merge such that no flutter instability is observed for lower mass ratios. The effect of the Reynolds number is then investigated, indicating that the high-U* restabilization strongly depends on viscosity. The global stability results are compared to a statically calibrated Theodorsen model: if both approaches converge in the high mass ratio limit, they significantly differ at lower mass ratios. In addition, the Theodorsen model fails to predict the high-U* restabilization of the flutter mode.","authors":["Johann Moulin","Olivier Marquet"],"meta":["March 2021Physics of Fluids 33(3)","DOI:10.1063/5.0038368","Project: AEROFLEX - Aeroelastic instabilities and control of FLEXible structures"],"references":["348240643_Towards_Global_Stability_Analysis_of_Flexible_Aircraft_in_Edge-of-the-Envelope_Flow","345907524_Fluid-solid_Floquet_stability_analysis_of_self-propelled_heaving_foils","341958455_Fluid-structure_stability_analyses_and_nonlinear_dynamics_of_flexible_splitter_plates_interacting_with_a_circular_cylinder_flow","340355968_Dynamic_mode_decomposition_based_analysis_of_flow_over_a_sinusoidally_pitching_airfoil","338482511_Transonic_aeroelasticity_A_new_perspective_from_the_fluid_mode","338417226_Flow-induced_vibrations_of_a_pitching_and_plunging_airfoil","334361686_Linear_stability_analysis_of_strongly_coupled_fluid-structure_problems_with_the_Arbitrary-Lagrangian-Eulerian_method","339694388_Vortex-induced_vibration_prediction_via_an_impedance_criterion","336636393_Flutter-enhanced_mixing_in_small-scale_mixers","335434020_Flow_physics_and_dynamics_of_flow-induced_pitch_oscillations_of_an_airfoil"]}