{"id":"349879976_Characterization_of_Associative_PU-algebras_by_the_Notion_of_Derivations","abstract":"In this manuscript we insert the concept of derivations in associative PU-algebras and discuss some of its important results such that we prove that for a mapping being a (Left, Right) or (Right, Left)-derivation of an associative PU-algebra then such a mapping is one-one. If a mapping is regular then it is identity. If any element of an associative PU-algebra satisfying the criteria of identity function then such a map is identity. We also prove some useful properties for a mapping being (Left, Right)-regular derivation of an associative PU-algebra and (Right, Left)-regular derivation of an associative PU-algebra. Moreover we prove that if a mapping is regular (Left, Right)-derivation of an associative PU-algebra then its Kernel is a subalgebra. We have no doubt that the research along this line can be kept up, and indeed, some results in this manuscript have already made up a foundation for further exploration concerning the further progression of PU-algebras. These definitions and main results can be similarly extended to some other algebraic systems such as BCH-algebras, Hilbert algebras, BF-algebras, J-algebras, WS-algebras, CI-algebras, SU-algebras, BCL-algebras, BP-algebras and BO-algebras, Z-algebras and so forth. The main purpose of our future work is to investigate the fuzzy derivations ideals in PU-algebras, which may have a lot of applications in different branches of theoretical physics and computer science.","authors":["Mehmood Khan","Dawood Khan","Khalida Mir Aalm","Khalida Mir Alam"],"meta":["January 2021American Journal of Mathematical and Computer Modelling 6(1):14-18","DOI:10.11648/j.ajmcm.20210601.13"],"references":["342615321_DERIVATIONS_IN_SEMIGROUP_ALGEBRAS","284173790_New_View_Of_Ideals_On_PU-Algebra","266713217_On_symmetric_bi-derivations_of_BCI-algebras","266604743_Some_results_on_derivations_of_BCI-algebras","320897410_On_fg-derivations_of_G-algebras","312620016_Some_Open_Problems_on_Locally_Finite_or_Locally_Nilpotent_Derivations_and_mathcal_E-Derivations","251046481_An_algebra_related_with_a_propositional_calculus","247035895_On_the_distance_of_the_composition_of_two_derivations_to_the_generalized_derivations","247009351_On_Left_Derivations_and_Related_Mappings","232954458_Generalized_derivations_in_rings","226456371_Rings_in_which_derivations_satisfy_certain_algebraic_conditions","40009690_On_Derivations_in_Near-Rings"]}