{"id":"349865121_Assessment_of_gender_divide_in_scientific_communities","abstract":"Increasing evidence of women’s under-representation in some scientific disciplines is prompting researchers to expand our understanding of this social phenomenon. Moreover, any countermeasures proposed to eliminate this under-representation should be tailored to the actual reasons for this different participation. Here, we take a multi-dimensional approach to assessing gender differences in science by representing scientific communities as social networks, and using data analytics, complexity science methods, and semantic methods to measure gender differences in the context, the attitude and the success of scientists. We apply this approach to four scientific communities in the two fields of computer science and information systems using the network of authors at four different conferences. For each discipline, one conference is based in Italy and attracts mostly Italians, while one conference is international in both location and participants. The present paper provides evidence against common narratives that women’s under-representation is due to women’s limited skills and/or less social centrality.","authors":["Antonio De Nicola","G. D'Agostino"],"meta":["March 2021Scientometrics 126(2)","DOI:10.1007/s11192-021-03885-3"],"references":["339598954_Gender_rank_and_social_networks_on_an_enterprise_social_media_platform","339344596_Historical_comparison_of_gender_inequality_in_scientific_careers_across_countries_and_disciplines","334274632_Gender_equality_and_youth_opportunities_and_risks_of_digitalisation","332955562_Gender_bias_in_Nobel_prizes","331947791_Women_are_needed_in_STEM_European_policies_and_incentives","331085879_Large_teams_develop_and_small_teams_disrupt_science_and_technology","341122769_A_bibliometric_approach_for_detecting_the_gender_gap_in_computer_science","340634704_The_Diversity-Innovation_Paradox_in_Science","332653842_Gender_Achievement_Gaps_in_US_School_Districts","332650191_Countering_the_negative_image_of_women_in_computing"]}