{"id":"349855683_Omnichannel_Customer_Experience_and_Management_An_Integrative_Review_and_Research_Agenda","abstract":"In a highly competitive landscape, adopting an omnichannel approach might lead to a market advantage in terms of acquiring and retaining customers, as well as a means to ensure business sustainability. Omnichannel organizations situate the customer at the core of their interaction. However, research on omnichannel customer experience (CX) is still fragmented. In this paper, by adopting an integrative approach, we aim to articulate the empirical evidence around omnichannel CX and its management. Moreover, we show how research around omnichannel CX emerged from different theoretical perspectives and disciplines such as marketing, sociology and computer science. Towards this goal, we conducted a systematic literature review—with in depth analysis of 50 papers—and identified that omnichannel CX literature has engaged a number of research streams from various theoretical perspectives. Based on the research gaps, we propose an agenda for future research including topics such as (1) understanding the customer lifecycle in an omnichannel context; (2) integrating new touchpoints and channels; (3) predicting the omnichannel customer behavior; and (4) approaching omnichannel CX in service-based organizations. We conclude that adopting an omnichannel CX management approach requires the entire organization to be customer-centric while articulating interdisciplinary teams. Available studies on omnichannel CX provide the foundations for extending the knowledge on this topic and developing tools for practitioners to use in the omnichannel management assessment, operationalization, and measurement.","authors":["Carmen Gerea","Fernanda Gonzalez-Lopez","Valeria Herskovic"],"meta":["March 2021Sustainability 13(5):2824","DOI:10.3390/su13052824"],"references":["346602253_Customer_Experience_in_Retail_A_Systematic_Literature_Review","342826995_The_Relation_between_Sustainable_Development_Trends_and_Customer_Value_Management","341966891_The_omni-channel_approach_A_utopia_for_companies","346488787_Re-examining_systematic_literature_review_in_management_research_Additional_benefits_and_execution_protocols","345452172_Acquiring_customers_through_online_marketplaces_The_effect_of_marketplace_sales_on_sales_in_a_retailer's_own_channels","345442560_Loyalty_Formation_for_Different_Customer_Journey_Segments","344292295_Moving_from_multi-channel_to_Omni-channel_retailing_Special_issue_introduction","340882467_The_impact_of_channel_integration_on_consumers'_channel_preferences_Do_showrooming_and_webrooming_behaviors_matter","340473174_Omni-channel_Management_in_the_New_Retailing_Era_A_Systematic_Review_and_Future_Research_Agenda","339605598_The_role_of_the_store_in_managing_postpurchase_complaints_for_omnichannel_shoppers"]}