{"id":"349933575_Cas_confirmes_de_paludisme_au_Bresil_entre_les_annees_2011_et_2015","abstract":"Le paludisme est une maladie mondiale qui cause un nombre élevé de décès. Elle est causée par la piqûre du moustique Anopholes infecté par le protozoaire parasite du genre Plasmodium. Le but de cet article est de montrer le nombre de cas confirmés de paludisme au Brésil, en ce qui concerne les années de confirmation, la tranche d’âge et la notification région, entre les années 2011 et 2015. Données issues du département informatique de SUS, DATASUS et d’articles. Il y a eu une baisse du nombre de la période mentionnée, les personnes entre le groupe d’âge de 20 à 39 ans, suivi par le groupe entre 49 et 59 ans, le plus grand nombre de cas est survenu avec des personnes de sexe masculin, le plus grand nombre de des cas se sont produits avec des personnes de race blanche suivies de bruns, le plus grand nombre de cas par scolarité est inconnu là où la scolarité est connue, le plus grand nombre concerne des personnes ayant terminé leurs études secondaires, suivies par des personnes ayant terminé leurs études supérieures, le plus grand nombre de cas est survenu dans une zone urbaine, la région du sud-est a le plus grand nombre de cas confirmés de paludisme dans la période, le plus grand nombre de cas survenus dans l’état de Rondônia. On en conclut que les campagnes ont eu une influence sur la société et ont collaboré à la réduction du nombre de maladies transmissibles comme le paludisme. Les hommes travaillent dans des zones à plus haut risque de contamination et dans des lieux de prolifération des vecteurs, ils sont donc plus exposés aux zones de prolifération et de contagion des moustiques. Au Brésil, la majorité de la population est reconnue comme étant respectivement blanche et brune, de sorte que les chiffres montrent que ces ethnies sont les plus infectées. Le moustique semble proliférer plus facilement dans les endroits où il y a eu des changements causés par l’homme. Le milieu urbain, étant un lieu extrêmement modifié, est à l’origine d’un plus grand nombre de cas en raison de la plus grande disponibilité de gîtes de reproduction. On pense que pour cette raison, la région du sud-est a un plus grand nombre de cas et parce que c’est aussi l’une des régions du pays qui a subi le plus de changements par l’homme. L’ouverture d’autoroutes et l’augmentation des colonies facilitent le contact entre les moustiques et les humains. L’état de Rondônia compte un grand nombre de colonies et de déboisements pour s’adapter au progrès.","authors":["Hellen Karine Santos Almeida","Amanda Alves Fecury","Euzébio de Oliveira","Carla Viana Dendasck"],"meta":["April 2020","DOI:10.32749/nucleodoconhecimento.com.br/sante/paludisme-au-bresil"],"references":["342165923_Diferencas_regionais_na_transicao_da_mortalidade_por_doencas_cardiovasculares_no_Brasil_1980_a_2012","328076146_A_EVOLUCAO_DO_NUMERO_DE_PESSOAS_INFECTADAS_POR_MALARIA_NO_BRASIL_ENTRE_2003_E_2015","281295903_Impactos_do_declinio_do_bonus_demografico_sobre_a_oferta_de_mao_de_obra_e_o_crescimento_economico_no_periodo_2014-2030","250983306_A_malaria_encenada_no_grande_teatro_social","237475591_Meio_ambiente_e_saude_metodologia_para_analise_espacial_da_ocorrencia_de_malaria_em_projetos_de_assentamento","26370235_Genero_morbidade_acesso_e_utilizacao_de_servicos_de_saude_no_Brasil","326904865_Malaria_rapid_diagnostic_test_and_Giemsa_-_stained_peripheral_blood_smear_discrepancies_in_the_diagnosis_of_Plasmodium_ovale_infection_in_New_England"]}