{"id":"349970983_Multilayer_representation_of_collaboration_networks_with_higher-order_interactions","abstract":"Collaboration patterns offer important insights into how scientific breakthroughs and innovations emerge in small and large research groups. However, links in traditional networks account only for pairwise interactions, thus making the framework best suited for the description of two-person collaborations, but not for collaborations in larger groups. We therefore study higher-order scientific collaboration networks where a single link can connect more than two individuals, which is a natural description of collaborations entailing three or more people. We also consider different layers of these networks depending on the total number of collaborators, from one upwards. By doing so, we obtain novel microscopic insights into the representativeness of researchers within different teams and their links with others. In particular, we can follow the maturation process of the main topological features of collaboration networks, as we consider the sequence of graphs obtained by progressively merging collaborations from smaller to bigger sizes starting from the single-author ones. We also perform the same analysis by using publications instead of researchers as network nodes, obtaining qualitatively the same insights and thus confirming their robustness. We use data from the arXiv to obtain results specific to the fields of physics, mathematics, and computer science, as well as to the entire coverage of research fields in the database.","authors":["E. Vasilyeva","A. Kozlov","Karin Alfaro","D. Musatov"],"meta":["March 2021Scientific Reports 11(1):5666","DOI:10.1038/s41598-021-85133-5"],"references":["348214781_Evolutionary_dynamics_of_higher-order_interactions_in_social_networks","342155505_Networks_beyond_pairwise_interactions_Structure_and_dynamics","325256573_Evolutionary_games_on_multilayer_networks_A_colloquium","324745118_Fundamentals_of_spreading_processes_in_single_and_multilayer_complex_networks","319275431_The_shape_of_collaborations","317062237_Statistical_physics_of_human_cooperation","344129591_The_Structure_of_Complex_Networks_Theory_and_Applications","327821441_A_hypergraph_model_for_representing_scientific_output","320848558_Network_Science_of_Biological_Systems_at_Different_Scales_A_Review","313607570_The_architecture_of_complex_weighted_networks"]}