{"id":"349934084_The_role_of_gender_and_academic_degree_on_preference_for_smooth_curvature_of_abstract_shapes","abstract":"Background\nPreference for smooth contours occurs for a variety of visual stimuli. However, there are individual differences. Openness to experience, a trait associated with aesthetic appreciation, emotional sensitivity and abstract thinking, correlates with this preference. The evaluation of meaningless stimuli entails automatic associations influenced by knowledge, intellectual interests and individual experiences which are diverse. However, it is difficult to capture this variability in studies restricted to Undergraduate students in Psychology with a prevalence of female participants.\n\nMethods\nHere we examined preference for curvature with 160 undergraduate students in Psychology, Mathematics, Engineering and Computer Science, balanced for gender. Participants viewed abstract shapes varying for contour (angular vs. curved). The shapes presented variations in Vertices (10, 20, 30) and Concavity (30%, 40%, 50%) to increase complexity. Participants rated how much they liked each shape on a 0 (dislike) to 100 (like) scale. Furthermore, because students in pure Science disciplines present autistic-like traits as measured with the Autism Quotient (AQ), and there is evidence that individuals with autism respond positively to edgy abstract shapes, participants also completed the AQ.\n\nResults\nOverall participants preferred curved shapes to angular shapes. We confirmed past research showing that complexity played a key role, with simple shapes with less vertices (10 vertices) being preferred over shapes with larger number of vertices (20 and 30 vertices). Furthermore, simple shapes (10 vertices) were preferred more with more concavities (50%). Importantly, an interaction between academic degree and gender revealed that preference for smooth curvature was stronger for Psychology female participants. Science students scored higher than Psychology students on the AQ. Interestingly, multilevel analyses showed that the variability of AQ traits in the sample did not contribute to this interaction. The results are discussed in relation to theories of preference formation and individual differences.","authors":["Letizia Palumbo","Giulia Rampone","Marco Bertamini"],"meta":["March 2021PeerJ 9(1):e10877","DOI:10.7717/peerj.10877"],"references":["329507504_The_effects_of_presentation_time_on_preference_for_curvature_of_real_objects_and_meaningless_novel_patterns","320059486_Walking_through_Architectural_Spaces_The_Impact_of_Interior_Forms_on_Human_Brain_Dynamics","315934597_Curve_Appeal_Exploring_Individual_Differences_in_Preference_for_Curved_Versus_Angular_Objects","312379500_Simple_Shapes_Elicit_Different_Emotional_Responses_in_Children_with_Autism_Spectrum_Disorder_and_Neurotypical_Children_and_Adults","338280696_A_Study_of_Objects_With_Smooth_or_Sharp_Features_Created_as_Line_Drawings_by_Individuals_Trained_in_Design","337472393_What's_in_a_shape_Evidence_of_gender_category_associations_with_basic_forms","333485707_Aesthetic_sensitivity_to_curvature_in_real_objects_and_abstract_designs","329971507_A_comparison_between_preference_judgments_of_curvature_and_sharpness_in_architectural_facades","319643189_Preference_for_Curved_Contours_Across_Cultures","316236431_ggplot2"]}