{"id":"349921904_Elementary_school_in_the_conditions_of_digital_transformation_of_the_education_system","abstract":"Informational support of education is an area of pedagogical science that has been actively developing in Russia over the past few decades. Today, it has become the basis for the digital transformation of education, whose essence is transforming the methods of professional teaching by integrating digital technologies and moving to a data-based decision-making model. Among the participants of educational relations, there are diametrically opposite views on the possibility and feasibility of digitalization of education, especially at its initial stage. The purpose of this research is to present an authorial standpoint on the problem of digitalization of education with regard to both elementary general education in general, and digitalization of the Mathematics and Computer Science subject area, in particular, at the level of primary general education. The research methods include content analysis of scientific articles and methodological publications, the regulatory framework of school education, as well as generalization and systematization of international research in the field of the digital transformation of education. Authors considered external aspects of the digital transformation of primary education, determined by the general requirements for the information educational environment; highlighted activity areas related to the formation of students’ basic digital skills in the course of mastering all subject areas without exception; as well as revealed the problems of internal digitalization of the Mathematics and Computer Science subject area at the level of primary general education. The article substantiates the expediency of strengthening the logical and algorithmic components of the initial course of mathematics, the content line responsible for working with data, as well as several other issues related to theoretical computer science, and outlines prospects of the digital transformation of training of future primary school teachers to work in a modern digital educational environment.","authors":["Lyudmila Bosova","Aleksandr Chekin","Yelena Borisova","Marina Oleynikova"],"meta":["January 2021SHS Web of Conferences 98:05023","DOI:10.1051/shsconf/20219805023"],"references":["334175851_IEA_International_Computer_and_Information_Literacy_Study_2018_Assessment_Framework","344884595_The_Power_of_Computational_Thinking_Games_Magic_and_Puzzles_to_Help_You_Become_a_Computational_Thinker","342307364_Strategic_Directions_of_Development_of_Informatization_of_Domestic_Education_of_Digital_Information_Technologies_Period","331717080_MODERN_TRENDS_IN_THE_DEVELOPMENT_OF_SCHOOL_INFORMATICS_IN_RUSSIA_AND_ABROAD"]}