{"id":"349988902_Universal_variational_quantum_computation","abstract":"Variational quantum algorithms dominate contemporary gate-based quantum enhanced optimization, eigenvalue estimation, and machine learning. Here we establish the quantum computational universality of variational quantum computation by developing two objective functions which minimize to prepare outputs of arbitrary quantum circuits. The fleeting resource of variational quantum computation is the number of expected values which must be iteratively minimized using classical-to-quantum outer loop optimization. An efficient solution to this optimization problem is given by the quantum circuit being simulated itself. The first construction is efficient in the number of expected values for n-qubit circuits containing O(polylnn) non-Clifford gates—the number of expected values has no dependence on Clifford gates appearing in the simulated circuit. The second approach yields O(L2) expected values whereas introducing not more than O(lnL) slack qubits for a quantum circuit partitioned into L gates. Hence, the utilitarian variational quantum programming procedure—based on the classical evaluation of objective functions and iterated feedback—is, in principle, as powerful as any other model of quantum computation. This result elevates the formal standing of the variational approach whereas establishing a universal model of quantum computation.","authors":["Jacob Biamonte"],"meta":["March 2021","DOI:10.1103/PhysRevA.103.L030401"],"references":["343831767_On_the_universality_of_the_quantum_approximate_optimization_algorithm","342963763_Machine_learning_phase_transitions_with_a_quantum_processor","342436089_Certified_variational_quantum_algorithms_for_eigenstate_preparation","336628546_Parameterized_quantum_circuits_as_machine_learning_models","335583873_Simulation_of_quantum_circuits_by_low-rank_stabilizer_decompositions","323722413_Learning_the_quantum_algorithm_for_state_overlap","322243414_Quantum_Computing_in_the_NISQ_era_and_beyond","321823603_A_quantum_algorithm_to_train_neural_networks_using_low-depth_circuits","339805553_Reachability_Deficits_in_Quantum_Approximate_Optimization","338414794_Variational_quantum_algorithms_for_nonlinear_problems"]}