{"id":"349909034_Category-Level_Adversarial_Adaptation_for_Semantic_Segmentation_using_Purified_Features","abstract":"We target the problem named unsupervised domain adaptive semantic segmentation. A key in this campaign consists in reducing the domain shift, so that a classifier based on labeled data from one domain can generalize well to other domains. With the advancement of adversarial learning framework, recent works prefer the strategy of aligning the marginal distribution in the feature spaces for minimizing the domain discrepancy. However, based on the observance in experiments, only focusing on aligning global marginal distribution but ignoring the local joint distribution alignment fails to be the optimal choice. Other than that, the noisy factors existing in the feature spaces, which are not relevant to the target task, entangle with the domain invariant factors improperly and make the domain distribution alignment more difficult. To address those problems, we introduce two new modules, Significance-aware Information Bottleneck (SIB) and Category-level alignment (CLA), to construct a purified embedding based category-level adversarial network. In three domain adaptation tasks, i.e., GTA5 -> Cityscapes, SYNTHIA -> Cityscapes and Cross Season, we validate that our proposed method matches the state of the art in segmentation accuracy.","authors":["Yawei Luo","Ping Liu","Liang Zheng","Guan Tao"],"meta":["March 2021IEEE Transactions on Pattern Analysis and Machine Intelligence PP(99):1-1","DOI:10.1109/TPAMI.2021.3064379"],"references":["322749812_SegNet_A_Deep_Convolutional_Encoder-Decoder_Architecture_for_Image_Segmentation","322060135_Unpaired_Image-to-Image_Translation_Using_Cycle-Consistent_Adversarial_Networks","321511311_Image_to_Image_Translation_for_Domain_Adaptation","339555603_Significance-Aware_Information_Bottleneck_for_Domain_Adaptive_Semantic_Segmentation","338511982_Taking_a_Closer_Look_at_Domain_Shift_Category-Level_Adversaries_for_Semantics_Consistent_Domain_Adaptation","329747606_Maximum_Classifier_Discrepancy_for_Unsupervised_Domain_Adaptation","329746099_Learning_to_Adapt_Structured_Output_Space_for_Semantic_Segmentation","329743528_StarGAN_Unified_Generative_Adversarial_Networks_for_Multi-domain_Image-to-Image_Translation","327455026_Transferable_Representation_Learning_with_Deep_Adaptation_Networks","324717586_Fully_Convolutional_Adaptation_Networks_for_Semantic_Segmentation"]}