{"id":"349967699_Transfer_learning_for_solvation_free_energies_From_quantum_chemistry_to_experiments","abstract":"Data scarcity, bias, and experimental noise are all frequently encountered problems in the application of deep learning to chemical and material science disciplines. Transfer learning has proven effective in compensating for the lack in data. The use of quantum calculations in machine learning enables the generation of a diverse dataset and ensures that learning is less affected by noise inherent to experimental databases. In this work, we propose a transfer learning approach for the prediction of solvation free energies that combines fundamentals from quantum calculations with the higher accuracy of experimental measurements using two new databases CombiSolv-QM and CombiSolv-Exp. The employed model architecture is based on the directed-message passing neural network for the molecular embedding of solvent and solute molecules. A significant advantage of models pre-trained on quantum calculations is demonstrated for small experimental datasets and for out-of-sample predictions. The improved out-of-sample performance is shown for new solvents, for new solute elements, and for the extension to higher molar mass solutes. The overall performance of the pre-trained models is limited by the noise in the experimental test data, known as the aleatoric uncertainty. On a random test split, a mean absolute error of 0.21 kcal/mol is achieved. This is a significant improvement compared to the mean absolute error of the quantum calculations (0.40 kcal/mol). The error can be further reduced to 0.09 kcal/mol if the model performance is assessed on a more accurate subset of the experimental data.","authors":["Florence Vermeire","William Green"],"meta":["March 2021Chemical Engineering Journal 418(7715):129307","DOI:10.1016/j.cej.2021.129307"],"references":["337968358_Machine_Learning_for_Catalysis_Informatics_Recent_Applications_and_Prospects","337452955_Enhancing_materials_property_prediction_by_leveraging_computational_and_experimental_data_using_deep_transfer_learning","335267252_Delfos_Deep_Learning_Model_for_Prediction_of_Solvation_Free_Energies_in_Generic_Organic_Solvents","334780900_Analyzing_Learned_Molecular_Representations_for_Property_Prediction","334150615_Approaching_coupled_cluster_accuracy_with_a_general-purpose_neural_network_potential_through_transfer_learning","342642234_A_Transfer_Learning_Study_of_Gas_Adsorption_in_Metal-Organic_Frameworks","342126478_Exploring_chemical_compound_space_with_quantum-based_machine_learning","341886273_Chemically_Interpretable_Graph_Interaction_Network_for_Prediction_of_Pharmacokinetic_Properties_of_Drug-Like_Molecules","336162829_Predicting_Materials_Properties_with_Little_Data_Using_Shotgun_Transfer_Learning","333830417_Accurate_Thermochemistry_with_Small_Data_Sets_A_Bond_Additivity_Correction_and_Transfer_Learning_Approach"]}