{"id":"349961977_Outlier_Detection_with_Explanations_on_Music_Streaming_Data_A_Case_Study_with_Danmark_Music_Group_Ltd","abstract":"In the digital marketplaces, businesses can micro-monitor sales worldwide and in real-time. Due to the vast amounts of data, there is a pressing need for tools that automatically highlight changing trends and anomalous (outlier) behavior that is potentially interesting to users. In collaboration with Danmark Music Group Ltd. we developed an unsupervised system for this problem based on a predictive neural network. To make the method transparent to developers and users (musicians, music managers, etc.), the system delivers two levels of outlier explanations: the deviation from the model prediction, and the explanation of the model prediction. We demonstrate both types of outlier explanations to provide value to data scientists and developers during development, tuning, and evaluation. The quantitative and qualitative evaluation shows that the users find the identified trends and anomalies interesting and worth further investigation. Consequently, the system was integrated into the production system. We discuss the challenges in unsupervised parameter tuning and show that the system could be further improved with personalization and integration of additional information, unrelated to the raw outlier score.","authors":["Jonas Herskind Sejr","Thorbjørn Christiansen","Nicolai Dvinge","Dan Hougesen"],"meta":["March 2021Applied Sciences 11(5):2270","DOI:10.3390/app11052270"],"references":["330477082_A_Comparison_of_ARIMA_and_LSTM_in_Forecasting_Time_Series","327248907_The_Mythos_of_Model_Interpretability_In_machine_learning_the_concept_of_interpretability_is_both_important_and_slippery","304782562_Long_Short_Term_Memory_Networks_for_Anomaly_Detection_in_Time_Series","345422575_An_Emotional_Recommender_System_for_Music","339906364_Unsupervised_Anomaly_Detection_in_Time_Series_Using_LSTM-Based_Autoencoders","334276369_DARPA's_Explainable_Artificial_Intelligence_XAI_Program","329475599_Regression_Shrinkage_and_Selection_Via_the_Lasso","327122545_There_and_back_again_Outlier_detection_between_statistical_reasoning_and_data_mining_algorithms","318124115_Recommendation_in_Social_Media_Networks","305999024_Why_Should_I_Trust_You_Explaining_the_Predictions_of_Any_Classifier"]}