{"id":"350048394_Generalized_Relation_between_the_Roots_of_Polynomial_and_Term_of_Recurrence_Relation_Sequence","abstract":"Many researchers have been working on recurrence relation which is an important topic not only in mathematics but also in physics, economics and various applications in computer science. There are many useful results on recurrence relation sequence but there main problem to find any term of recurrence relation sequence we need to find all previous terms of recurrence relation sequence. There were many important theorems obtained on recurrence relations. In this paper we have given special identity for generalized ℎ order recurrence relation. These identities are very useful for finding any term of any order of recurrence relation sequence. Authors define a special formula in this paper by this we can find direct any term of a recurrence relation sequence. In this recurrence relation sequence to find any terms we need to find all previous terms so this result is very important. There is important property of a relation between coefficients of recurrence relation terms and roots of a polynomial for second order relation but in this paper, we gave this same property of recurrence relation of all higher order recurrence relation. So finally, we can say that this theorem is valid all order of recurrence relation only condition that roots are distinct. So, we can say that this paper is generalization of property of a relation between coefficients of recurrence relation terms and roots of a polynomial. Theorem:-Let 1 2 are arbitrary real numbers and suppose the equation 2 − 1 − 2 = 0 (1) Has 1 2 are distinct roots. Then the sequence < > is a solution of the recurrence relation = 1 −1 + 2 −2 ≥ 2 (2) iff = 1 1 + 2 2. For n= 0, 1, 2 …where 1 and 2 are arbitrary constants. Proof:-First suppose that< > of type = 1 1 + 2 2 + 3 3 we shall prove < > is a solution of recurrence relation (2). Since 1 , 2 3 are roots of equation (1) so all are satisfied equation (1) so we have 1 2 = 1 1 + 2 , 2 2 = 1 1 + 2. Consider 1 −1 + 2 −2 = 1 (1 1 −1 + 2 2 −1) + 2 (1 1 −2 + 2 2 −2) = 1 1 −2 (1 1 + 2)+ 2 2 −2 (1 2 + 2)= 1 1 + 2 2 =. This implies 1 −1 + 2 −2 =. So the sequence < > is a solution of the recurrence relation. Now we will prove the second part of theorem. Let = 1 −1 + 2 −2 ≥ 2 is a sequence with three 0 = 1 , 1 = 2 , Let = 1 1 + 2 2. So 1 + 2 = 1 (3). 1 1 + 2 2 = 2 (4). Multiply by 1 to (3) and subtracts from (4). We have 2 = 2 − 1 2 − 1 similarly we can find 1 = 2 − 1 1 − 2. So we can say that values of 1 2 are defined as roots are distinct. So non-trivial values of 1 2 can find and we can say that result is valid. Example: Let < > be any sequence such that = 6 −1 − 11 −2 + 6 −3 , ≥ 3 and 0 = 0, 1 = 1, 2 = 2. Then find 10 for above sequence. Solution: The polynomial of above sequence is 3 − 6 2 + 11 − 6 = 0. Solving this equation we have roots are 1, 2, and 3 using above theorem we have = 1 1 2 + 2 2 2 + 3 3 2 (7). Using 0 = 0, 1 = 1, 2 = 2 in (7) we have 1 + 2 + 3 = 0 (8). 1 + 2 2 + 3 3 = 1 (9). 1 + 4 2 + 9 3 = 2 (10) Solving (8), (9) and (10) we have 1 = − 3 2 , 2 = 2, 3 = − 1 2. This implies = − 3 2 1 + 22 − 1 2 3. Now put n=10 we have 10 = −27478. Recurrence relation is a very useful topic of mathematics, many problems of real life may be solved by recurrence relations, but in recurrence relation there is a Mathematics and Statistics 9(1): 54-58, 2021 55 major difficulty in the recurrence relation. If we want to find 100 th term of sequence, then we need to find all previous 99 terms of given sequence, then we can get 100 th term of sequence but above theorem is very useful if coefficients of recurrence relation of given sequence satisfies the condition of the above theorem, then we can apply above theorem and we can find direct any term of sequence without finding all previous terms.","authors":["Mannu Arya","Vipin Verma"],"meta":["January 2021Mathematics and Statistics 9(1):54-58"],"references":["286385726_Average_size_of_a_self-conjugate_st-core_partition","262974485_Multi-cores_posets_and_lattice_paths","262222203_Partitions_which_are_simultaneously_t_1_and_t_2_-core","259312799_The_Catalan_Case_of_Armstrong's_Conjecture_on_Simultaneous_Core_Partitions","254862999_Results_and_conjectures_on_simultaneous_core_partitions"]}