{"id":"350072368_The_value_at_the_industry_40_and_the_digital_transformation_process_evidence_from_brazilian_small_enterprises","abstract":"Objective: We use an approach that merge aspects from the literature of Value and the\nliterature of Business Models, thus exploring aspects related to value proposition, value\ncreation and value capture. More specifically, we analyze how these aspects were affected by in four small Brazilian organizations that were attending to the industry 4.0.\n\nMethodology: To explore the relationship between the aspects of value and the industry\n4.0/digital transformation, we conducted four case studies on small Brazilian enterprises. Our study is classified as being exploratory, with a cross-sectional perspective merged with a longitudinal approximation.\n\nOriginality / relevance: The origin of digital transformation is present in the areas of\nengineering and computer science and, therefore, resulting in technical studies, while the\nperspectives of economic and business management are still little explored in academia.\n\nResults: The results demonstrate that all three aspects of value were affected by the industry 4.0, but with a greater level at the organizations classified as providers of digital technologies. Apart from that, we also identified that the organizations relied mainly on partnerships and organizational ecosystems to successfully address and overcome the changes created by Industry 4.0.","authors":["Giovani Cruzara","Emanuel Sandri","Ana Paula Mussi Szabo Cherobim","José R. Frega"],"meta":["March 2021Revista Gestão & Tecnologia 21(1):117-141","DOI:10.20397/2177-6652/2021.v21i1.1860","Project: Industry 4.0, Dynamic Capabilities and Business Models"],"references":["332987868_The_Influence_of_Critical_Factors_on_Business_Model_at_a_Smart_Factory_A_Case_Study","322111745_Integrating_hybridity_and_business_model_theory_in_sustainable_entrepreneurship","319400013_An_exploratory_study_of_innovation_strategies_of_the_internet_of_things_SMEs_in_South_Korea","319274406_Business_models_value_capture_and_the_digital_enterprise","315670892_Past_present_and_future_of_Industry_40_-_a_systematic_literature_review_and_research_agenda_proposal","322278358_Fortune_favors_the_prepared_How_SMEs_approach_business_model_innovations_in_Industry_40","320307554_The_influence_of_the_Industrial_Internet_of_Things_on_business_models_of_established_manufacturing_companies_-_A_business_level_perspective","318893447_Innovative_Business_Models_for_the_Industrial_Internet_of_Things","313107992_A_business_is_a_value_delivery_system","312985464_Building_theories_from_case_study_research"]}