{"id":"350044938_Assistant_Training_System_of_Teenagers'_Physical_Ability_Based_on_Artificial_Intelligence","abstract":"The rapid development of artificial intelligence technology makes it widely used in various fields. In order to more scientifically assist teenagers in physical training, this paper develops a set of teenagers’ physical training system based on artificial intelligence technology. Firstly, the experimental platform is built, and the sensor nodes are connected with the test host through the serial port to collect data to the experimental platform. The system consists of target detection module, data analysis module, and human posture estimation module. The background modeling method based on vibe model is used to form the target detection module, and the canny edge detection algorithm is used to form the data analysis module. Finally, the posture auxiliary index is established to estimate the human posture. This paper makes a systematic application test on a youth sports team. The experimental group was trained with artificial intelligence-based physical training system, while the control group was trained with traditional training methods. Before the experiment, the physical fitness of the two groups of subjects were evaluated, including standing long jump, 50 meters sprint, 30 s single swing rope skipping, pull-up, and squat 1RM. After 3 and 6 weeks of training, the physical fitness was evaluated again. The experimental results show that the intelligent assistant system established in this paper can accurately show that the physiological load of the athlete is in line with the law of physiological function change. After six weeks of training, the standing long jump of the experimental group has been improved by 20.97 cm, the 50 meters dash has been accelerated by 1.21 s, the 30 second single swing rope has been increased by 13.76, the pull-up has been increased by 1.41, and the squat 1RM has been increased by 15.16. This shows that the auxiliary training system based on artificial intelligence can help young athletes improve their physical quality and enhance their sports skills.\n\n1. Introduction\n\n1.1. Background Significance\nAlthough China’s sports industry has been more rapid development, the athletes’ physical training is always not satisfactory. Improper physical training methods and schemes will not only lead to the training to not reach the expected effect and athletes not able to play their true level in the competition but also may cause harm to the athletes’ body [1]. Especially, for the athletes in their youth, their physical functions and skills are in the stage of development [2]. A scientific physical training system will undoubtedly provide solutions to these problems. In this paper, based on artificial intelligence technology, the construction of intelligent physical assistant training system is of great significance to strengthen the effect of physical training for teenagers.\n\n1.2. Related Work\nPhysical training has become an integral part of the European education system because it brings knowledge and insights centered on the principles and concepts of learning skills in the 21st century. Roliak A O analyzed the structure, content, and goal of basic sports in Danish professional teacher training system [3]. Taking mountaineering training as an example, Chen h introduced the development and design of virtual reality technology in sports training courses [4]. First, he described the overall design of the mountaineering training system based on virtual reality technology and then introduced the implementation process of each part. On this basis, he put forward the autonomous learning training mode of the system and, finally, carried out the control experiment to verify the effectiveness of the system.\nWith the development of computer technology, artificial intelligence technology is widely used in the evaluation system. Decision support system is a computer-based information system. The development of sports evaluation decision system can provide scientific support for sports training. Xie puts forward a method to optimize the analysis of physical education teaching evaluation system and the design of intelligent evaluation system. The system has multiple teaching management modules, which can realize dynamic physical education evaluation and reasonably arrange students’ daily training plan [5]. The traditional training system based on case teaching is to carry out strength training for aerobics special movements according to the analysis of previous competitions and training cases. The training results cannot be evaluated intelligently and accurately, and the performance of dynamic analysis is poor. In view of this problem, Jia designed the core training system of aerobics special strength quality based on artificial intelligence to realize the intelligent training of aerobics special strength quality [6]. Through the research of fuzzy normal form system, the intelligent functions of optimization and decision-making of intelligent fuzzy network are realized. He uses FIR filter to deal with the phase distortion in the process of signal transmission and realizes the information management of trainees and statistical query of training results through the information management module. His research provides a technical reference for the construction of the experimental platform in this paper.\n\n1.3. Innovative Points in This Paper\nIn order to improve the quality of physical assistive training for teenagers and cultivate higher quality young athletes for Chinese sports, this paper studies the physical assistive training system for teenagers based on artificial intelligence technology. The innovations of this paper are as follows: (1) the experimental platform is successfully built. The sensor nodes are connected with the test host through the serial port, and the data can be transmitted to the experimental platform after collecting. (2) The function template of the designed intelligent system includes three modules: target detection module, data analysis module, and human posture estimation module. (3) Through the comparison of training experimental data, the intelligent auxiliary training system constructed in this paper can improve the physical quality level of young athletes and help them improve their sports skills.\n\n2. Artificial Intelligence Technology and Auxiliary Training Method of Physical Fitness\n\n2.1. Motion Recognition Algorithm\n\n2.1.1. Bone Data Filtering\nThe basic data of motion recognition is the joint data provided by the bone tracking system, but most of the joint data returned by the bone tracking system will have some noise. So, it is necessary to denoise and filter the data. Bone data belongs to time series data, there will be a certain time interval between each frame data, and the joint position data will have a jump change [7]. There will be noise and peak tip in time series, so the filtering method is needed to smooth the data.\nThe data filter of joint position can eliminate unnecessary noise and jitter, obtain smooth and accurate joint position data, and avoid the phenomenon of data delay. If the difference between the input data and the output data of the filter is less than the threshold, the filtered output is equivalent to the input [8]. Otherwise, the output change will be limited. The jitter filter variant of exponential filter can be used to suppress the input change, as shown inwhere is the threshold. In addition, the median filter can eliminate the peak, and the median can limit the change of input, as shown inwhere is the median value of the last input data. The data filtered by jitter clearing can be processed by using double exponential smoothing filter. The double exponential smoothing filter, as shown in (3) and (4), respectively, corresponds to the trend of input data and the filtered smoothing output:where are parameters that control the weight of input data. Bone data will become smoother after filtering peak tip and noise, and the data will be more accurate in describing bone features.\n\n2.1.2. Finite State Machine Based on Bone Spatial Features\nIn the past, the traditional analytic geometry method was always used to calculate the angle of three-dimensional space, but this method needs to consider the boundary conditions, so the calculation is very complex. The space vector rule does not need to consider the boundary conditions, first maps the space coordinate system to the conventional mathematical coordinate system, and uses the vector method [9]. The coordinates of two points are respectively, so the transformation of vector is shown in\nThe vectors between the joints of the human body can be transformed in the above way. By calculating the angle between the two vectors, the angle between the joints can be obtained. Using the space vector method, we can extract the spatial features of bones and use them as the state description of creating the finite state machine, which can achieve more accurate and complete motion recognition [10].\nThe function of FSM is to describe the state sequence of the target in the period and the influence of external events on the state sequence. The main characteristics of FSM are the discreteness and finiteness of states, which are widely used in modeling. The components of FSM include state, transition, detector, and event [11]. When the transition condition is satisfied, the state will change, and the detector will detect the state transition condition in real time.\n\n2.1.3. Dynamic Time Warping\nBased on the idea of dynamic programming, dynamic time warping (DTW) measures the similarity of two discrete time series to find the minimum matching path [12]. The reference templates of two time series are given as follows:where represents the timing label of the reference template and the timing label of the test template , respectively. The distance between the corresponding points of two sequences can be calculated by Euclidean distance, as shown in\nDynamic programming is based on the local optimal path to achieve the global optimal path. The th element of regular path is defined as follows:\nRegular paths need to satisfy the constraints of boundary conditions, monotonicity, and continuity. When the constraint conditions are satisfied, the path with the least cost of regularization is selected, and the calculation is shown in\nAccording to the set value, from the matching similarity of the current node and the maximum similarity of the direct cumulative similarity, the formula of the regular path is as follows:\n\n2.2. Human Pose Estimation Algorithm\n\n2.2.1. Human Pose Estimation Based on Model\nIn the model-based human pose estimation method, the joint tree or other complex model of the human object is established first, and then, the parameters of human activity are obtained to realize the estimation of human pose. The preparation stage of model-based human pose estimation is to build a human model based on prior knowledge, so as to effectively constrain the feature change space, improve the computational efficiency, and further narrow the search range of matching [13]. The skeleton model is the simplest one in the human body structure model. The joints are represented by points and the bones are represented by line segments, as shown in Figure 1.","authors":["Cong Du"],"meta":["March 2021Mathematical Problems in Engineering 2021(2):1-10","DOI:10.1155/2021/5526509"],"references":["345204659_The_Construction_of_Builder_Safety_Supervision_System_Based_on_CPS","343924472_Research_on_core_strength_training_of_aerobics_based_on_artificial_intelligence_and_sensor_network","331836637_A_Multi-Agent_Based_Intelligent_Training_System_for_Unmanned_Surface_Vehicles","327569853_Dynamic_hand_gesture_recognition_using_motion_pattern_and_shape_descriptors","347335593_Theoretical_aspects_of_professionally_applied_physical_training_of_rescuers_of_the_Ministry_of_Emergencies_of_Belarus","342564094_Professional_education_of_teachers_in_physical_training_and_health_the_experience_of_Denmark","339343461_Yoga_for_anxiety_and_depression_-_a_literature_review","330758568_Effects_of_Twisting_Training_on_Middle-Aged_Normal_Weight_Obese_Women","326742898_Artificial_intelligence_for_fault_diagnosis_of_rotating_machinery_A_review","324789108_An_interview_with_Dr_Raj_Reddy_on_artificial_intelligence"]}