{"id":"350081492_Hyper-optimized_tensor_network_contraction","abstract":"Tensor networks represent the state-of-the-art in computational methods across many disciplines, including the classical simulation of quantum many-body systems and quantum circuits. Several applications of current interest give rise to tensor networks with irregular geometries. Finding the best possible contraction path for such networks is a central problem, with an exponential effect on computation time and memory footprint. In this work, we implement new randomized protocols that find very high quality contraction paths for arbitrary and large tensor networks. We test our methods on a variety of benchmarks, including the random quantum circuit instances recently implemented on Google quantum chips. We find that the paths obtained can be very close to optimal, and often many orders or magnitude better than the most established approaches. As different underlying geometries suit different methods, we also introduce a hyper-optimization approach, where both the method applied and its algorithmic parameters are tuned during the path finding. The increase in quality of contraction schemes found has significant practical implications for the simulation of quantum many-body systems and particularly for the benchmarking of new quantum chips. Concretely, we estimate a speed-up of over 10,000 × compared to the original expectation for the classical simulation of the Sycamore `supremacy' circuits.","authors":["Johnnie Gray","Stefanos Kourtis"],"meta":["March 2021Quantum 5:410","DOI:10.22331/q-2021-03-15-410"],"references":["337197649_Fast_counting_with_tensor_networks","337015909_General-Purpose_Quantum_Circuit_Simulator_with_Projected_Entangled-Pair_States_and_the_Quantum_Supremacy_Frontier","336744162_Quantum_supremacy_using_a_programmable_superconducting_processor","336379581_A_flexible_high-performance_simulator_for_verifying_and_benchmarking_quantum_circuits_implemented_on_real_hardware","333332570_Insights_on_the_Multifunctional_Activities_of_Magnolol","329764011_Benchmarking_treewidth_as_a_practical_component_of_tensor_network_simulations","342540784_ADDMC_Weighted_Model_Counting_with_Algebraic_Decision_Diagrams","339858872_Establishing_the_quantum_supremacy_frontier_with_a_281_Pflops_simulation","335706396_Evaluating_the_Jones_polynomial_with_tensor_networks","329773531_Extensible_open_source_library_for_AutoML"]}