{"id":"350022734_From_rumor_to_genetic_mutation_detection_with_explanations_a_GAN_approach","abstract":"Social media have emerged as increasingly popular means and environments for information gathering and propagation. This vigorous growth of social media contributed not only to a pandemic (fast-spreading and far-reaching) of rumors and misinformation, but also to an urgent need for text-based rumor detection strategies. To speed up the detection of misinformation, traditional rumor detection methods based on hand-crafted feature selection need to be replaced by automatic artificial intelligence (AI) approaches. AI decision making systems require to provide explanations in order to assure users of their trustworthiness. Inspired by the thriving development of generative adversarial networks (GANs) on text applications, we propose a GAN-based layered model for rumor detection with explanations. To demonstrate the universality of the proposed approach, we demonstrate its benefits on a gene classification with mutation detection case study. Similarly to the rumor detection, the gene classification can also be formulated as a text-based classification problem. Unlike fake news detection that needs a previously collected verified news database, our model provides explanations in rumor detection based on tweet-level texts only without referring to a verified news database. The layered structure of both generative and discriminative models contributes to the outstanding performance. The layered generators produce rumors by intelligently inserting controversial information in non-rumors, and force the layered discriminators to detect detailed glitches and deduce exactly which parts in the sentence are problematic. On average, in the rumor detection task, our proposed model outperforms state-of-the-art baselines on PHEME dataset by 26.85% in terms of macro-f1. The excellent performance of our model for textural sequences is also demonstrated by the gene mutation case study on which it achieves 72.69% macro-f1 score.","authors":["Mingxi Cheng","Yizhi Li","Shahin Nazarian","Paul Bogdan"],"meta":["March 2021Scientific Reports 11(1):5861","DOI:10.1038/s41598-021-84993-1"],"references":["345997561_Photon-directed_multiplexed_enzymatic_DNA_synthesis_for_molecular_digital_data_storage","341128443_VRoC_Variational_Autoencoder-aided_Multi-task_Rumor_Classifier_Based_on_Text","340510494_DNA_punch_cards_for_storing_data_on_native_DNA_sequences_via_enzymatic_nicking","340107639_The_Limitations_of_Stylometry_for_Detecting_Machine-Generated_Fake_News","339393551_Photon-directed_Multiplexed_Enzymatic_DNA_Synthesis_for_Molecular_Digital_Data_Storage","338855639_Topology_comparison_of_Twitter_diffusion_networks_effectively_reveals_misleading_information","335708803_Data_storage_in_DNA_with_fewer_synthesis_cycles_using_composite_DNA_letters","333994402_Fake_news_game_confers_psychological_resistance_against_online_misinformation","332864316_dEFEND_Explainable_Fake_News_Detection","333067549_XFake_Explainable_Fake_News_Detector_with_Visualizations"]}