{"id":"350149895_An_Efficient_Method_for_Modeling_Nonoccurring_Behaviors_by_Negative_Sequential_Patterns_With_Loose_Constraints","abstract":"The sequence analysis handles sequential discrete events and behaviors, which can be represented by temporal point processes (TPPs). However, TPP models only occurring events and behaviors. This article explores an efficient method for the negative sequential pattern (NSP) mining to leverage TPP in modeling both frequently occurring and nonoccurring events and behaviors. NSP mining is good at the challenging \\ modeling of nonoccurrences of events and behaviors and their combinations with occurring events, with existing methods built on incorporating various constraints into NSP representations, e.g., simplifying NSP formulations and reducing computational costs. Such constraints restrict the flexibility of NSPs, and nonoccurring behaviors (NOBs) cannot be comprehensively exposed. This article addresses this issue by loosening some inflexible constraints in NSP mining and solves a series of consequent challenges. First, we provide a new definition of negative containment with the set theory according to the loose constraints. Second, an efficient method quickly calculates the supports of negative sequences. Our method only uses the information about the corresponding positive sequential patterns (PSPs) and avoids additional database scans. Finally, a novel and efficient algorithm, NegI-NSP, is proposed to efficiently identify highly valuable NSPs. Theoretical analyses, comparisons, and experiments on four synthetic and two real-life data sets clearly show that NegI-NSP can efficiently discover more useful NOBs.","authors":["Ping Qiu","Yongshun Gong","Yuhai Zhao","Longbing Cao"],"meta":["March 2021IEEE Transactions on Neural Networks and Learning Systems PP(99):1-15","DOI:10.1109/TNNLS.2021.3063162"],"references":["331028712_Mining_negative_sequential_patterns_from_infrequent_positive_sequences_with_2-level_multiple_minimum_supports","331026480_Mining_negative_sequential_patterns_from_frequent_and_infrequent_sequences_based_on_multiple_level_minimum_supports","328110471_e-RNSP_An_Efficient_Method_for_Mining_Repetition_Negative_Sequential_Patterns","326202458_Learning_Sequential_Correlation_for_User_Generated_Textual_Content_Popularity_Prediction","352834693_On_Mining_Progressive_Positive_and_Negative_Sequential_Patterns_Simultaneously","349539293_Interactive_Sequential_Basket_Recommendation_by_Learning_Basket_Couplings_and_PositiveNegative_Feedback","334888973_An_Efficient_Method_for_Pruning_Redundant_Negative_and_Positive_Association_Rules","332066719_Negative_Sequence_Analysis_A_Review","330597631_Learning_Time_Series_Associated_Event_Sequences_With_Recurrent_Point_Process_Networks","330296199_Mining_Top-k_Useful_Negative_Sequential_Patterns_via_Learning"]}