{"id":"350149094_Student-centered_learning_models_and_learning_outcomes_meta-analysis_and_effect_sizes_on_the_students'_thesis","abstract":"A meta-analysis of students’ thesis is very necessary to improve the quality of research in maintaining the consistency and scientific truth justification of the theory. This study aims to (i) obtain an effect-size estimation, which is the strength of the relationship between the variables studied in a quasi-experimental study; (ii) describe the effectiveness of student-centered learning models compared to teacher-centered learning on learning outcomes; (iii) describe the conditions that affect the effectiveness of the student-centered learning models in the final assignments of students of Informatics Engineering, Universitas Pendidikan Ganesha. In order to achieve this goal, 22 students’ final assignments were reviewed as research samples. The study focused on two things, namely, (a) calculating the effect size of each sample of the theses; (b) examining the theoretical and empirical justification used to discuss the acceptance of the hypothesis. Statistical analysis techniques were used to determine the value of the effect size. The results showed, the effect-size value for the entire sample was 1.109 in the high category. Then, the results of the study of the t value for all the thesis studied showed all t-count values were greater than t-table values at a significant level of 0.05. It means student-centered learning models are better than teacher-centered learning models on the learning outcome variables studied.","authors":["Ketut Agustini","Dani Wahyuni","I N E Mertayasa","N K Wedhanti"],"meta":["March 2021Journal of Physics Conference Series 1810(1):012049","DOI:10.1088/1742-6596/1810/1/012049"],"references":["341938303_Analysis_on_vocational_high_school_teacher_competency_gaps_implication_for_VHS_teacher_training_needs","341936597_Development_of_mathematics_interactive_learning_media_with_gamification_concept_for_mentally_disabled_students","337711372_Analysis_of_Competence_on_TPACK_21st_Century_Teacher_Professional_Development","336124201_Peer_tutoring_and_mathematics_in_secondary_education_literature_review_effect_sizes_moderators_and_implications_for_practice","322870235_EFFECT_OF_MOTIVATIONAL_SCAFFOLDING_ON_E-LEARNING_ENVIRONMENTS_SELF-EFFICACY_LEARNING_ACHIEVEMENT_AND_COGNITIVE_STYLE","322763097_The_Effect_of_Various_Media_Scaffolding_on_Increasing_Understanding_of_Students'_Geometry_Concepts","319880112_Learning_design_as_a_vehicle_for_developing_TPACK_in_blended_teacher_training_on_technology_enhanced_learning","287857257_Piaget_and_Affectivity","285886015_The_Technological_Pedagogical_Content_Knowledge_Framework","281234765_The_Effect_of_Project-Based_Learning_on_Learning_Motivation_and_Problem-Solving_Ability_of_Vocational_High_School_Students"]}