{"id":"350108772_Identification_of_nodes_influence_based_on_global_structure_model_in_complex_networks","abstract":"Identification of Influential nodes in complex networks is challenging due to the largely scaled data and network sizes, and frequently changing behaviors of the current topologies. Various application\nscenarios like disease transmission and immunization, software virus infection and disinfection, increased product exposure and rumor suppression, etc., are applicable domains in the corresponding\nnetworks where identification of influential nodes is crucial. Though a lot of approaches are proposed to address the challenges, most of the relevant research concentrates only on single and limited\naspects of the problem. Therefore, we propose Global Structure Model (GSM) for influential nodes identification that considers self-influence as well as emphasizes on global influence of the node in the\nnetwork. We applied GSM and utilized Susceptible Infected Recovered model to evaluate its efficiency. Moreover, various standard algorithms such as Betweenness Centrality, Profit Leader, H-Index,\nCloseness Centrality, Hyperlink Induced Topic Search, Improved K-shell Hybrid, Density Centrality, Extended Cluster Coefficient Ranking Measure, and Gravity Index Centrality are employed as baseline\nbenchmarks to evaluate the performance of GSM. Similarly, we used seven real-world and two synthetic multi-typed complex networks along-with different well-known datasets for experiments.\nResults analysis indicates that GSM outperformed the baseline algorithms in identification of influential node(s).","authors":["Aman Ullah","Bin Wang","Jinfang Sheng","Jun Long"],"meta":["March 2021Scientific Reports 11(1)","DOI:10.1038/s41598-021-84684-x"],"references":["341208114_Analysis_and_comparison_of_centrality_measures_applied_to_urban_networks_with_data","339419387_Influential_Nodes_Identification_in_Complex_Networks_via_Information_Entropy","339194840_Identifying_Key_Nodes_in_Complex_Networks_Based_on_Global_Structure","338465695_Critical_Nodes_Identification_in_Complex_Networks","343130854_InfGCN_Identifying_Influential_Nodes_in_Complex_Networks_with_Graph_Convolutional_Networks","341682056_Influential_nodes_identification_in_complex_networks_based_on_global_and_local_information","338917916_Finding_influential_nodes_in_social_networks_based_on_neighborhood_correlation_coefficient","337356265_Influential_Spreaders_Identification_in_Complex_Networks_with_Improved_k-shell_Hybrid_Method","336993101_Identifying_influential_nodes_in_complex_networks_based_on_global_and_local_structure","335969050_Identification_of_influential_users_in_Social_Network_Using_Grey_Wolf_Optimization_Algorithm"]}