{"id":"350148801_Robust_Collaborative_Filtering_Recommendation_With_User-Item-Trust_Records","abstract":"The ever-increasing popularity of recommendation systems allows users to find appropriate services without excessive effort. However, due to the unstable and complex network environment, the historical behavior data of users are quite sparse in most cases. The inherent drawbacks render preference prediction infeasible for cold-start users and have become a crucial issue to be resolved in recommendation systems. To deal with the problems, we first present a Trust-based Collaborative Filtering (TbCF) algorithm to perform basic rating prediction in a manner consistent with the existing CF methods. Then, we propose the Hybrid Collaborative Filtering Recommendation approach with User-Item-Trust Records (UIThybrid), a novel approach that incorporates user trust into the existing CF-based methods in a harmonious way to supplement rating information. UIThybrid employs multiple perspectives to extract proper services and achieves a good tradeoff between the robustness, accuracy, and diversity of the recommendation. We conduct extensive real-world experiments on the Epinions data set to demonstrate the feasibility and efficiency of UIThybrid.","authors":["Fan Wang","Haibin Zhu","Gautam Srivastava","Shancang Li"],"meta":["March 2021IEEE Transactions on Computational Social Systems PP(99):1-11","DOI:10.1109/TCSS.2021.3064213"],"references":["340221273_Community-diversified_influence_maximization_in_social_networks","339753705_Modeling_Methodology_for_Early_Warning_of_Chronic_Heart_Failure_Based_on_Real_Medical_Big_Data","339482375_Data-Driven_Web_APIs_Recommendation_for_Building_Web_Applications","348717502_A_two-stage_privacy_protection_mechanism_based_on_blockchain_in_mobile_crowdsourcing","343716136_Privacy-preserving_quality_prediction_for_edge-based_IoT_services","342539890_A_Blockchain-Enabled_Deduplicatable_Data_Auditing_Mechanism_for_Network_Storage_Services","342254351_Target-aware_Holistic_Influence_Maximization_in_Spatial_Social_Networks","340860332_Privacy_Protection_Based_on_Stream_Cipher_for_Spatiotemporal_Data_in_IoT","340669516_Multi-dimensional_quality-driven_service_recommendation_with_privacy-preservation_in_mobile_edge_environment","339252396_A_worker-selection_incentive_mechanism_for_optimizing_platform-centric_mobile_crowdsourcing_systems"]}