{"id":"350171249_One-dimensional_Service_Networks_and_Batch_Service_Queues","abstract":"A proliferation of smart devices, computational and storage resources is predicted to continue aggressively in the near future. Such \"networked\" devices and resources which are distributed in a physical space and provide services are collectively referred to as a distributed service network. Assigning users or applications to available resources is important to sustain high performance of the distributed service network. In this work, we consider a one-dimensional service network where both users and resources are located on a line, and analyze a unidirectional assignment policy Move To Right (MTR), which sequentially assigns users to resources available to their right. We express the communication cost for a user-resource assignment as an increasing function of the distance traveled by the user request (request distance) and analyze the expected communication cost for the service network when locations of users and resources are modeled by different spatial point processes. We use results from literature that map the request distance of an assigned user in a one-dimensional service network to the sojourn time of a customer in an exceptional service accessible batch queueing system. We compute the Laplace-Stieltjes transform of the sojourn time distribution for this queueing system for Poisson distributed users with general inter-resource distance distributions and in the process also generate new results for batch service queues. Unlike previous work [31] our framework not only captures the first-order moment of the request distance, but also the request distance distribution itself, thus allowing us to compute the expected communication cost under different cost models.","authors":["Philippe Nain","Nitish Kumar Panigrahy","Prithwish Basu","Don Towsley"],"meta":["June 2021Queueing Systems 98(10)","DOI:10.1007/s11134-021-09703-0"],"references":["341826924_Resource_allocation_in_one-dimensional_distributed_service_networks","336189757_Resource_Allocation_in_One-Dimensional_Distributed_Service_Networks","329476921_On_Queueing_Processes_with_Bulk_Service","320441813_Stable_Matchings_in_Metric_Spaces_Modeling_Real-World_Preferences_using_Proximity","318284909_ON_MG1_QUEUES_WITH_THE_FIRST_N_CUSTOMERS_OF_EACH_BUSY_PERIOD_RECEIVING_EXCEPTIONAL_SERVICES","316692582_Mathematical_Methods_for_Physicists","305979504_On_the_busy_period_of_the_modified_GIG1_queue","278996963_GEOMETRY_HELPS_IN_MATCHING","267055858_Waiting_Time_in_Bulk_Service_Queues","266986884_On_the_Busy_Period_of_the_Modified_GIG1_Queue","263224301_On_MG1_Queues_with_the_First_N_Customers_of_Each_Busy_Period_Receiving_Exceptional_Services","261588121_A_renewal_input_single_and_batch_service_queues_with_accessibility_to_batches","260356200_A_study_on_one-dimensional_k-coverage_problem_in_wireless_sensor_networks","256936140_Discrete-time_bulk-service_queues_with_accessible_and_non-accessible_batches","256590425_The_moment_generating_function_has_its_moments"]}