{"id":"350126769_A_Structural_Entropy_Measurement_Principle_of_Propositional_Formulas_in_Conjunctive_Normal_Form","abstract":"The satisfiability (SAT) problem is a core problem in computer science. Existing studies have shown that most industrial SAT instances can be effectively solved by modern SAT solvers while random SAT instances cannot. It is believed that the structural characteristics of different SAT formula classes are the reasons behind this difference. In this paper, we study the structural properties of propositional formulas in conjunctive normal form (CNF) by the principle of structural entropy of formulas. First, we used structural entropy to measure the complex structure of a formula and found that the difficulty solving the formula is related to the structural entropy of the formula. The smaller the compressing information of a formula, the more difficult it is to solve the formula. Secondly, we proposed a λ-approximation strategy to approximate the structural entropy of large formulas. The experimental results showed that the proposed strategy can effectively approximate the structural entropy of the original formula and that the approximation ratio is more than 92%. Finally, we analyzed the structural properties of a formula in the solution process and found that a local search solver tends to select variables in different communities to perform the next round of searches during a search and that the structural entropy of a variable affects the probability of the variable being flipped. By using these conclusions, we also proposed an initial candidate solution generation strategy for a local search for SAT, and the experimental results showed that this strategy effectively improves the performance of the solvers CCAsat and Sparrow2011 when incorporated into these two solvers.","authors":["Zaijun Zhang","Daoyun Xu","Jincheng Zhou"],"meta":["March 2021Entropy 23(3):303","DOI:10.3390/e23030303"],"references":["327041723_Decoding_topologically_associating_domains_with_ultra-low_resolution_Hi-C_data_by_graph_structural_entropy","318829593_Locality_in_Random_SAT_Instances","303921824_Community_Structure_in_Industrial_SAT_Instances","293012167_Three-Dimensional_Gene_Map_of_Cancer_Cell_Types_Structural_Entropy_Minimisation_Principle_for_Defining_Tumour_Subtypes","281317160_SATGraf_Visualizing_the_Evolution_of_SAT_Formula_Structure_in_Solvers","308578861_Resistance_maximisation_principle_for_defending_networks_against_virus_attack","303846486_Generating_SAT_instances_with_community_structure","301579857_Structural_Information_and_Dynamical_Complexity_of_Networks","276465677_Discovering_natural_communities_in_networks","266966129_Community_Branching_for_Parallel_Portfolio_SAT_Solvers"]}