{"id":"350206568_Is_Digital_Twin_Technology_Supporting_Safety_Management_A_Bibliometric_and_Systematic_Review","abstract":"In the Industry 4.0 era, digital tools applied to production and manufacturing activities represent a challenge for companies. Digital Twin (DT) technology is based on the integration of different “traditional” tools, such as simulation modeling and sensors, and is aimed at increasing process performance. In DTs, simulation modeling allows for the building of a digital copy of real processes, which is dynamically updated through data derived from smart objects based on sensor technologies. The use of DT within manufacturing activities is constantly increasing, as DTs are being applied in different areas, from the design phase to the operational ones. This study aims to analyze existing fields of applications of DTs for supporting safety management processes in order to evaluate the current state of the art. A bibliometric review was carried out through VOSviewer to evaluate studies and applications of DTs in the engineering and computer science areas and to identify research clusters and future trends. Next, a bibliometric and systematic review was carried out to deepen the relation between the DT approach and safety issues. The findings highlight that in recent years, DT applications have been tested and developed to support operators during normal and emergency conditions and to enhance their abilities to control safety levels.","authors":["Giulio Paolo Agnusdei","Valerio Elia","Maria Grazia Gnoni"],"meta":["March 2021Applied Sciences 11(6):2767","DOI:10.3390/app11062767"],"references":["348771602_Developing_a_Digital_Twin_and_Digital_Thread_Framework_for_an_'Industry_40'_Shipyard","347113169_Modeling_and_Simulation_of_a_Flexible_Manufacturing_System-A_Basic_Component_of_Industry_40","345167903_Digital_Twin_for_Monitoring_Ergonomics_during_Manufacturing_Production","344428957_Digital_Twin_and_Internet_of_Things-Current_Standards_Landscape","348710195_A_classification_proposal_of_digital_twin_applications_in_the_safety_domain","348468204_Digital_Twin_for_Legal_Requirements_in_Production_and_Logistics_based_on_the_Example_of_the_Storage_of_Hazardous_Substances","348288929_Improving_maintenance_efficiency_and_safety_through_a_human-centric_approach","346259607_Safety_intelligence_as_an_essential_perspective_for_safety_management_in_the_era_of_Safety_40_From_a_theoretical_to_a_practical_framework","345086082_A_digital_twin_model_of_a_pasteurization_system_for_food_beverages_tools_and_architecture","344635115_A_digital_twin_framework_for_machine_learning_optimization_of_aerial_fire_fighting_and_pilot_safety"]}