{"id":"350278548_Elektronno_obucenie_v_usloviata_na_pandemia_blgarskiat_i_latvijskiat_opit_vv_visseto_obrazovanie_E-Learning_In_A_Pandemic_The_Bulgarian_And_Latvian_Experience_In_Higher_Education","abstract":"Пандемията от 2020 г. засегна всички области от живота, като образованието несъмнено е една от тях. В първите месеци на социална дистанция преподавателите и обучаемите бяха изправени пред предизвикателството да общуват виртуално, в много ситуации асинхронно. Традиционните методи на преподаване бяха трансформирани в дигитално ориентирани, което постави и двете страни извън техните граници на комфорт. Процесът на обучение се провеждаше изцяло в електронна среда, която трябваше да бъде организирана така, че\nвсички обучаеми да получат достъп до предоставяните материали. Целта на статията е да проучи опита, натрупан от обучението в електронна среда в условия на социална дистанция в университети в България и Латвия. На тази основа да се очертае практически приложима рамка за електронно обучение. Като част от нашето изследване анкетирахме студенти по информатика и компютърни науки, за да проучим предизвикателствата, пред които бяха са изправени в първите месеци на социална дистанция.\n\nThe 2020 pandemic has affected all areas of life, and education is undoubtedly one of them. In the first months of social distance, lecturers and learners faced the challenge of communicating virtually, in many situations asynchronously. Traditional teaching methods\nhave been transformed into digitally oriented, which has put both sides beyond their comfort limits. The learning process was conducted entirely in an electronic environment, which had to be organized so that all learners had access to the materials provided. The aim of our article is to study the experience gained from e-learning in lockdown conditions at universities in Bulgaria and Latvia. On this basis, we outlined a practical e-learning framework. As part of our study, we surveyed computer science students to examine the challenges they face in the first months of lockdown.","authors":["Radka Nacheva","Anita Jansone"],"meta":["December 2020"],"references":["340535196_The_Difference_Between_Emergency_Remote_Teaching_and_Online_Learning","335900695_Approach_for_social_media_content-based_analysis_for_vacation_resorts","272909459_Strategic_HR_in_Higher_Educational_Institutions_in_Malaysia_and_Denmark","328368661_STUDENTS'_ADAPTATION_IN_MULTICULTURAL_ENVIRONMENT"]}