{"id":"350210999_The_use_of_online_coding_platforms_as_additional_distance_tools_in_programming_education","abstract":"This study analyzes various publications of scientists on the training of future IT specialists and the features of training programming using online simulators. The authors of the article made a comparative description of different online platforms for teaching programming according to certain criteria, selected interesting tasks from the online platform hackerrank.com, which have already been used to teach students. Online programming simulators have significant potential in organizing an effective distance learning system in Ukrainian universities. It is important to use online simulators in the learning process as an additional tool for the formation of professional competencies, which provides more intensive involvement of students in the process of writing code and practical (situational) application of existing knowledge. Gamification of the process of training future IT specialists helps to increase cognitive activity, and hence – the quality of the educational process and distance learning in particular. The authors recommend the use of online programming simulators as an additional tool for teaching computer science disciplines, taking into account their functionality, as well as the level of preparation of students and the expected learning outcomes.","authors":["Irina Zinovyeva","Volodymyr Artemchuk","Anna Iatsyshyn","O O Popov"],"meta":["March 2021Journal of Physics Conference Series 1840(1):012029","DOI:10.1088/1742-6596/1840/1/012029"],"references":["348109235_Using_Game_Simulator_Software_Inc_in_the_Software_Engineering_Education","343079778_Application_of_augmented_reality_technologies_for_education_projects_preparation","340834701_Sustainability_in_Software_Engineering_Education_a_case_of_general_professional_competencies","340833368_Our_sustainable_coronavirus_future","340176704_ICHTML_2020_-_How_learning_technology_wins_coronavirus","339944436_Application_of_augmented_reality_technologies_for_preparation_of_specialists_of_new_technological_era","335976959_Informatization_of_education_as_a_pledge_of_the_existence_and_development_of_a_modern_higher_education","334484995_The_use_of_E-olymp_Internet_Portal_in_Programming_Competitions","337324623_Integrating_Professional_Tools_in_Programming_Education_with_MOOCs","326854436_An_Entertaining_Approach_to_Parallel_Programming_Education"]}