{"id":"350286372_hmayt_alhyat_alshkhsyt_llaml_fy_zl_ttwr_wsayl_alatsal_alhdytht_-_drast_mqarnt_byn_alqanwn_alamaraty_walqanwn_alfrnsy","abstract":"The concept of privacy has evolved a lot due to the tremendous scientific development that humanity has achieved in recent decades. The massive use of computers and the Internet in all areas has given rise to new aspects of privacy. This concept now concerns calls, personal photos, recordings, the use of social networks and personal conversations. Through this research, we want to inform the reader about the rules governing the protection of the privacy of an employee in the field of computer science in the light of the legal texts applied in UAE laws, or at least clarify the positions of French law and the judicial authority in this regard, especially since they have made significant progress in this area. Failure to respect the sanctity of privacy in modern areas of communication goes beyond the traditional problems that dealt with the sanctity of privacy. These legal studies and legal scientific theses focused mainly on the classic concept of the right to private life of an employee, and very few of them highlighted the lack of respect for the employee's privacy when using computer tools at work. The technological revolution has allowed the emergence of new forms that violate the privacy of the employee in our Arab societies and which deserve to be clarified. Through this research, we want to know the obligations of the employer when monitoring its employees especially when this monitoring affects the work tools and the use of employees of the Internet. We also want to identify cases in which an employee is considered to be beyond the scope of his or her work privacy to the point of harming the employer. Thus, cases where the employer has the right to dismiss the employee because of a serious fault. We believe that the absence of special legal texts that govern these issues demonstrates a profound legal vacuum in these areas.","authors":["Pierre Mallet"],"meta":["March 2021مجلة الشريعة و القانون 2021(85):3"],"references":["313504493_La_vie_privee_en_droit_du_travail","269824677_Preuve_et_surveillance_des_salaries_regard_francais"]}