{"id":"350384776_Identification_of_Student_Academic_Performance_in_Computer_Science_Based_on_Naive_Bayes","abstract":"Jurusan Teknik Informatika is one of the study programs at UIN Maulana Malik Ibrahim. Based on the current curriculum in Jurusan Teknik Informatika, the curriculum refers to the IEEE/ACM Computer Science Curricula 2013. The IEEE/ACM Computer Science Curricula 2013 has a knowledge area classification, which is mentioned in the curriculum as having 18 knowledge areas. The curriculum used in the current technical study program is formulated and determined from the entire content or collection of knowledge in the IEEE/ACM Computer Science Curricula 2013. In the Jurusan Teknik Informatika curriculum at UIN Malik Ibrahim Malang currently there are 76 subjects, 58 of which are Teknik Informatika subjects and 18 others are general subjects. To identify the academic performance of students it is necessary to classify the curriculum in the Department of Informatics Engineering to the knowledge area in the IEEE / ACM Computer Science Curricula 2013. Classification is done using the Naïve Bayes method by calculating the probability of each course of the knowledge area, after it is done classification, data will appear in the form of subject distribution to the knowledge area. After classification, it is necessary to determine the level of contribution of each course that has spread to the knowledge area. This contribution level is entered into the Joint formula with the value of the student transcript to calculate the student's academic performance. Testing is done by comparing the output in the form of knowledge area with the highest performance produced by the program with input in the form of knowledge area from the expert for each student. This research resulted in an accuracy of 78.95% from the results of twenty times experiment.","authors":["Kevin Elmy Aziz","Cahyo Crysdian","Mochamad Imamudin"],"meta":["March 2021MATICS 13(1):33-41","DOI:10.18860/mat.v13i1.9726"],"references":["322959527_Analisis_Sentimen_Pariwisata_di_Kota_Malang_Menggunakan_Metode_Naive_Bayes_dan_Seleksi_Fitur_Query_Expansion_Ranking","322433862_Stock_Market_Classification_Model_Using_Sentiment_Analysis_on_Twitter_Based_on_Hybrid_Naive_Bayes_Classifiers","334091083_Klasifikasi_Text_Mining_Review_Produk_Kosmetik_Untuk_Teks_Bahasa_Indonesia_Menggunakan_Algoritma_Naive_Bayes","313085177_Feature_selection_for_text_classification_with_Naive_Bayes","296693593_Deep_feature_weighting_for_naive_Bayes_and_its_application_to_text_classification"]}