{"id":"350385199_Undergraduate_data_science_degrees_emphasize_computer_science_and_statistics_but_fall_short_in_ethics_training_and_domain-specific_context","abstract":"The interdisciplinary field of data science, which applies techniques from computer science and statistics to address questions across domains, has enjoyed recent considerable growth and interest. This emergence also extends to undergraduate education, whereby a growing number of institutions now offer degree programs in data science. However, there is considerable variation in what the field actually entails and, by extension, differences in how undergraduate programs prepare students for data-intensive careers. We used two seminal frameworks for data science education to evaluate undergraduate data science programs at a subset of 4-year institutions in the United States; developing and applying a rubric, we assessed how well each program met the guidelines of each of the frameworks. Most programs scored high in statistics and computer science and low in domain-specific education, ethics, and areas of communication. Moreover, the academic unit administering the degree program significantly influenced the course-load distribution of computer science and statistics/mathematics courses. We conclude that current data science undergraduate programs provide solid grounding in computational and statistical approaches, yet may not deliver sufficient context in terms of domain knowledge and ethical considerations necessary for appropriate data science applications. Additional refinement of the expectations for undergraduate data science education is warranted.","authors":["Jeffrey C. Oliver","Torbet McNeil"],"meta":["March 2021PeerJ Computer Science 7(1):e441","DOI:10.7717/peerj-cs.441"],"references":["337435367_Welcome_to_the_Tidyverse","312178787_Curriculum_Guidelines_for_Undergraduate_Programs_in_Data_Science","338959455_The_Role_of_Academia_in_Data_Science_Education","336974968_What_Does_It_Take_to_be_a_Successful_Data_Scientist","336791156_Dissecting_racial_bias_in_an_algorithm_used_to_manage_the_health_of_populations","323324956_Key_Concepts_for_a_Data_Science_Ethics_Curriculum","321927669_50_Years_of_Data_Science","317163533_Data_analytics_vs_data_science_A_study_of_similarities_and_differences_in_undergraduate_programs_based_on_course_descriptions","309095411_To_predict_and_serve","305791185_Data_science_programs_in_US_higher_education_An_exploratory_content_analysis_of_program_description_curriculum_structure_and_course_focus"]}