{"id":"350361329_The_Economic_and_Environmental_Impact_of_Bitcoin","abstract":"The controversies surrounding Bitcoin, one of the most frequently used and advertised cryptocurrency, are focused on identifying its qualities, the advantages and disadvantages of using it and, last but not least, its ability to survive over time and become a viable alternative to the traditional currency, taking into account the effects on the environment of the technology used to extract and trade it. Based on such considerations, this article aims to provide an overview of this cryptocurrency, from the perspective of conducting a systematic review of the literature dedicated to the economic and environmental impact of Bitcoin. Using peer-reviewed articles collected from academic databases, we aimed at synthesizing and critically evaluating the points of view in the scientific literature regarding the doctrinal source of the emergence of Bitcoin, the identity of this cryptocurrency from an economic point of view, following its implications on the economic and social environment. Subsequently, this research offers the opportunity of evaluating the level of knowledge considering the impact of Bitcoin mining process on the environment from the perspective of the energy consumption and CO2 emissions, in order to finally analyze Bitcoin regulation and identify possible solutions to reduce the negative impact on the environment and beyond. The findings suggest that, despite high energy consumption and adverse environmental impact, Bitcoin continues to be an instrument used in the economic environment for a variety of purposes. Moreover, the trend of regulating it in various countries shows that the use of Bitcoin is beginning to gain some legitimacy, despite criticism against this cryptocurrency.","authors":["Liana Badea","Mungiu-Pupãzan Mariana Claudia"],"meta":["March 2021IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2021.3068636"],"references":["337635881_Global_Cooling_Through_Blockchain_to_Avoid_Catastrophic_Climate_Changes_by_2050","337575342_Impact_of_Sustainable_Financial_and_Economic_Development_on_Greenhouse_Gas_Emission_in_the_Developed_and_Converging_Economies","335456595_Implausible_projections_overestimate_near-term_Bitcoin_CO_2_emissions","344073839_6_MONEY_AND_THE_MECHANISM_OF_EXCHANGE","343402945_Bitcoin's_energy_consumption_is_underestimated_A_market_dynamics_approach","341346272_Economic_viability_of_bitcoin_mining_using_a_renewable-based_SOFC_power_system_to_supply_the_electrical_power_demand","337467155_Bitcoin_and_its_mining_on_the_equilibrium_path","335993117_Cryptodamages_Monetary_value_estimates_of_the_air_pollution_and_human_health_impacts_of_cryptocurrency_mining","335474564_Bitcoin_mining_A_global_review_of_energy_and_power_demand","334399024_Bitcoin's_energy_consumption_Is_it_the_Achilles_heel_to_miner's_revenue"]}