{"id":"350312717_DatingSec_Detecting_Malicious_Accounts_in_Dating_Apps_Using_a_Content-Based_Attention_Network","abstract":"Dating apps have gained tremendous popularity during the past decade. Compared with traditional offline dating means, dating apps ease the process of partner finding significantly. While bringing convenience to hundreds of millions of users, dating apps are vulnerable to become targets of adversaries. In this work, we focus on malicious user detection in dating apps. Existing methods overlooked the signals hidden in the textual information of user interactions, particularly the interplay of temporal-spatial behaviors and textual information, leading to limited detection performance. To tackle this, we propose DatingSec, a novel malicious user detection system for dating apps. Concretely, DatingSec leverages long short-term memory neural networks (LSTM) and an attentive module to capture the interplay of users' temporal-spatial behaviors and user-generated textual content. We evaluate DatingSec on a real-world dataset collected from Momo, a widely used dating app with more than 180 million users. Experimental results show that DatingSec outperforms state-of-the-art methods and achieves an F1-score of 0.857 and AUC of 0.940.","authors":["Xinlei He","Qingyuan Gong","Yang Chen","Yang Zhang"],"meta":["March 2021IEEE Transactions on Dependable and Secure Computing PP(99)","DOI:10.1109/TDSC.2021.3068307","Projects: Metaverse and Social Computing and Networking (MSN) InitiativeSocial Networks and Big Data"],"references":["341113341_Understanding_the_User_Behavior_of_Foursquare_A_Data-Driven_Study_on_a_Global_Scale","334619977_Automatically_Dismantling_Online_Dating_Fraud","332584393_BadNets_Evaluating_Backdooring_Attacks_on_Deep_Neural_Networks","332163941_Dating_with_Scambots_Understanding_the_Ecosystem_of_Fraudulent_Dating_Applications","329453198_Graph-based_Security_and_Privacy_Analytics_via_Collective_Classification_with_Joint_Weight_Learning_and_Propagation","356455885_Detecting_AI_Trojans_Using_Meta_Neural_Analysis","348915390_MBeacon_Privacy-Preserving_Beacons_for_DNA_Methylation_Data","343269881_Systematic_Evaluation_of_Backdoor_Data_Poisoning_Attacks_on_Image_Classifiers","337096219_Latent_Backdoor_Attacks_on_Deep_Neural_Networks","335867853_Neural_Cleanse_Identifying_and_Mitigating_Backdoor_Attacks_in_Neural_Networks"]}