{"id":"350365520_Solving_Multi-task_Optimization_Problems_with_Adaptive_Knowledge_Transfer_via_Anomaly_Detection","abstract":"Evolutionary multi-task optimization (EMTO) has recently attracted widespread attention in the evolutionary computation community, which solves two or more tasks simultaneously to improve the convergence characteristics of tasks when individually optimized. Effective knowledge between tasks is transferred by taking advantage of the parallelism of population-based search. Without any prior knowledge about tasks, it is a challenging problem of how to adaptively transfer effective knowledge between tasks and reduce the impact of negative transfer in EMTO. However, these two issues are rarely studied simultaneously in the existing literature. Besides, in complex many-task environments, the potential relationships among individuals from highly diverse populations associated with tasks directly determine the effectiveness of cross-task knowledge transfer. Keeping those in mind, we propose a multi-task evolutionary algorithm based on anomaly detection (MTEA-AD). Specifically, each task is assigned a population and an anomaly detection model. Each anomaly detection model is used to learn the relationship among individuals between the current task and the other tasks online. Individuals that may carry negative knowledge are identified as outliers. And candidate transferred individuals identified by the anomaly detection model are selected to assist the current task, which may carry common knowledge across the current task and other tasks. Furthermore, to realize the adaptive control of the degree of knowledge transfer, the successfully transferred individuals that survive to the next generation through the elitism are used to update the anomaly detection parameter. The fair competition between offspring and candidate transferred individuals can effectively reduce the risk of negative transfer. Finally, the empirical studies on a series of synthetic benchmarks and a practical study are conducted to verify the effectiveness of MTEA-AD. The experimental results demonstrate that our proposal can adaptively adjust the degree of knowledge transfer through the anomaly detection model to achieve highly competitive performance compared to several state-of-the-art EMTO methods.","authors":["Chao Wang","Jing Liu","Kai Wu","Zhaoyang Wu"],"meta":["March 2021IEEE transactions on neural networks / a publication of the IEEE Neural Networks Council PP(99):1-1","DOI:10.1109/TEVC.2021.3068157","Project: Evolutionary Multitasking Optimization"],"references":["342540509_Quality_diversity_for_multi-task_optimization","341096103_A_Unified_Framework_of_Graph-Based_Evolutionary_Multitasking_Hyper-Heuristic","340877599_Cognizant_Multitasking_in_Multiobjective_Multifactorial_Evolution_MO-MFEA-II","339859079_An_Effective_Knowledge_Transfer_Approach_for_Multiobjective_Multitasking_Optimization","339757725_Toward_Adaptive_Knowledge_Transfer_in_Multifactorial_Evolutionary_Computation","339703772_Explicit_Evolutionary_Multitasking_for_Combinatorial_Optimization_A_Case_Study_on_Capacitated_Vehicle_Routing_Problem","339394159_A_Multifactorial_Evolutionary_Algorithm_for_Multitasking_Under_Interval_Uncertainties","338786180_Multitasking_Genetic_Algorithm_MTGA_for_Fuzzy_System_Optimization","338205374_Multi-objective_Multi-tasking_Optimization_Based_on_Incremental_Learning","337704728_Evolutionary_multitasking_fuzzy_cognitive_map_learning"]}