{"id":"350391155_Automated_detection_of_critical_findings_in_multi-parametric_brain_MRI_using_a_system_of_3D_neural_networks","abstract":"With the rapid growth and increasing use of brain MRI, there is an interest in automated image classification to aid human interpretation and improve workflow. We aimed to train a deep convolutional neural network and assess its performance in identifying abnormal brain MRIs and critical intracranial findings including acute infarction, acute hemorrhage and mass effect. A total of 13,215 clinical brain MRI studies were categorized to training (74%), validation (9%), internal testing (8%) and external testing (8%) datasets. Up to eight contrasts were included from each brain MRI and each image volume was reformatted to common resolution to accommodate for differences between scanners. Following reviewing the radiology reports, three neuroradiologists assigned each study to abnormal vs normal, and identified three critical findings including acute infarction, acute hemorrhage, and mass effect. A deep convolutional neural network was constructed by a combination of localization feature extraction (LFE) modules and global classifiers to identify the presence of 4 variables in brain MRIs including abnormal, acute infarction, acute hemorrhage and mass effect. Training, validation and testing sets were randomly defined on a patient basis. Training was performed on 9845 studies using balanced sampling to address class imbalance. Receiver operating characteristic (ROC) analysis was performed. The ROC analysis of our models for 1050 studies within our internal test data showed AUC/sensitivity/specificity of 0.91/83%/86% for normal versus abnormal brain MRI, 0.95/92%/88% for acute infarction, 0.90/89%/81% for acute hemorrhage, and 0.93/93%/85% for mass effect. For 1072 studies within our external test data, it showed AUC/sensitivity/specificity of 0.88/80%/80% for normal versus abnormal brain MRI, 0.97/90%/97% for acute infarction, 0.83/72%/88% for acute hemorrhage, and 0.87/79%/81% for mass effect. Our proposed deep convolutional network can accurately identify abnormal and critical intracranial findings on individual brain MRIs, while addressing the fact that some MR contrasts might not be available in individual studies.","authors":["Kambiz Nael","Eli Gibson","Chen Yang","Pascal Ceccaldi"],"meta":["March 2021Scientific Reports 11(1)","DOI:10.1038/s41598-021-86022-7"],"references":["327627185_Respond-CAM_Analyzing_Deep_Models_for_3D_Imaging_Data_by_Visualizations","326636842_Hybrid_3D2D_Convolutional_Neural_Network_for_Hemorrhage_Evaluation_on_Head_CT","324212176_Advanced_machine_learning_in_action_identification_of_intracranial_hemorrhage_on_computed_tomography_scans_of_the_head_with_clinical_workflow_integration","322038024_Classification_using_Deep_Learning_Neural_Networks_for_Brain_Tumors","336425460_Convolutional_neural_networks_for_multi-class_brain_disease_detection_using_MRI_images","329883812_American_College_of_Radiology_Appropriateness_Criteria_Advancing_Evidence-Based_Imaging_Practice","329610130_Application_of_Deep_Transfer_Learning_for_Automated_Brain_Abnormality_Classification_Using_MR_Images","328241386_Deep_learning_algorithms_for_detection_of_critical_findings_in_head_CT_scans_a_retrospective_study","321164010_Artificial_intelligence_and_deep_learning_-_Radiology's_next_frontier","321059766_Deep_Learning_for_Medical_Image_Processing_Overview_Challenges_and_the_Future"]}