{"id":"350383947_Designing_Bebras_Serious_Games_Interaction_for_Indonesian_Upper_Elementary_School_Students","abstract":"Computational thinking education nowadays gets more attention around the world because of its importance. In Indonesia, computational thinking has not received attention as much as in other developed countries. However, there is a community that already focuses on promoting computational thinking to Indonesian students through annual competitions, which is Bebras Indonesia. The problems that are used in the competition also have been adapted into a game. The game aims to help student practicing for the competition, but the game still has several limitations to be used by Indonesian students. Therefore, this paper researches similar games design interaction that suits Indonesian students, particularly for upper elementary school students. The type of the game is a serious game that has the main goal of learning. An approach of user-centered design was used to develop the design interaction. Usability testing was conducted to verify the result of the design interaction in two iterations. The result of the research shows that the design interaction is effective with a score of completion rate of 100% and easy to learn with a score of SEQ 6,37 out of 7. It is also enjoyable for students based on the result of the E-Gameflow questionnaire score of 5,83 out of 7 and an IMI enjoyability score of 5,77 out of 7.\nKeywords—computational thinking, Bebras, serious games, interaction design, user-centered, effective, easy to learn, enjoyable.","authors":["Yasya Rusyda","Adi Mulyanto","Ginar Santika Niwanputri"],"meta":["September 2020","DOI:10.1109/ICAICTA49861.2020.9429039","Conference: THE 7TH INTERNATIONAL CONFERENCE ON ADVANCE INFORMATICS: CONCEPTS, THEORY AND APPLICATIONS - ICAICTA2020At: Japan"],"references":["274309848_Computational_Thinking","11946306_Self-Determination_Theory_and_the_Facilitation_of_Intrinsic_Motivation_Social_Development_and_Well-Being","248504034_Designing_the_User_Interface_4th_Ed","243668245_The_Origins_of_Intelligence_in_Child","238720871_Why_You_Only_Need_to_Test_with_5_Users","228328529_Mindstorms_Children_Computers_and_Powerful_Ideas"]}