{"id":"350378684_Teachers'_Agency_and_Online_Education_in_Times_of_Crisis","abstract":"This study examined academic teachers’ agency and emergency responses, prompted by the physical closure of universities and university colleges due to the COVID-19 crisis. The pandemic-related lockdown accelerated the digitalisation of education and forced teachers to adjust their teaching. A theoretical model is elucidated, in which teachers’ agency is understood as the willingness to engage in iterational, practicalevaluative, projective, and transformative action despite the existence of practical, personal and institutional constraints. We explored the nature and degree of this agency through a survey of university teachers in Norway in the first month of the lockdown. Teachers attempted to create learning environments that facilitated knowledge transfer and interaction and sought to solve problems through self-help and support from colleagues and network, although many struggled with insufficiently developed digital competence and institutional support. Latent profile and qualitative analyses revealed different clusters of teacher responses, from strong resistance to online teaching through to transformation of teaching practices. Qualitative analyses unveiled different expressions of teachers’ agency, both ostensible and occlusive, whereby action was shaped by constraining circumstances. These findings can inform future studies of online teaching, indicate the conditions for development of teachers’ digital competence, and illustrate the challenges brought about by crises.","authors":["Crina Damsa","Malcolm Langford","Dan Uehara"],"meta":["March 2021Computers in Human Behavior 121(3):106793","DOI:10.1016/j.chb.2021.106793"],"references":["350405160_Contextual_facilitators_for_learning_activities_involving_technology_in_higher_education_The_C-model","348352113_The_effects_of_the_Covid-19_pandemic_seen_through_the_lens_of_the_Italian_university_teachers_and_the_comparison_with_school_teachers'_perspective","348075402_Profiling_Teachers'_Readiness_for_Online_Teaching_and_Learning_in_Higher_Education_Who's_Ready","343820992_Impact_of_Covid-19_Pandemic_on_Higher_Education_and_Research","343659780_Online_Teaching_Practices_and_the_Effectiveness_of_the_Educational_Process_in_the_Wake_of_the_COVID-19_Pandemic","343229234_The_impact_of_online_learning_during_COVID-19_students'_and_teachers'_perspective","342716579_Online_University_Teaching_During_and_After_the_Covid-19_Crisis_Refocusing_Teacher_Presence_and_Learning_Activity","342344822_Online_Learning_A_Panacea_in_the_Time_of_COVID-19_Crisis","357459544_Educators'_Experiences_Online_How_COVID-19_Encouraged_Pedagogical_Change_in_CS_Education","345500203_Seamless_Learning_Perspectives_Challenges_and_Opportunities_Perspectives_Challenges_and_Opportunities"]}