{"id":"350459464_Lock-in_vibration_retrieval_based_on_high-speed_full-field_coherent_imaging","abstract":"The use of high-speed cameras permits to visualize, analyze or study physical phenomena at both their time and spatial scales. Mixing high-speed imaging with coherent imaging allows recording and retrieving the optical path difference and this opens the way for investigating a broad variety of scientific challenges in biology, medicine, material science, physics and mechanics. At high frame rate, simultaneously obtaining suitable performance and level of accuracy is not straightforward. In the field of mechanics, this prevents high-speed imaging to be applied to full-field vibrometry. In this paper, we demonstrate a coherent imaging approach that can yield full-field structural vibration measurements with state-of-the-art performances. The method is based on high-speed on-line digital holography and recording a short time sequence. Validation of the proposed approach is carried out by comparison with a scanning laser Doppler vibrometer and by realistic simulations. Several error criteria demonstrate measurement capability of yielding amplitude and phase of structural deformations.","authors":["Erwan Meteyer","Silvio Montrésor","Felix Foucart","Julien Le Meur"],"meta":["March 2021Scientific Reports 11(7026)","DOI:10.1038/s41598-021-86371-3","Project: Force identification by numerical holographic interferometer"],"references":["334644086_On_the_use_of_deep_learning_for_computational_imaging","334451421_Full-Field_Surface_Pressure_Reconstruction_Using_the_Virtual_Fields_Method","331406692_Single-shot_deflectometry_for_dynamic_3D_surface_profile_measurement_by_modified_spatial-carrier_frequency_phase-shifting_method","331383859_Computational_image_speckle_suppression_using_block_matching_and_machine_learning","331275326_Infrared_Deflectometry_for_Slope_Deformation_Measurements","349552572_Applied_Digital_Optics","343815584_On_the_use_of_machine_learning_for_computational_imaging","339749407_Computational_de-noising_based_on_deep_learning_for_phase_data_in_digital_holographic_interferometry","339516814_Double-pulsed_holographic_interferometry_with_photorefractive_crystals_for_vibration_and_shock_analysis","336539864_Single-camera_single-axis_vision_method_applied_to_measure_vibrations"]}