{"id":"350404738_Technological_Advances_to_Enhance_Recovery_After_Surgery","abstract":"Artificial intelligence (AI) is a useful tool for clinical decision-making in hospitals, and for strategic decision-making in other industries. This scoping review provides a comprehensive review of the potential for AI to improve strategic decision-making in hospitals by exploring current applications of AI in this area. Peer-reviewed publications and conference presentations associated with AI for strategic decision- making were identified in Health Administration, Computer Science and Business and Management databases to answer the research question; how are hospitals using AI in strategic decision-making? The review found 19 published AI applications for hospital strategic decision-making. The applications used a variety of knowledge-based, probabilistic reasoning and data-driven AI, that generally followed the course of AI maturity. They focused on specific decisions, with none providing a comprehensive framework for strategic decision-making drawing on existing enterprise- or system-wide data. There was little evidence of evaluation of the AI applications, with no cost-benefit evaluation. The scoping review suggests the need for substantial improvement in the understanding of AI and its application among hospital decision- makers leading to greater organisational maturity. This would suggest that journals and researchers require evaluative and economic research and that training to improve understanding of AI be provided for board members, managers and clinicians.","authors":["Kevin W Lobdell","Geoffrey Rose","Subhasis Chatterjee"],"meta":["March 2021Journal of Hospital Management and Health Policy","DOI:10.21037/jhmhp2Gt","Project: Perfect Care: Personalized Cardiac Care and Collaborative"],"references":["343564738_Cardiac_Surgery-Enhanced_Recovery_Programs_Modified_for_COVID-19_Key_Steps_to_Preserve_Resources_Manage_Caseload_Backlog_and_Improve_Patient_Outcomes","38041721_Key_Concepts_for_Estimating_the_Burden_of_Surgical_Conditions_and_the_Unmet_Need_for_Surgical_Care","23789023_A_Surgical_Safety_Checklist_to_Reduce_Morbidity_and_Mortality_in_a_Global_Population","327945896_Machine_learning_for_real-time_prediction_of_complications_in_critical_care_a_retrospective_study","325516999_The_Association_Between_Novel_Biomarkers_and_1-Year_Readmission_or_Mortality_After_Cardiac_Surgery","307856236_What's_the_Risk_Assessing_and_Mitigating_Risk_in_Cardiothoracic_Surgery","269420872_Physiologic_considerations_of_Enhanced_Recovery_After_Surgery_ERAS_programs_implications_of_the_stress_response","14042763_Multimodal_Approach_to_Control_Postoperative_Pathophysiology_and_Rehabilitation"]}