{"id":"350547382_A_Systematic_Investigation_of_Models_for_Color_Image_Processing_in_Wound_Size_Estimation","abstract":"In recent years, research in tracking and assessing wound severity using computerized image processing has increased. With the emergence of mobile devices, powerful functionalities and processing capabilities have provided multiple non-invasive wound evaluation opportunities in both clinical and non-clinical settings. With current imaging technologies, objective and reliable techniques provide qualitative information that can be further processed to provide quantitative information on the size, structure, and color characteristics of wounds. These efficient image analysis algorithms help determine the injury features and the progress of healing in a short time. This paper presents a systematic investigation of articles that specifically address the measurement of wounds’ sizes with image processing techniques, promoting the connection between computer science and health. Of the 208 studies identified by searching electronic databases, 20 were included in the review. From the perspective of image processing color models, the most dominant model was the hue, saturation, and value (HSV) color space. We proposed that a method for measuring the wound area must implement different stages, including conversion to grayscale for further implementation of the threshold and a segmentation method to measure the wound area as the number of pixels for further conversion to metric units. Regarding devices, mobile technology is shown to have reached the level of reliable accuracy.","authors":["Filipe Ferreira","Ivan Miguel Pires","Mónica Isabel Teixeira Costa","Vasco Ponciano"],"meta":["April 2021Computers 10(43)","DOI:10.3390/computers10040043","Project: AAL technologies"],"references":["344274488_DrsNet_Dual-resolution_Semantic_Segmentation_with_Rare_Class-Oriented_Superpixel_Prior","343788654_Aerial_Scene_Classification_through_Fine-Tuning_with_Adaptive_Learning_Rates_and_Label_Smoothing","343765675_Design_and_Development_of_a_Methodology_Based_on_Expert_Systems_Applied_to_the_Treatment_of_Pressure_Ulcers","342916457_Deep_Learning_for_Feature_Extraction_in_Remote_Sensing_A_Case-Study_of_Aerial_Scene_Classification","341556236_Integrating_3D_Model_Representation_for_an_Accurate_Non-Invasive_Assessment_of_Pressure_Injuries_with_Deep_Learning","339584293_A_Research_on_the_Classification_and_Applicability_of_the_Mobile_Health_Applications","338028483_Wound_area_measurement_with_3D_transformation_and_smartphone_images","344056120_Semi-Automatic_Ulcer_Segmentation_and_Wound_Area_Measurement_Supporting_Telemedicine","339094608_Segmenting_Skin_Ulcers_and_Measuring_the_Wound_Area_Using_Deep_Convolutional_Networks","335636318_Mobile_Devices_and_Health"]}