{"id":"350517858_ThriftyNets_Convolutional_Neural_Networks_with_Tiny_Parameter_Budget","abstract":"Deep Neural Networks are state-of-the-art in a large number of challenges in machine learning. However, to reach the best performance they require a huge pool of parameters. Indeed, typical deep convolutional architectures present an increasing number of feature maps as we go deeper in the network, whereas spatial resolution of inputs is decreased through downsampling operations. This means that most of the parameters lay in the final layers, while a large portion of the computations are performed by a small fraction of the total parameters in the first layers. In an effort to use every parameter of a network at its maximum, we propose a new convolutional neural network architecture, called ThriftyNet. In ThriftyNet, only one convolutional layer is defined and used recursively, leading to a maximal parameter factorization. In complement, normalization, non-linearities, downsamplings and shortcut ensure sufficient expressivity of the model. ThriftyNet achieves competitive performance on a tiny parameters budget, exceeding 91% accuracy on CIFAR-10 with less than 40 k parameters in total, 74.3% on CIFAR-100 with less than 600 k parameters, and 67.1% On ImageNet ILSVRC 2012 with no more than 4.15 M parameters. However, the proposed method typically requires more computations than existing counterparts.","authors":["Guillaume Coiffier","Ghouthi Boukli Hacene","Vincent Gripon"],"meta":["March 2021","DOI:10.3390/iot2020012"],"references":["340056074_Quantisation_and_Pruning_for_Neural_Network_Compression_and_Regularisation","336978551_Forward_Stability_of_ResNet_and_Its_Variants","332069196_Born_Again_Neural_Networks","351406827_Attention_Based_Pruning_for_Shift_Networks","341084021_Deep_Geometric_Knowledge_Distillation_with_Graphs","340490396_Neural_ODEs_as_the_Deep_Limit_of_Resnets_with_Constant_Weights","339561777_CutMix_Regularization_Strategy_to_Train_Strong_Classifiers_With_Localizable_Features","338511824_AutoAugment_Learning_Augmentation_Strategies_From_Data","338508269_Relational_Knowledge_Distillation","323410110_Convolutional_Neural_Networks_combined_with_Runge-Kutta_Methods"]}