{"id":"350620857_The_symbiotic_relationship_between_educational_robotics_and_computer_science_in_formal_education","abstract":"Educational Robotics (ER) has the potential to provide significant benefits to education, provided an increase in outreach by transitioning from the extra-curricular initiatives in which ER has thrived to formal education. As Computer Science (CS) Education is undergoing curricular reforms worldwide, the present study addresses the case of a Digital Education reform that included ER as a means to teach core CS concepts. Approximately 350 teachers from the first four grades of primary school participated in a mandatory two-year continuing professional development (CPD) program. The first year of the program was dedicated to CS and introduced teachers to CS Unplugged (CSU) and Robotics Unplugged (RU) activities. As such, we analyse the interplay between these activities and focus on teachers’ voluntary adoption of the proposed content in classrooms. This is complemented by an analysis of their perception and recommendation of ER. The findings highlight three main points. Firstly, ER benefits from the integration in the CS CPD, as this provides the necessary traction to introduce ER into teacher practices (the teachers freely devoted 2275 h to ER activities in their classrooms, over two years). Secondly, the presence of ER activities in the CS-CPD allows a higher proportion of teachers to adopt the CS content, as there are teachers that favour one type of activity over the other. Finally, the globally positive perception of ER registered in this study is relevant for two reasons: teachers were not voluntarily participating in the CPD, and results did not differ between pioneers and novices.","authors":["Laila El-Hamamsy","Barbara Bruno","Lazzarotto Frederique","Morgane Chevalier"],"meta":["September 2021Education and Information Technologies 26(1)","DOI:10.1007/s10639-021-10494-3"],"references":["345982849_An_overview_of_teacher_training_programs_in_educational_robotics_characteristics_best_practices_and_recommendations","345605829_A_computer_science_and_robotics_integration_model_for_primary_school_evaluation_of_a_large-scale_in-service_K-4_teacher-training_program","343400656_Fostering_computational_thinking_through_educational_robotics_a_model_for_creative_computational_problem_solving","340720006_Robotics_and_Early-years_STEM_Education_The_botSTEM_Framework_and_Activities","351549339_Towards_the_alignment_of_educational_robotics_learning_systems_with_classroom_activities","339033446_An_International_Study_Piloting_the_MEasuring_TeacheR_Enacted_Computing_Curriculum_METRECC_Instrument","339013176_Computational_thinking_through_unplugged_activities_in_early_years_of_Primary_Education","336069947_The_ASPID_Model_A_Systemic_Approach_to_Understand_Technology_Appropriation","336051013_Coding_as_another_language_a_pedagogical_approach_for_teaching_computer_science_in_early_childhood","334087728_The_Use_of_Robotics_for_STEM_Education_in_Primary_Schools_Teachers'_Perceptions"]}