{"id":"350689573_Predicting_regional_coastal_sea_level_changes_with_machine_learning","abstract":"All ocean basins have been experiencing significant warming and rising sea levels in recent decades. There are, however, important regional differences, resulting from distinct processes at different timescales (temperature-driven changes being a major contributor on multi-year timescales). In view of this complexity, it deems essential to move towards more sophisticated data-driven techniques as well as diagnostic and prognostic prediction models to interpret observations of ocean warming and sea level variations at local or regional sea basins. In this context, we present a machine learning approach that exploits key ocean temperature estimates (as proxies for the regional thermosteric sea level component) to model coastal sea level variability and associated uncertainty across a range of timescales (from months to several years). Our findings also demonstrate the utility of machine learning to estimate the possible tendency of near-future regional sea levels. When compared to actual sea-level records, our models perform particularly well in the coastal areas most influenced by internal climate variability. Yet, the models are widely applicable to evaluate the patterns of rising and falling sea levels across many places around the globe. Thus, our approach is a promising tool to model and anticipate sea level changes in the coming (1–3) years, which is crucial for near-term decision making and strategic planning about coastal protection measures.","authors":["Veronica Nieves","Cristina Radin","Gustau Camps-Valls"],"meta":["April 2021Scientific Reports 11(1)","DOI:10.1038/s41598-021-87460-z"],"references":["346400477_Multi-year_ocean_thermal_variability","343778817_Increase_in_sea_level_variability_with_ocean_warming_associated_with_the_nonlinear_thermal_expansion_of_seawater","340719646_Understanding_of_Contemporary_Regional_Sea-Level_Change_and_the_Implications_for_the_Future","338449435_A_perspective_on_Gaussian_processes_for_Earth_observation","336555270_Guest_Editorial_Relationships_Between_Coastal_Sea_Level_and_Large-Scale_Ocean_Circulation","330316398_How_fast_are_the_oceans_warming","323955231_Physics-Aware_Gaussian_Processes_in_Remote_Sensing","323758245_Internal_climate_variability_and_projected_future_regional_steric_and_dynamic_sea_level_rise","331089977_Deep_learning_and_process_understanding_for_data-driven_Earth_system_science","327270112_Global_Sea_Level_Budget_1993-Present"]}