{"id":"350665317_Biological_structure_and_function_emerge_from_scaling_unsupervised_learning_to_250_million_protein_sequences","abstract":"In the field of artificial intelligence, a combination of scale in data and model capacity enabled by unsupervised learning has led to major advances in representation learning and statistical generation. In the life sciences, the anticipated growth of sequencing promises unprecedented data on natural sequence diversity. Protein language modeling at the scale of evolution is a logical step toward predictive and generative artificial intelligence for biology. To this end, we use unsupervised learning to train a deep contextual language model on 86 billion amino acids across 250 million protein sequences spanning evolutionary diversity. The resulting model contains information about biological properties in its representations. The representations are learned from sequence data alone. The learned representation space has a multiscale organization reflecting structure from the level of biochemical properties of amino acids to remote homology of proteins. Information about secondary and tertiary structure is encoded in the representations and can be identified by linear projections. Representation learning produces features that generalize across a range of applications, enabling state-of-the-art supervised prediction of mutational effect and secondary structure and improving state-of-the-art features for long-range contact prediction.","authors":["Alexander Rives","Joshua Meier","Tom Sercu","Siddharth Goyal"],"meta":["April 2021Proceedings of the National Academy of Sciences 118(15):e2016239118","DOI:10.1073/pnas.2016239118"],"references":["340505741_Generating_functional_protein_variants_with_variational_autoencoders","338660797_Evolutionary_context-integrated_deep_sequence_modeling_for_protein_engineering","338619491_Improved_protein_structure_prediction_using_potentials_from_deep_learning","338488361_UDSMProt_Universal_Deep_Sequence_Models_for_Protein_Classification","337995846_Modeling_aspects_of_the_language_of_life_through_transfer-learning_protein_sequences","336711828_Unified_rational_protein_engineering_with_sequence-based_deep_representation_learning","340612135_Designing_Feature-Controlled_Humanoid_Antibody_Discovery_Libraries_Using_Generative_Adversarial_Networks","337767890_End-to-end_multitask_learning_from_protein_language_to_protein_features_without_alignments","336997604_Cloze-driven_Pretraining_of_Self-attention_Networks","336343950_Critical_assessment_of_methods_of_protein_structure_prediction_CASP-Round_XIII"]}