{"id":"350731049_PROFESSIONAL_COMPETENCE_OF_A_FUTURE_TEACHER_OF_INFORMATICS_AS_A_SUBJECT_OF_SCIENTIFIC_AND_METHODOLOGICAL_RESEARCH","abstract":"We consider the professional competence of a future teacher of computer science as: the purpose of professional training on the educational program “Secondary education (computer science)”; professional and personal characteristics of a motivated personality; the ability of an individual to apply fundamental knowledge according to the subject of professional activity; readiness of an individual to perform professional duties; prerequisite for personal and professional development. Professional competence is a dynamic formation distinguished between the professional competence of a future teacher as of a graduate and of the one, who is already a teacher. Speaking of the formation of a competence, we mean mastering it at a certain level. In particular, in the course of higher education we distinguish purposeful formation. Its further development is carried out after obtaining a qualification, in the process of professional activity. The components of this competence are general (pedagogical) and special (subject) competencies, the latter reflecting the specifics of the teacher’s activities in teaching and learning a particular subject. In this list we highlight the methodological competence. This phenomenon is difficult, because the question of developing a unified approach to the interpretation of content and structural components remains open, but these features are not fundamentally different. They emphasize the uniqueness of pedagogical activities. The formation of professional competence is defined as a purposeful process for: mastering fundamental, integrated, systematic knowledge of Pedagogy, Psychology, Computer Science as a basic science and methods of its teaching; strengthening the motivational and value principles of continuous self-education and self-improvement, creative and responsible attitude to the profession; formation of skills to apply the acquired knowledge in practical situations that simulate professional activity; enrichment of professional experience, which should be formed in the institution of higher education at a minimum level; development of professionally significant personal qualities. The peculiarities of this process are due to the requirements of employers, the ideas of implementation in practice of psychological and pedagogical innovations and modern technologies, specified by the specifics of teaching the subject.","authors":["NATALIA PAVLOVA"],"meta":["April 2021The Scientific Issues of Ternopil Volodymyr Hnatiuk National Pedagogical University Series pedagogy","DOI:10.25128/2415-3605.20.2.8"],"references":[]}