{"id":"350786719_Object_Semantic_Segmentation_in_Point_Clouds-Comparison_of_a_Deep_Learning_and_a_Knowledge-Based_Method","abstract":"Through the power of new sensing technologies, we are increasingly digitizing the real world. However, instruments produce unstructured data, mainly in the form of point clouds for 3D data and images for 2D data. Nevertheless, many applications (such as navigation, survey, infrastructure analysis) need structured data containing objects and their geometry. Various computer vision approaches have thus been developed to structure the data and identify objects therein. They can be separated into model-driven, data-driven, and knowledge-based approaches. Model-driven approaches mainly use the information on the objects contained in the data and are thus limited to objects and context. Among data-driven approaches, we increasingly find deep learning strategies\nbecause of their autonomy in detecting objects. They identify reliable patterns in the data and connect\nthese to the object of interest. Deep learning approaches have to learn these patterns in a training\nstage. Knowledge-based approaches use characteristic knowledge from different domains allowing\nthe detection and classification of objects. The knowledge must be formalized and substitutes\nthe training for deep learning. Semantic web technologies allow the management of such human\nknowledge. Deep learning and knowledge-based approaches have already shown good results for\nsemantic segmentation in various examples. The common goal but the different strategies of the\ntwo approaches engaged our interest in doing a comparison to get an idea of their strengths and\nweaknesses. To fill this knowledge gap, we applied two implementations of such approaches to a\nmobile mapping point cloud. The detected object categories are car, bush, tree, ground, streetlight and\nbuilding. The deep learning approach uses a convolutional neural network, whereas the knowledgebased\napproach uses standard semantic web technologies such as SPARQL and OWL2to guide the\ndata processing and the subsequent classification as well. The LiDAR point cloud used was acquired\nby a mobile mapping system in an urban environment and presents various complex scenes, allowing\nus to show the advantages and disadvantages of these two types of approaches. The deep learning\nand knowledge-based approaches produce a semantic segmentation with an average F1 score of 0.66\nand 0.78, respectively. Further details are given by analyzing individual object categories allowing us\nto characterize specific properties of both types of approaches.","authors":["Jean-Jacques Ponciano","Moritz Roetner","Alexander Reiterer","Frank Boochs"],"meta":["April 2021International Journal of Geosciences 10(Advanced Research Based on Multi-Dimensional Point Cloud Analysis)","DOI:10.3390/ijgi10040256","Project: Knowledge based Object Detection in Images and Point Clouds"],"references":["343622553_SELF-LEARNING_ONTOLOGY_FOR_INSTANCE_SEGMENTATION_OF_3D_INDOOR_POINT_CLOUD","343491114_Fully_Automated_Segmentation_of_2D_and_3D_Mobile_Mapping_Data_for_Reliable_Modeling_of_Surface_Structures_Using_Deep_Learning","342882015_LatticeNet_Fast_Point_Cloud_Segmentation_Using_Permutohedral_Lattices","339375383_Dynamic_Points_Agglomeration_for_Hierarchical_Point_Sets_Learning","339273840_3D_object_recognition_through_a_process_based_on_semantics_and_consideration_of_the_context","338937998_RangeNet_Fast_and_Accurate_LiDAR_Semantic_Segmentation","337759722_Object_detection_in_unstructured_3D_data_sets_using_explicit_semantics","336703085_New_Method_for_Evaluating_Surface_Roughness_Parameters_Acquired_by_Laser_Scanning","344982082_Dilated_Point_Convolutions_On_the_Receptive_Field_Size_of_Point_Convolutions_on_3D_Point_Clouds","342536447_Deep_Learning_for_3D_Point_Clouds_A_Survey"]}