{"id":"350732500_Predicting_the_clinical_management_of_skin_lesions_using_deep_learning","abstract":"Automated machine learning approaches to skin lesion diagnosis from images are approaching dermatologist-level performance. However, current machine learning approaches that suggest management decisions rely on predicting the underlying skin condition to infer a management decision without considering the variability of management decisions that may exist within a single condition. We present the first work to explore image-based prediction of clinical management decisions directly without explicitly predicting the diagnosis. In particular, we use clinical and dermoscopic images of skin lesions along with patient metadata from the Interactive Atlas of Dermoscopy dataset (1011 cases; 20 disease labels; 3 management decisions) and demonstrate that predicting management labels directly is more accurate than predicting the diagnosis and then inferring the management decision ( $$13.73 \\pm 3.93\\%$$ 13.73 ± 3.93 % and $$6.59 \\pm 2.86\\%$$ 6.59 ± 2.86 % improvement in overall accuracy and AUROC respectively), statistically significant at $$p < 0.001$$ p < 0.001 . Directly predicting management decisions also considerably reduces the over-excision rate as compared to management decisions inferred from diagnosis predictions (24.56% fewer cases wrongly predicted to be excised). Furthermore, we show that training a model to also simultaneously predict the seven-point criteria and the diagnosis of skin lesions yields an even higher accuracy (improvements of $$4.68 \\pm 1.89\\%$$ 4.68 ± 1.89 % and $$2.24 \\pm 2.04\\%$$ 2.24 ± 2.04 % in overall accuracy and AUROC respectively) of management predictions. Finally, we demonstrate our model’s generalizability by evaluating on the publicly available MClass-D dataset and show that our model agrees with the clinical management recommendations of 157 dermatologists as much as they agree amongst each other.","authors":["Kumar Abhishek","Jeremy Kawahara","Ghassan Hamarneh"],"meta":["April 2021Scientific Reports 11(1)","DOI:10.1038/s41598-021-87064-7"],"references":["341183682_Effects_of_Label_Noise_on_Deep_Learning-Based_Skin_Cancer_Classification","339008987_SciPy_10_fundamental_algorithms_for_scientific_computing_in_Python","336910551_Machine_Friendly_Machine_Learning_Interpretation_of_Computed_Tomography_Without_Image_Reconstruction","336377105_Generalizable_Feature_Learning_in_the_Presence_of_Data_Bias_and_Domain_Class_Imbalance_with_Application_to_Skin_Lesion_Classification","334237601_Detection_of_Skin_Cancer_Using_SVM_Random_Forest_and_kNN_Classifiers","340302934_Augment_Intelligence_Dermatology_Deep_Neural_Networks_Empower_Medical_Professionals_in_Diagnosing_Skin_Cancer_and_Predicting_Treatment_Options_for_134_Skin_Disorders","340180048_Statsmodels_Econometric_and_Statistical_Modeling_with_Python","335145091_Direct_Cup-to-Disc_Ratio_Estimation_for_Glaucoma_Screening_via_Semi-Supervised_Learning","333330304_Deep_Learning_Based_Skin_Lesion_Segmentation_and_Classification_of_Melanoma_Using_Support_Vector_Machine_SVM","332792444_991_Deep_neural_networks_empower_medical_professionals_in_diagnosing_skin_cancer_and_predicting_treatment_options_for_general_skin_disorders"]}