{"id":"350759835_Large-scale_nonlinear_Granger_causality_for_inferring_directed_dependence_from_short_multivariate_time-series_data","abstract":"A key challenge to gaining insight into complex systems is inferring nonlinear causal directional relations from observational time-series data. Specifically, estimating causal relationships between interacting components in large systems with only short recordings over few temporal observations remains an important, yet unresolved problem. Here, we introduce large-scale nonlinear Granger causality (lsNGC) which facilitates conditional Granger causality between two multivariate time series conditioned on a large number of confounding time series with a small number of observations. By modeling interactions with nonlinear state-space transformations from limited observational data, lsNGC identifies casual relations with no explicit a priori assumptions on functional interdependence between component time series in a computationally efficient manner. Additionally, our method provides a mathematical formulation revealing statistical significance of inferred causal relations. We extensively study the ability of lsNGC in inferring directed relations from two-node to thirty-four node chaotic time-series systems. Our results suggest that lsNGC captures meaningful interactions from limited observational data, where it performs favorably when compared to traditionally used methods. Finally, we demonstrate the applicability of lsNGC to estimating causality in large, real-world systems by inferring directional nonlinear, causal relationships among a large number of relatively short time series acquired from functional Magnetic Resonance Imaging (fMRI) data of the human brain.","authors":["Axel Wismüller","Adora M. Dsouza","M. Ali Vosoughi","Anas Abidin"],"meta":["April 2021Scientific Reports 11(1):7817","DOI:10.1038/s41598-021-87316-6"],"references":["349256952_Assessing_the_significance_of_directed_and_multivariate_measures_of_linear_dependence_between_time_series","338862605_Rethinking_Measures_of_Functional_Connectivity_via_Feature_Extraction","337604860_Detecting_and_quantifying_causal_associations_in_large_nonlinear_time_series_datasets","333782078_Inferring_causation_from_time_series_in_Earth_system_sciences","333533125_Effective_degrees_of_freedom_of_the_Pearson's_correlation_coefficient_under_autocorrelation","331209033_IDTxl_The_Information_Dynamics_Toolkit_xl_a_Python_package_for_the_efficient_analysis_of_multivariate_information_dynamics_in_networks","322498528_MINE_Mutual_Information_Neural_Estimation","321660768_Alteration_of_brain_network_topology_in_HIV-associated_neurocognitive_disorder_A_novel_functional_connectivity_perspective","325199220_Mutual_connectivity_analysis_of_resting-state_functional_MRI_data_with_local_models","317642968_Exploring_Connectivity_with_Large-Scale_Granger_Causality_on_Resting-State_Functional_MRI"]}