{"id":"350784571_How_to_form_a_software_engineering_capstone_team","abstract":"This research paper answers the question that how shall the students of software engineering undergraduate courses form teams for the capstone projects that can be cohesive too. In this research, 128 criteria for team formation are proposed for building teams for self-managing software engineering capstone projects. A comparison is also conducted to ascertain the level of cohesion among those teams that were formed using the proposed criteria and those that were not formed using the proposed criteria. The criteria were identified through a combination of qualitative questionnaire survey targeted at the graduated students of the past batches of Computer Science degree program and through synthesizing the literature on engineering capstone project teams identified under the guidance of KSAO framework for software engineering students. To check the effectiveness of the criteria, 100 students were asked to form the teams using the proposed criteria and other 100 students formed the teams without the proposed criteria. Those students that had used the proposed criteria for building teams and those that had formed teams without using the proposed criteria were asked to fill the modified Group Environment Questionnaire to ascertain the level of cohesion among the team members. The results were analyzed qualitatively and through descriptive quantification. The results show that the level of cohesion in teams that were formed using the proposed team building criteria was higher. There was a need for team building criteria in the literature on software engineering capstone project teams that conforms to a conceptual, theoretical framework; this gap is now filled through this research. This paper may also serve as a literature review paper for some readers.","authors":["Muhammad Khalid Shaikh"],"meta":["April 2021Heliyon 7(4):e06629","DOI:10.1016/j.heliyon.2021.e06629"],"references":["352119942_Interpersonal_barriers_to_decision_making","349415430_Using_Student_Preferences_to_Guide_Design_Team_Composition","329938132_Good_to_Great_-_Why_Some_Companies_Make_the_Leap_and_others_Don't","329017308_Psychographd_A_team_building_platform_for_software_engineering_students","325356773_KSAO_Framework_for_Computer_Science_Project_Student_Teams","320655361_Accommodating_Soft_Skills_in_Software_Project_Management","320655241_An_Evolutionary_Software_Project_Management_Maturity_Model_for_Mauritius","319770503_Measuring_and_managing_for_team_performance_Emerging_principles_from_complex_environments","314922328_Obtaining_IT_Competencies_for_Curricular_Development_using_Q-technique","307445808_Software_Project_Management_as_Team_Building_Intervention","298329017_The_Myers-Briggs_Type_Indicator_As_A_Tool_To_Facilitate_Learning_Outcomes_For_Team_Building_In_The_Classroom","289942002_Integration_of_project_management_components_in_undergraduate_information_systems_curricula","304749281_Group_performance_and_intergroup_relations_in_organizations","291023944_Resiliency_in_schools_making_it_happen","289267073_Problem-solving_team_behaviors_Development_and_validation_of_BOS_and_a_hierarchical_factor_structure"]}