{"id":"350889392_Modeling_Through_Model-Eliciting_Activities_An_Analysis_of_Models_Elements_And_Strategies_in_High_School_The_Cases_of_Students_with_Different_Level_of_Achievement","abstract":"A mathematical client-driven task known as Model-Eliciting Activities was implemented with students of different levels of achievement (i.e., low, average, and high) at the high-school level. The study strived to prove that Model-Eliciting Activities can be solved by students at any achievement level and be used as an assessment tool. Students collaborated in teams of three to develop solutions that met the client’s needs. The model-solutions were compared and contrasted among several dimensions and achievement levels, considering the quality of the final product-solution based on the Quality Assessment Guide, the intermedia product composed of the type of models created, the strategies followed, and the elements of the mathematical construct. A Model & Modeling perspective was considered as a framework in which students’ teams comprised the cases studied and analyzed. Findings show that students were able to create and elaborate models-solutions regardless of the level of achievement, with a comparable quality but with different strategies. Although student’s solutions were similar in sophistication across achievement level, more studies are needed to evaluate high schoolers’ solutions to these types of mathematical task.","authors":["Jair J. Aguilar"],"meta":["April 2021"],"references":["327499201_Doing_Psychological_Research","279478754_Mathematical_Modelling_Can_It_Be_Taught_And_Learnt","317953358_Making_sense_teaching_and_learning_mathematics_with_understanding","305758813_The_Richness_of_Children's_Fraction_Strategies","302411930_Geogebra_as_a_Conceptual_Tool_for_Modeling_Real_World_Problems","286330563_A_theory_of_cooperation-competition_and_beyond","285942711_Creative_model_construction_in_scientists_and_students_The_role_of_imagery_analogy_and_mental_simulation","271830558_Models_and_Modeling_in_Mathematics_Education_Making_Learners'_Mathematical_Thinking_Knowledge_and_Skills_Visible","258182057_A_Typology_for_the_Case_Study_in_Social_Science_Following_a_Review_of_Definition_Discourse_and_Structure","256096339_Statistical_analysis_when_the_data_is_an_image_Eliciting_student_thinking_about_sampling_and_variability"]}