{"id":"350840648_Legaltech_and_Lawtech_Global_Perspectives_Challenges_and_Opportunities","abstract":"Legaltech refers to the application of new technologies to the world of law, to carry out tasks that, until recently, were performed by lawyers or other personnel working in law firms. From 2015 onwards the Lawtech alternative has emerged. In this work, the concepts of Legaltech and Lawtech have been analyzed by searching the two main scientific information databases such as Scopus and Wed of Science (WoS). There has been a clear trend to use the concept of Legaltech against Lawtech. Six clear research lines have been detected from the whole of the published documents regarding these concepts. These are the related to Computer Science, Justice, Legal profession, Legal design, Law firms, and Legal Education. It is proposed to use the term Legaltech to include all technological advances in the legal field. From the point of view of opportunities, the irruption of Legaltech will be able to offer accurate legal advice to the public, reducing the price of this and on the other hand, analyze large amounts of data that law firms and legal advisors will use to improve their management and increase their productivity. In short, Legaltech and Lawtech are opening up new opportunities in the legal sector encouraging technological innovation, giving greater access to legal services, even try to achieve the goal of universal access to justice.","authors":["Esther Salmerón-Manzano"],"meta":["April 2021Laws 10(2):24","DOI:10.3390/laws10020024"],"references":["347633178_Why_to_Buy_Insurance_An_Explainable_Artificial_Intelligence_Approach","345192317_Legal_Technology_and_the_Future_of_Women_in_Law","344031796_How_do_Lawyers_Engineer_and_Develop_LegalTech_Projects_A_Story_of_Opportunities_Platforms_Creative_Rationalities_and_Strategies","342356634_Digitalization_of_the_Legal_Field_and_the_Future_of_Large_Law_Firms","338006919_Machine_Learning_for_Quantitative_Finance_Applications_A_Survey","337574874_The_Professions'_Engagements_with_LawTech_Narratives_and_Archetypes_of_Future_Law","337248541_The_Provision_of_Legal_Services_to_Consumers_Using_LawTech_Tools_From_Service_to_Legal_Product","344848735_Rage_against_the_machine_Incorporating_legal_tech_into_legal_education","339440268_Global_tuberculosis_research_and_its_future_prospects","336014344_The_state_of_global_research_on_social_work_and_disability"]}