{"id":"350824566_Application_of_DBN_and_GWO-SVM_in_analog_circuit_fault_diagnosis","abstract":"For large-scale integrated electronic equipment, the complex operating mechanisms make fault detection very difficult. Therefore, it is important to accurately identify analog circuit faults in a timely manner. To overcome this problem, this paper proposes a novel fault diagnosis method based on the deep belief network (DBN) and restricted Boltzmann machine (RBM) optimized by the gray wolf optimization (GWO) algorithm. First, DBN is used to extract the deep features of the analog circuit output signal. Then, GWO is used to optimize the penalty factor c and kernel parameter g of support vector machine (SVM). Finally, GWO-SVM is used to diagnose the signal features extracted by the DBN. Fault diagnosis simulation was conducted for the Sallen–Key band-pass filter and a four-opamp biquad highpass filter. The experimental results show that compared with the existing algorithms, the algorithm proposed in this paper improves the accuracy of Sallen–Key bandpass filter circuit to 100% and shortens the fault diagnosis time by about 90%; for four-opamp biquad highpass filter, the accuracy rate has increased to 99.68%, and the fault diagnosis time has been shortened by approximately 75%, and reduce hundreds of iterations. Moreover, the experimental results reveal that the proposed fault diagnosis method greatly improves the accuracy of analog circuit fault diagnosis, which solves a major problem in analog circuitry and has great significance for the future development of relevant applications.","authors":["Xiyuan Su","Changqing Cao","Xiaodong Zeng","Zhejun Feng"],"meta":["April 2021Scientific Reports 11(1)","DOI:10.1038/s41598-021-86916-6"],"references":["341672498_Multi-Strategy_Ensemble_Whale_Optimization_Algorithm_and_Its_Application_to_Analog_Circuits_Intelligent_Fault_Diagnosis","273284838_Spectral-Spatial_Classification_of_Hyperspectral_Data_Based_on_Deep_Belief_Network","260010809_Grey_Wolf_Optimizer","345648750_A_novel_approach_for_analog_circuit_fault_diagnosis_based_on_Deep_Belief_Network","338810656_Generative_Adversarial_Networks_With_Comprehensive_Wavelet_Feature_for_Fault_Diagnosis_of_Analog_Circuits","315973847_Capturing_High-Discriminative_Fault_Features_for_Electronics-Rich_Analog_System_via_Deep_Learning","315463939_Multisensor_Feature_Fusion_for_Bearing_Fault_Diagnosis_Using_Sparse_Autoencoder_and_Deep_Belief_Network","303917266_An_improved_SVM_classifier_based_on_double_chains_quantum_genetic_algorithm_and_its_application_in_analogue_circuit_diagnosis","282310786_Rolling_bearing_fault_diagnosis_using_an_optimization_deep_belief_network","271513141_Support_Vector_Networks"]}