{"id":"350828839_IDSA_An_Efficient_Algorithm_for_Skyline_Queries_Computation_on_Dynamic_and_Incomplete_Data_With_Changing_States","abstract":"Skyline queries have been widely used as an effective query tool in many contemporary database applications. The main concept of skyline queries relies on retrieving the non-dominated tuples in the database which are known skylines. In most database applications, the contents of the databases are dynamic due to the continuous changes made towards the database. Typically, the changes in the contents of the database occur through data manipulation operations (INSERT and/or UPDATE). Performing these operations on the database results in invalidating the most recent skylines before changes are made on the database. Furthermore, the presence of incomplete data in databases becomes frequent phenomena in recent database applications. Data incompleteness causes several challenges on skyline queries such as losing the transitivity property of the skyline technique and the test dominance process between tuples being cyclic. Reapplying skyline technique on the entire updated incomplete database to determine the new skylines is unwise due to the exhaustive pairwise comparisons. Thus, this paper proposes an approach, named Incomplete Dynamic Skyline Algorithm (IDSA) which attempts to determine the skylines on dynamic and incomplete databases. Two optimization techniques have been incorporated in IDSA, namely: pruning and selecting superior local skylines. The pruning process attempts to exploit the derived skylines before the INSERT/UPDATE operation made on the database to identify the new skylines. Moreover, selecting superior local skylines process assists in further eliminating the remaining non-skylines from further processing. These two optimization techniques lead to a large reduction in the number of domination tests due to avoiding re-computing of skylines over the entire updated database to derive the new skylines. Extensive experiments have been accomplished on both real and synthetic datasets, and the results demonstrate that IDSA outperforms the existing solutions in terms of the number of domination tests and the processing time of the skyline operation.","authors":["Yonis Gulzar","Ali Amer Alwan","Hamidah Ibrahim","Sherzod Turaev"],"meta":["April 2021IEEE Access 9(2021):57291 - 57310","DOI:10.1109/ACCESS.2021.3072775","Project: IDSA: An Efficient Algorithm for Skyline Queries Computation on Dynamic and Incomplete Data with Changing States"],"references":["344246186_An_Overview_of_Query_Processing_on_Crowdsourced_Databases","343201211_Efficient_Computation_of_Skyline_Queries_Over_a_Dynamic_and_Incomplete_Database","342017550_Skyline_Queries_Computation_on_Crowdsourced-Enabled_Incomplete_Database","340637861_A_Model_for_Computing_Skyline_Data_Items_in_Cloud_Incomplete_Databases","337997355_Optimizing_Skyline_Query_Processing_in_Incomplete_Data","330238993_D-SKY_A_Framework_for_Processing_Skyline_Queries_in_a_Dynamic_and_Incomplete_Database","329483231_SCSA_Evaluating_skyline_queries_in_incomplete_data","323779790_Identifying_skylines_in_cloud_databases_with_incomplete_data","336452456_Answering_Skyline_Queries_Over_Incomplete_Data_With_Crowdsourcing","331724508_Modeling_and_Computing_Probabilistic_Skyline_on_Incomplete_Data"]}