{"id":"350837270_The_Significance_Role_of_Programming_in_Information_Technology_IT","abstract":"Programming has emerged as \"the\" foundation skill for information technologists. However, since the requisite skill sets of IT professionals differ from those of other computing professionals, programming in IT is fundamentally different from programming in computer science or software engineering. The IT Department at RIT has changed the weight and delivery of programming in its curriculum several times since its inception in 1992. Today, programming is an essential foundation for other more advanced IT skills in all curricular knowledge areas, and it is a central outcome of our curriculum. This paper discusses the role of programming in IT, the types of skills necessary, how we see the need for this skill changing in the other \"pillars\" of this academic discipline, and the impact on programming curricula. Introduction In view of the fact that the inception of information technology (IT) as an academic discipline, the role of computer programming has been a arguable issue. In some suitcases, IT has been alleged-or perhaps misperceived-as being computing with less programming [5, 6]. Other programs do not differentiate between the programming needs of information technologists and the programming skills taught in older computing disciplines, such as computer science [7, 8]. However, programming in IT is different [9].","authors":["Samuel Eneji","Eneji","Walter Ibe","Eyong"],"meta":["July 2020International Journal of Information and Communication Technology 1(03):15","DOI:10.12692/MIJCRP01/72226","Project: The Significance Role of Programming in Information  Technology (IT)"],"references":["220832195_Teaching_Introductory_Programming_to_Information_Systems_and_Computing_Majors_Is_There_a_Difference","27296733_Agile_Software_Development","234827320_Implementation_of_alternative_pacing_in_an_introductory_programming_sequence","234815043_Lessons_learned_in_the_development_of_an_information_technology_concentration","234784810_Information_technology_a_degree_in_computing","221538036_A_Bachelor_of_Science_in_information_technology_an_interdisciplinary_approach","4053185_Programming_for_Communication_Overcoming_Motivational_Barriers_to_Computation_for_All"]}