{"id":"350966868_Beyond_Tribes_and_Territories_in_Humanities","abstract":"Largely used in the early 1990‟ s for the cultures of academic disciplines and their roots in different knowledge characteristics, the “tribes and territories” metaphor refers to the borders between traditional disciplines and the researchers‟ and academics‟ tendency to isolate themselves within the limits of their own discipline. Starting from the belief that a fragmentary approach can only provide a limited perspective upon the object of knowledge, the interdisciplinary approach has gradually gained solid ground starting from the second decade of the 20th century, leading thus to the development of interdisciplinary research fields. In this context, both sociolinguistics, developed at the confluence of linguistics with sociology, starting in the mid-20th century, and computational linguistics, emerging at the end of the same century, at the borderline between classical linguistics and computer science, propose interdisciplinary approaches to language facts, by exploring the conceptual and methodological apparatus of linguistics, sociology and the automatic processing of language. This study presents the methodological particularities of the two disciplines, highlighting the arguments they bring to support the interdisciplinary research of linguistic phenomena.","authors":["Bibiri Anca-Diana","Mihaela Mocanu"],"meta":["April 2021","Project: Perspectives in Humanities and Social Sciences"],"references":["289378321_Becoming_Interdisciplinary_An_Introduction_to_Interdisciplinary_Studies_3rd_Ed","289237930_Academic_Tribes_and_Territories_the_theoretical_trajectory","283922529_Learning_Styles_and_Disciplinary_Differences","234658015_Fruits_Salads_and_Smoothies_A_Working_Definition_of_Interdisciplinarity","232441743_The_Characteristics_of_Subject_Matter_in_Different_Academic_Areas","276229575_An_Introduction_to_Sociolinguistics","266871010_On_transdisciplinarity","247849020_The_Ecology_of_Language","245155235_Academic_tribes_and_territories_Intellectual_enquiry_and_the_culture_of_disciplines","242360149_The_Significance_of_Disciplinary_Differences","2481502_Attention_Intentions_And_The_Structure_Of_Discourse","227220299_Interdisciplinarity_For_what_purpose","44334288_Sociolinguistics_an_introduction_to_language_and_society_Peter_Trudgill","37715815_Interdisciplinarity_History_Theory_and_Practice"]}