{"id":"350921577_Multi-scale_joint_feature_network_for_micro-expression_recognition","abstract":"Micro-expression recognition is a substantive cross-study of psychology and computer science, and it has a wide range of applications (e.g., psychological and clinical diagnosis, emotional analysis, criminal investigation, etc.). However, the subtle and diverse changes in facial muscles make it difficult for existing methods to extract effective features, which limits the improvement of micro-expression recognition accuracy. Therefore, we propose a multi-scale joint feature network based on optical flow images for micro-expression recognition. First, we generate an optical flow image that reflects subtle facial motion information. The optical flow image is then fed into the multi-scale joint network for feature extraction and classification. The proposed joint feature module (JFM) integrates features from different layers, which is beneficial for the capture of micro-expression features with different amplitudes. To improve the recognition ability of the model, we also adopt a strategy for fusing the feature prediction results of the three JFMs with the backbone network. Our experimental results show that our method is superior to state-of-the-art methods on three benchmark datasets (SMIC, CASME II, and SAMM) and a combined dataset (3DB).","authors":["Xinyu Li","Guangshun Wei","Jie Wang","Yuanfeng Zhou"],"meta":["April 2021Computational Visual Media 7(1)","DOI:10.1007/s41095-021-0217-9"],"references":["342148313_Micro-Attention_for_Micro-Expression_Recognition","334425302_Shallow_Triple_Stream_Three-dimensional_CNN_STSTNet_for_Micro-expression_Recognition","334424998_MEGC_2019_-_The_Second_Facial_Micro-Expressions_Grand_Challenge","341673899_More_Trainable_Inception-ResNet_for_Face_Recognition","339011165_Leveraging_3D_blendshape_for_facial_expression_recognition_using_CNN","335538483_Dual-stream_Shallow_Networks_for_Facial_Micro-expression_Recognition","334713122_Spatiotemporal_Recurrent_Convolutional_Networks_for_Recognizing_Spontaneous_Micro-Expressions","334427846_Dual-Inception_Network_for_Cross-Database_Micro-Expression_Recognition","334425175_CapsuleNet_for_Micro-Expression_Recognition","334425071_A_Neural_Micro-Expression_Recognizer"]}