{"id":"350930239_Deep_convolutional_neural_network_for_automatic_fault_recognition_from_3D_seismic_datasets","abstract":"With the explosive growth in seismic data acquisition and the successful application of deep convolutional neural networks (DCNN) to various image processing tasks within multidisciplinary fields, many researchers have begun to research DCNN based automatic seismic interpretation techniques. Due to the vast number of parameters considered in deep neural networks, deep learning methods usually require a large amount of data for training. However, collecting a large number of expert interpretations is very time consuming, so related research usually uses synthetic datasets and ignores the practical problems of field datasets. In this paper, we open-source a multi-gigabyte expert-labelled field dataset in response to the challenge of accessing large-scale expert-labelled field datasets. We show that 2D fault recognition within this dataset is an image segmentation or edge detection problem in the computer vision field, that can be expressed as a pixel-level fault/non-fault binary classification. Both types of DCNNs are compared, and we propose a novel fault recognition workflow, which involves processing and screening of seismic images and labels, training DCNNs and automatic numerical evaluation. We have also demonstrated for three case study datasets that effective image augmentation methods can reduce the required labelled crosslines while maintaining satisfactory performance. Our experimental results show that our workflow not only outperforms two state-of-the-art DCNN solutions but also achieves performance comparable to humans on an expert labelled image dataset, even predicting subtle faults that an expert interpreter did not annotate. We suggest that the proposed workflow could reduce the fault interpretation life cycle from months to hours and improve the quality, and define the confidence, of fault interpretation results.","authors":["Yu An","Jiulin Guo","Qing Ye","Conrad Childs"],"meta":["April 2021Computers & Geosciences 153(2):104776","DOI:10.1016/j.cageo.2021.104776","Project: Automatic Geological Fault Interpretation"],"references":["336389117_Fault_interpretation_in_seismic_reflection_data_an_experiment_analysing_the_impact_of_conceptual_model_anchoring_and_vertical_exaggeration","335104137_FaultNet_A_deep_CNN_model_for_3D_automated_fault_picking","335103802_Building_realistic_structure_models_to_train_convolutional_neural_networks_for_seismic_structural_interpretation","335102980_Deep_learning_for_local_seismic_image_processing_Fault_detection_structure-oriented_smoothing_with_edge-preserving_and_slope_estimation_by_using_a_single_convolutional_neural_network","344743646_Fault_image_enhancement_using_a_forward_and_backward_diffusion_method","337147967_Seismic_fault_detection_in_real_data_using_transfer_learning_from_a_convolutional_neural_network_pre-trained_with_synthetic_seismic_data","336206603_The_three-dimensional_geometry_of_relay_zones_within_segmented_normal_faults","335103978_Reducing_training_dataset_bias_for_automatic_fault_detection","334412574_Automatic_classification_of_hydrocarbon_leads_in_seismic_images_through_artificial_and_convolutional_neural_networks","333604674_Improving_seismic_fault_detection_by_super-attribute-based_classification"]}