{"id":"350922161_A_Swaying_Between_Successive_Pandemic_Waves_and_Pandemic_Fatigue_Where_Does_Jordan_Stand","abstract":"This article highlights the main aspects of Jordan’s public health response in combating the COVID-19 pandemic. Also, it briefly describes the main characteristics of the pandemic waves. Although Jordan has successfully implemented various stringent control measures at the early stage of the pandemic which resulted in a slow pace of COVID-19 spread in the country, the dramatic and sudden surge in COVID-19 cases and deaths since September 2020 raises many concerns and questionable debates regarding the effectiveness of Jordan’s COVID- 19 mitigation strategies, the earlier epidemiological surveillance process, decision-making and decisions’ execution at various sectors, as well as the degree of commitment to precautionary measures among the general population. Jordan has passed through three distinct pandemic stages so far, and each stage provides lessons that can be used to improve the national preparedness and response plan in the future. This pandemic has afflicted most life domains; thus, sharing the responsibility and efforts between the government and people in combating it, is expected to be more efficient and effective than a one-sided response. Pandemic fatigue can act as a major risk factor for losing such a battle. The people of Jordan have been already through an unforgettable 2020 year that impacted them physically, emotionally, and even financially. Therefore, reliable actions should be considered by the decision-makers to provide sufficient support for the society. Also, strengthening the government- public partnership is a cornerstone for a successful, solid, and effective public health response, especially in times of an exhaustive pandemic crisis like the COVID-19.","authors":["Alaa B. Al-Tammemi","Zeinab Tarhini","Amal Akour"],"meta":["April 2021Annals of Medicine and Surgery 65","DOI:10.1016/j.amsu.2021.102298"],"references":["349207119_COVID-19_Vaccination_Acceptance_and_Its_Associated_Factors_Among_a_Middle_Eastern_Population","348810448_The_Battle_Against_COVID-19_in_Jordan_From_Extreme_Victory_to_Extreme_Burden","348758128_COVID-19_pandemic_response_fatigue_in_Africa_causes_consequences_and_counter-measures","348585809_Pandemic_fatigue_How_adherence_to_covid-19_regulations_has_been_misrepresented_and_why_it_matters","348408922_High_Rates_of_COVID-19_Vaccine_Hesitancy_and_Its_Association_with_Conspiracy_Beliefs_A_Study_in_Jordan_and_Kuwait_among_Other_Arab_Countries","347743934_Occupational_Burnout_and_Job_Satisfaction_Among_Physicians_in_Times_of_COVID-19_Crisis_A_Convergent_Parallel_Mixed-Method_Study","346304467_A_Proactive_Approach_for_Managing_COVID-19_The_Importance_of_Understanding_the_Motivational_Roots_of_Vaccination_Hesitancy_for_SARS-CoV2","345958666_COVID-19_pandemic_response_fatigue_in_Africa_causes_consequences_and_counter-measures","344753563_The_Impact_of_COVID-19_Pandemic_and_Emergency_Distance_Teaching_on_The_Psychological_Status_of_University_Teachers_A_Cross-Sectional_Study_in_Jordan","344711577_Is_It_Just_About_Physical_Health_An_Online_Cross-Sectional_Study_Exploring_the_Psychological_Distress_Among_University_Students_in_Jordan_in_the_Midst_of_COVID-19_Pandemic"]}