{"id":"350924221_Data_valuation_for_medical_imaging_using_Shapley_value_and_application_to_a_large-scale_chest_X-ray_dataset","abstract":"The reliability of machine learning models can be compromised when trained on low quality data. Many large-scale medical imaging datasets contain low quality labels extracted from sources such as medical reports. Moreover, images within a dataset may have heterogeneous quality due to artifacts and biases arising from equipment or measurement errors. Therefore, algorithms that can automatically identify low quality data are highly desired. In this study, we used data Shapley, a data valuation metric, to quantify the value of training data to the performance of a pneumonia detection algorithm in a large chest X-ray dataset. We characterized the effectiveness of data Shapley in identifying low quality versus valuable data for pneumonia detection. We found that removing training data with high Shapley values decreased the pneumonia detection performance, whereas removing data with low Shapley values improved the model performance. Furthermore, there were more mislabeled examples in low Shapley value data and more true pneumonia cases in high Shapley value data. Our results suggest that low Shapley value indicates mislabeled or poor quality images, whereas high Shapley value indicates data that are valuable for pneumonia detection. Our method can serve as a framework for using data Shapley to denoise large-scale medical imaging datasets.","authors":["Siyi Tang","Amirata Ghorbani","Rikiya Yamashita","Sameer Rehman"],"meta":["April 2021Scientific Reports 11(1):8366","DOI:10.1038/s41598-021-87762-2"],"references":["342332682_Deep_learning_with_noisy_labels_Exploring_techniques_and_remedies_in_medical_image_analysis","340994004_Cross-Modal_Data_Programming_Enables_Rapid_Medical_Machine_Learning","340169487_Video-based_AI_for_beat-to-beat_assessment_of_cardiac_function","337921285_MIMIC-CXR_a_de-identified_publicly_available_database_of_chest_radiographs_with_free-text_reports","336393577_Uncertainty-Aware_Self-ensembling_Model_for_Semi-supervised_3D_Left_Atrium_Segmentation","334464999_Weakly_supervised_classification_of_aortic_valve_malformations_using_unlabeled_cardiac_MRI_sequences","339345831_Preparing_Medical_Imaging_Data_for_Machine_Learning","337069071_Exploring_Large-scale_Public_Medical_Image_Datasets","336467968_GraphX_mathbfsmall_NET_-_N_E_T_-_Chest_X-Ray_Classification_Under_Extreme_Minimal_Supervision","336393721_Pancreatic_Cancer_Detection_in_Whole_Slide_Images_Using_Noisy_Label_Annotations"]}