{"id":"351073186_An_Efficient_Hybrid_Optimization_Strategy_for_Surface_Reconstruction","abstract":"An efficient surface reconstruction strategy is presented in this study, which is able to approximate non‐convex sets of target points (TPs). The approach is split in two phases: (a) the mapping phase, making use of the shape preserving method (SPM) to get a proper parametrization of each sub‐domain composing the TPs set; (b) the fitting phase, where each patch is fitted by means of a suitable non‐uniform rational basis spline (NURBS) surface by considering, as design variables, all parameters involved in its definition. To this purpose, the surface fitting problem is formulated as a constrained non‐linear programming problem (CNLPP) defined over a domain having changing dimension, wherein both the number and the value of the design variables are optimized. To deal with this CNLPP, the optimization process is split in two steps. Firstly, a special genetic algorithm (GA) optimizes both the value and the number of design variables by means of a two‐level evolution strategy (species and individuals). Secondly, the solution provided by the GA constitutes the initial guess for the deterministic optimization, which aims at improving the accuracy of the fitting surfaces. The effectiveness of the proposed methodology is proven through some meaningful benchmarks taken from the literature.","authors":["Giulia Bertolino","Marco Montemurro","Nicolas Perry","Franck Pourroy"],"meta":["April 2021Computer Graphics Forum","DOI:10.1111/cgf.14269","Project: ANR COFFA"],"references":["338148682_Structural_Displacement_Requirement_in_a_Topology_Optimization_Algorithm_Based_on_Isogeometric_Entities","333663647_A_Subspace_Method_for_Fast_Locally_Injective_Harmonic_Mapping","333468754_Minimum_length_scale_control_in_a_NURBS-based_SIMP_method","333270350_Multi-scale_shape_optimisation_of_lattice_structures_an_evolutionary-based_approach","333164621_NURBS_hyper-surfaces_for_3D_topology_optimization_problems","333087114_Maximum_length_scale_requirement_in_a_topology_optimisation_method_based_on_NURBS_hyper-surfaces","341169147_A_Metamodel_Based_on_Non-Uniform_Rational_Basis_Spline_Hyper-Surfaces_for_Optimisation_of_Composite_Structures","339539587_Non-Uniform_Rational_Basis_Spline_hyper-surfaces_for_metamodelling","333602754_A_contribution_to_the_development_of_design_strategies_for_the_optimisation_of_lightweight_structures","332216836_A_fast_numerical_solver_for_local_barycentric_coordinates"]}