{"id":"351036341_Graph_Signal_Sampling_and_Interpolation_Based_on_Clusters_and_Averages","abstract":"We consider a disjoint cover (partition) of an undirected weighted finite or infinite graph G by J connected subgraphs (clusters) {Sj}j∈J and select functions ψj on each of the clusters. For a given signal f on G the set of its weighted average values samples is defined via inner products {⟨f,ψj⟩}j∈J. The main results of the paper are based on Poincare-type inequalities that we introduce and prove. These inequalities provide an estimate of the norm of the signal f on the entire graph G from sets of samples of f and its local gradient on each of the subgraphs. This allows us to establish discrete Plancherel-Polya-type inequalities (or Marcinkiewicz-Zigmund-type or frame inequalities) for signals whose gradients satisfy a Bernstein-type inequality. These results enable the development of a sampling theory for signals on undirected weighted finite or infinite graphs. For reconstruction of the signals from their samples an interpolation theory by weighted average variational splines is developed. Here by a weighted average variational spline we understand a minimizer of a discrete Sobolev norm which takes on the prescribed weighted average values on a set of clusters (in particular, just values on a subset of vertices). Although our approach is applicable to general graphs it’s especially well suited for finite and infinite graphs with multiple clusters. Such graphs are known as community graphs and they find many important applications in materials science, engineering, computer science, economics, biology, and social studies.","authors":["Isaac Pesenson","Meyer Z. Pesenson"],"meta":["June 2021Journal of Fourier Analysis and Applications 27(3)","DOI:10.1007/s00041-021-09828-z"],"references":["344902899_A_sampling_theorem_on_homogeneous_manifolds","330567549_Average_sampling_and_average_splines_on_combinatorial_graphs","316907118_Shannon_sampling_and_an_inverse_problem_for_the_Schrodinger_equation_on_combinatorial_graphs","341919614_Interpolating_splines_on_graphs_for_data_science_applications","340067895_Reconstruction_of_bandlimited_graph_signals_from_measurements","332790594_Interpolation_and_Denoising_of_Graph_Signals_Using_Plug-and-play_Admm","324873136_Graph_Signal_Processing_Overview_Challenges_and_Applications","323867684_Numerical_Integration_on_Graphs_where_to_sample_and_how_to_weigh","320823542_Graph_sampling_with_determinantal_processes","304505751_Sampling_and_Reconstruction_of_Sparse_Signals_on_Circulant_Graphs_-_An_Introduction_to_Graph-FRI","291390879_Half_Sampling_on_Bipartite_Graphs","288179601_A_Multiscale_Pyramid_Transform_for_Graph_Signals","285270660_Spatially_Distributed_Sampling_and_Reconstruction","284096844_Random_Sampling_of_Bandlimited_Signals_on_Graphs","282000447_Subgraph-Based_Filterbanks_for_Graph_Signals"]}