{"id":"351082772_Adaptive_Stepsize_Control_for_Extrapolation_Semi-Implicit_Multistep_ODE_Solvers","abstract":"Developing new and efficient numerical integration techniques is of great importance in applied mathematics and computer science. Among the variety of available methods, multistep ODE solvers are broadly used in simulation software. Recently, semi-implicit integration proved to be an efficient compromise between implicit and explicit ODE solvers, and multiple high-performance semi-implicit methods were proposed. However, the computational efficiency of any ODE solver can be significantly increased through the introduction of an adaptive integration stepsize, but it requires the estimation of local truncation error. It is known that recently proposed extrapolation semi-implicit multistep methods (ESIMM) cannot operate with existing local truncation error (LTE) estimators, e.g., embedded methods approach, due to their specific right-hand side calculation algorithm. In this paper, we propose two different techniques for local truncation error estimation and study the performance of ESIMM methods with adaptive stepsize control. The first considered approach is based on two parallel semi-implicit solutions with different commutation orders. The second estimator, called the “double extrapolation” method, is a modification of the embedded method approach. The introduction of the double extrapolation LTE estimator allowed us to additionally increase the precision of the ESIMM solver. Using several known nonlinear systems, including stiff van der Pol oscillator, as the testbench, we explicitly show that ESIMM solvers can outperform both implicit and explicit linear multistep methods when implemented with an adaptive stepsize.","authors":["Denis Butusov"],"meta":["April 2021","DOI:10.3390/math9090950","Project: Alternative discrete operators for dynamical systems representation using low-precision data types"],"references":["342009866_Semi-Implicit_Multistep_Extrapolation_ODE_Solvers","324644683_Third_derivative_modification_of_k-step_block_Falkner_methods_for_the_numerical_solution_of_second_order_initial-value_problems","320312898_Symmetric_multistep_methods_for_charged-particle_dynamics","305649453_Extrapolation_Semi-implicit_ODE_solvers_with_adaptive_timestep","343303172_New_technique_to_quantify_chaotic_dynamics_based_on_differences_between_semi-implicit_integration_schemes","332126538_Semi-Explicit_Composition_Methods_in_Memcapacitor_Circuit_Simulation","330558165_A_Second-Order_Energy_Stable_BDF_Numerical_Scheme_for_the_Cahn-Hilliard_Equation","327765812_A_Concise_Introduction_to_Geometric_Numerical_Integration","309921903_Long_Time_Stability_of_High_Order_MultiStep_Numerical_Schemes_for_Two-Dimensional_Incompressible_Navier--Stokes_Equations","308148060_On_Relaxation_Oscillations"]}