{"id":"351073464_Highly_Cited_Papers_at_the_Spanish_Domestic_Level","abstract":"This paper presents a methodological proposal based on the identification of highly cited papers (HCPs) at domestic-level in the Spanish Public University System (SUPE), in order to find the most outstanding publications in the local context. The principal aim is to detect different activity and impact profiles among Spanish universities and differentiate those institutions that play a more significant role. To determine which and how many are the highly cited papers at the domestic level (HCP-DL) collected in the Web of Science, three citation thresholds (1, 5, and 10%) were established. Thematic classification in Incites/Essential Science Indicators areas is used. The results show a preponderance of HCPs in the field of Space Science, while the polytechnic universities have high visibility in the Computer Science area. It has been observed that the presence of HCPs in a given area is involved with universities specialized in teaching and research activities. In absolute terms, the big non-specialized universities are major producers of HCPs and hold the leading positions in our results. However, when efficiency is analyzed in relative terms, some small, specialized universities reveal themselves to be more efficient at producing HCPs (% of HCPs or citations per HCP). We think that this methodology, due to its simplicity, its ease of calculation, and the knowledge it provides, can be very useful to analyze the national systems of any country, in order to know the impact and visibility of the research carried out in its scientific institutions or research areas.","authors":["Carlos García-Zorita","Sergio Marugán","Daniela De filippo","Elías Sanz Casado"],"meta":["April 2021Frontiers in Research Metrics and Analytics 6:651991","DOI:10.3389/frma.2021.651991"],"references":["349168471_Interpreting_Bibliometric_Data","329520475_The_Norwegian_Model_in_Norway","329452250_Bibliometric_and_Altmetric_Analysis_of_Three_Social_Science_Disciplines","324558712_Author-level_metrics_in_the_new_academic_profile_platforms_The_online_behaviour_of_the_Bibliometrics_community","304005682_The_next_bibliometrics_ALMetrics_Author_Level_Metrics_and_the_multiple_faces_of_author_impact","340496555_Production_profiles_in_Brazilian_Science_with_special_attention_to_social_sciences_and_humanities","328074628_Four_pitfalls_in_normalizing_citation_indicators_An_investigation_of_ESI's_selection_of_highly_cited_papers","299222200_The_pandora's_box_of_citation_analysis_Measuring_scientific_excellence_-_The_last_evil","288006682_Rankings_ISI_de_las_Universidades_Espanolas_Segun_Campos_Cientificos_Descripcion_y_Resultados","277269232_Ranking_de_2010_en_produccion_y_productividad_en_investigacion_de_las_universidades_publicas_espanolas"]}