{"id":"351080869_The_VRNetzer_platform_enables_interactive_network_analysis_in_Virtual_Reality","abstract":"Networks provide a powerful representation of interacting components within complex systems, making them ideal for visually and analytically exploring big data. However, the size and complexity of many networks render static visualizations on typically-sized paper or screens impractical, resulting in proverbial ‘hairballs’. Here, we introduce a Virtual Reality (VR) platform that overcomes these limitations by facilitating the thorough visual, and interactive, exploration of large networks. Our platform allows maximal customization and extendibility, through the import of custom code for data analysis, integration of external databases, and design of arbitrary user interface elements, among other features. As a proof of concept, we show how our platform can be used to interactively explore genome-scale molecular networks to identify genes associated with rare diseases and understand how they might contribute to disease development. Our platform represents a general purpose, VR-based data exploration platform for large and diverse data types by providing an interface that facilitates the interaction between human intuition and state-of-the-art analysis methods.","authors":["Sebastian Pirch","Felix Mueller","Eugenia Iofinova","Julia Pazmandi"],"meta":["April 2021Nature Communications 12(1)","DOI:10.1038/s41467-021-22570-w"],"references":["347118955_The_STRING_database_in_2021_Customizable_protein-protein_networks_and_functional_characterization_of_user-uploaded_genemeasurement_sets","344152721_Graphia_A_platform_for_the_graph-based_visualisation_and_analysis_of_complex_data","343427202_VRmol_an_Integrative_Web-Based_Virtual_Reality_System_to_Explore_Macromolecular_Structure","340517712_A_reference_map_of_the_human_binary_protein_interactome","339008987_SciPy_10_fundamental_algorithms_for_scientific_computing_in_Python","337214003_Mapping_the_perturbome_network_of_cellular_perturbations","337101704_The_reactome_pathway_knowledgebase","330751894_Expansion_of_the_Human_Phenotype_Ontology_HPO_knowledge_base_and_resources","329218454_The_BioGRID_interaction_database_2019_update","329175582_Expansion_of_the_Human_Phenotype_Ontology_HPO_knowledge_base_and_resources"]}