{"id":"351068851_Coding_as_Literacy_in_Preschool_A_Case_Study","abstract":"Coding is increasingly recognized as a new literacy that should be encouraged at a young age. This understanding has recontextualized computer science as a compulsory school subject and has informed several developmentally appropriate approaches to computation, including for preschool children. This study focuses on the introduction of three approaches to computation in preschool (3–6 years), specifically computational thinking, programming, and robotics, from a cross-curricular perspective. This paper presents preliminary findings from one of the case studies currently being developed as part of project KML II—Laboratory of Technologies and Learning of Programming and Robotics for Preschool and Elementary School. The purpose of the KML II project is to characterize how approaches to computation can be integrated into preschool and elementary education, across different knowledge domains. The conclusions point to “expression and communication” as an initial framework for computational approaches in preschool, but also to multidisciplinary and more creative methodological activities that offer greater scope for the development of digital and computational competences, as well as for personal and social development.","authors":["Ana Francisca Monteiro","Maribel Santos Miranda Pinto","António José Osório"],"meta":["April 2021Education Sciences 11(198):2-15","DOI:10.3390/educsci11050198","Project: KML II - Laboratório de Tecnologias e Aprendizagem de Programação para o Pré-Escolar e 1.º Ciclo de Ensino Básico em Portugal"],"references":["350043130_CODING_AS_LITERACY_CASE_STUDIES_AT_PRE-PRIMARY_AND_ELEMENTARY_SCHOOL","348297507_SOCIAL_NETWORKS_FOR_THE_DISSEMINATION_OF_RESEARCH_PROJECTS_THE_CASE_OF_KIDS_MEDIA_LAB_2","344617098_If_You_Can_Program_You_Can_Write_Learning_Introductory_Programming_Across_Literacy_Levels","338104931_CURRICULAR_INTEGRATION_OF_COMPUTATIONAL_THINKING_PROGRAMMING_AND_ROBOTICS_IN_BASIC_EDUCATION_A_PROPOSAL_FOR_TEACHER_TRAINING","337531179_COMPUTATIONAL_THINKING_PROGRAMMING_AND_ROBOTICS_IN_BASIC_EDUCATION_EVALUATION_OF_AN_IN-SERVICE_TEACHER'S_TRAINING_B-LEARNING_EXPERIENCE","334324787_A_Systematic_Review_of_Studies_on_Educational_Robotics","346364655_Coding_at_a_crossroads","343148043_Why_computing_belongs_within_the_social_sciences","339058053_Debugging_the_Writing_Process_Lessons_From_a_Comparison_of_Students'_Coding_and_Writing_Practices","336051013_Coding_as_another_language_a_pedagogical_approach_for_teaching_computer_science_in_early_childhood"]}