{"id":"351055258_Modelos_predictivos_de_riesgo_academico_en_carreras_de_computacion_con_mineria_de_datos_educativos_Predictive_models_of_academic_risk_in_computing_careers_with_educational_data_mining","abstract":"Resumen Los problemas de bajo rendimiento académico y rezago son recurrentes en instituciones educativas de nivel superior, especialmente al inicio de los estudios universitarios. En el contexto local, análisis diagnósticos han mostrado altos índices de reprobación y bajo rendimiento académico. En este trabajo, se utilizaron datos sociodemográficos y resultados de exámenes de admisión de 415 alumnos de las carreras del área de computación de la Universidad Autónoma de Yucatán (México), inscritos entre 2016 y 2019. El objetivo es generar modelos predictivos de riesgo académico, empleando métodos de la minería de datos educativa, que sirvan como herramientas de detección temprana de condiciones de riesgo académico y faciliten el despliegue de estrategias de intervención educativa. Se siguieron las etapas del Proceso de Extracción de Conocimiento en Bases de Datos, concretamente, se aplicaron técnicas de clasificación para el análisis, obtención y validación de los modelos. Los resultados muestran que el mejor modelo corresponde al algoritmo LMT, con un valor de precisión de 75.42% y un 0.805 para el área bajo la curva ROC. Se logró identificar a los mejores atributos predictores, particularmente las pruebas del examen de ingreso a licenciatura fueron muy significativas. Se propone el desarrollo de herramientas informáticas para la detección precoz de riesgo académico y estrategias de intervención educativa oportuna. Palabras clave: minería de datos educativos, modelo predictivo, clasificación, riesgo académico, educación superior. \nAbstract The problems of poor academic performance and lag are recurrent in higher-level educational institutions, especially at the beginning of university studies. In the local context, diagnostic analyzes have shown high failure rates and low academic performance. In this work, sociodemographic data and admission exam results of 415 students of the computer science majors of the Autonomous University of Yucatán (Mexico), enrolled between 2016 and 2019, were used. The objective is to generate predictive models of academic risk, using educational data mining methods that serve as tools for early detection of academic risk conditions and facilitate the deployment of educational intervention strategies. The stages of the","authors":["Enrique Ayala Franco","Rocío Edith López Martínez","Víctor Hugo Menéndez Domínguez"],"meta":["April 2021RIED Revista Iberoamericana de Educación a Distancia 21(66):1","DOI:10.6018/red"],"references":["351104609_FACTORES_ASOCIADOS_AL_BAJO_RENDIMIENTO_ACADEMICO_DE_ESTUDIANTES_DE_PRIMER_SEMESTRE_EN_CARRERAS_DE_COMPUTACION","338717237_Predicting_Academic_Success_in_Higher_Education_Literature_Review_and_Best_Practices","334667192_Student_Academic_Performance_Prediction_using_Supervised_Learning_Techniques","333176109_Application_of_Machine_Learning_in_Predicting_Performance_for_Computer_Engineering_Students_A_Case_Study","327134062_Data_mining_techniques_applied_in_educational_environments_Literature_Review","323565574_Rendimiento_academico_en_educacion_superior_y_su_asociacion_con_la_participacion_activa_en_la_plataforma_Moodle","323437629_Diseno_de_un_modelo_para_automatizar_la_prediccion_del_rendimiento_academico_en_estudiantes_del_IPN_Design_of_a_model_to_automate_the_prediction_of_academic_performance_in_students_of_IPN","320298124_Literature_Survey_on_Student's_Performance_Prediction_in_Education_using_Data_Mining_Techniques","333561201_Factores_individuales_y_Familiares_asociados_al_bajo_rendimiento_academico_en_estudiantes_universitarios","330387714_Educational_Data_Mining_and_Learning_Analytics_for_21st_century_higher_education_A_Review_and_Synthesis","318814762_Evaluation_of_Data_Mining_Techniques_for_Predicting_Student's_Performance","318187079_Educational_data_mining_applications_and_tasks_A_survey_of_the_last_10_years","308141950_Comenzando_con_Weka_Filtrado_y_seleccion_de_subconjuntos_de_atributos_basada_en_su_relevancia_descriptiva_para_la_clase","318717358_Prediccion_del_rendimiento_academico_aplicando_tecnicas_de_mineria_de_datos","313354571_Evaluating_the_effectiveness_of_educational_data_mining_techniques_for_early_prediction_of_students'_academic_failure_in_introductory_programming_courses"]}