{"id":"351090667_Putting_It_All_Together_Combining_Learning_Analytics_Methods_and_Data_Sources_to_Understand_Students'_Approaches_to_Learning_Programming","abstract":"Learning programming is a complex and challenging task for many students. It involves both understanding theoretical concepts and acquiring practical skills. Hence, analyzing learners' data from online learning environments alone fails to capture the full breadth of students' actions if part of their learning process takes place elsewhere. Moreover, existing studies on learning analytics applied to programming education have mainly relied on frequency analysis to classify students according to their approach to programming or to predict academic achievement. However, frequency analysis provides limited insights into the individual time-related characteristics of the learning process. The current study examines students' strategies when learning programming, combining data from the learning management system and from an automated assessment tool used to support students while solving the programming assignments. The study included the data of 292 engineering students (228 men and 64 women, aged 20-26) from the two aforementioned sources. To gain an in-depth understanding of students' learning process as well as of the types of learners, we used learning analytics methods that account for the temporal order of learning actions. Our results show that students have special preferences for specific learning resources when learning programming, namely, slides that support search, and copy and paste. We also found that videos are relatively less consumed by students, especially while working on programming assignments. Lastly, students resort to course forums to seek help only when they struggle.","authors":["Sonsoles López-Pernas","Mohammed Saqr","Olga Viberg"],"meta":["April 2021Sustainability 13(19):4825","DOI:10.3390/su13094825"],"references":["349809442_Escapp_A_Web_Platform_for_Conducting_Educational_Escape_Rooms","346283842_Analysis_of_Learning_Behavior_in_an_Automated_Programming_Assessment_Environment_A_Code_Quality_Perspective","345245081_Analytics_of_Learning_Strategies_Role_of_Course_Design_and_Delivery_Modality","344227884_Automated_Assessment_in_Programming_Courses_A_Case_Study_during_the_COVID-19_Era","343657926_Applying_Learning_Analytics_to_Map_Students'_Self-Regulated_Learning_Tactics_in_an_Academic_Writing_Course","339921424_Analytics_of_time_management_and_learning_strategies_for_effective_online_learning_in_blended_environments","339842915_A_Research_Agenda_for_the_Why_What_and_How_of_Gamification_Designs_-_Results_on_an_ECIS_2019_Panel","348631398_University_students'_interaction_Internet_self-efficacy_self-regulation_and_satisfaction_with_online_education_during_pandemic_crises_of_COVID-19_SARS-CoV-2","341530646_Using_learning_analytics_in_the_Amazonas_understanding_students'_behaviour_in_introductory_programming","339917440_Supporting_actionable_intelligence_reframing_the_analysis_of_observed_study_strategies"]}