{"id":"351065198_LCZ_Generator_A_Web_Application_to_Create_Local_Climate_Zone_Maps","abstract":"Since their introduction in 2012, Local Climate Zones (LCZs) emerged as a new standard for characterizing urban landscapes, providing a holistic classification approach that takes into account micro-scale land-cover and associated physical properties. In 2015, as part of the community-based World Urban Database and Access Portal Tools (WUDAPT) project, a protocol was developed that enables the mapping of cities into LCZs, using freely available data and software packages, yet performed on local computing facilities. The LCZ Generator described here further simplifies this process, providing an online platform that maps a city of interest into LCZs, solely expecting a valid training area file and some metadata as input. The web application (available at https://lcz-generator.rub.de ) integrates the state-of-the-art of LCZ mapping, and simultaneously provides an automated accuracy assessment, training data derivatives, and a novel approach to identify suspicious training areas. As this contribution explains all front- and back-end procedures, databases, and underlying datasets in detail, it serves as the primary “User Guide” for this web application. We anticipate this development will significantly ease the workflow of researchers and practitioners interested in using the LCZ framework for a variety of urban-induced human and environmental impacts. In addition, this development will ease the accessibility and dissemination of maps and their metadata.","authors":["Matthias Demuzere","Jonas Kittner","Benjamin Bechtel"],"meta":["April 2021Frontiers in Environmental Science 9","DOI:10.3389/fenvs.2021.637455","Project: World Urban Database and Access Portal Tools (WUDAPT)"],"references":["348756122_Numerical_modelling_for_analysis_of_the_effect_of_different_urban_green_spaces_on_urban_heat_load_patterns_in_the_present_and_in_the_future","346964295_Impact_of_Urban_Canopy_Parameters_on_a_Megacity's_Modelled_Thermal_Environment","345924250_Can_we_use_Local_Climate_Zones_for_predicting_malaria_prevalence_across_sub-Saharan_African_cities","344473993_Estimating_quality_of_life_dimensions_from_urban_spatial_pattern_metrics","343577448_Combining_expert_and_crowd-_sourced_training_data_to_map_urban_form_and_functions_for_the_continental_US","344957412_Object-based_image_analysis_to_map_local_climate_zones_The_case_of_Bandung_Indonesia","344622560_Estimating_Building's_Anthropogenic_Heat_-a_joint_Local_Climate_Zone_and_Land_Use_Classification_method","343397238_Characterization_of_Local_Climate_Zones_Using_ENVI-met_and_Site_Data_in_the_City_of_Al-Ain_UAE","342697374_Mapping_local_climate_zones_for_a_Japanese_large_city_by_an_extended_workflow_of_WUDAPT_Level_0_method","341942857_Local_climate_zones_in_five_southern_European_cities_An_improved_GIS-based_classification_method_based_on_Copernicus_data"]}