{"id":"351110779_Towards_community-driven_metadata_standards_for_light_microscopy_tiered_specifications_extending_the_OME_model","abstract":"1 -\n\nABSTRACT\nDigital light microscopy provides powerful tools for quantitatively probing the real-time dynamics of subcellular structures. While the power of modern microscopy techniques is undeniable, rigorous record-keeping and quality control are required to ensure that imaging data may be properly interpreted ( quality ), reproduced ( reproducibility ), and used to extract reliable information and scientific knowledge which can be shared for further analysis ( value ). Keeping notes on microscopy experiments and quality control procedures ought to be straightforward, as the microscope is a machine whose components are defined and the performance measurable. Nevertheless, to this date, no universally adopted community-driven specifications exist that delineate the required information about the microscope hardware and acquisition settings (i.e., microscopy “data provenance” metadata) and the minimally accepted calibration metrics (i.e., microscopy quality control metadata) that should be automatically recorded by both commercial microscope manufacturers and customized microscope developers. In the absence of agreed guidelines, it is inherently difficult for scientists to create comprehensive records of imaging experiments and ensure the quality of resulting image data or for manufacturers to incorporate standardized reporting and performance metrics. To add to the confusion, microscopy experiments vary greatly in aim and complexity, ranging from purely descriptive work to complex, quantitative and even sub-resolution studies that require more detailed reporting and quality control measures.\nTo solve this problem, the 4D N ucleome Initiative (4DN) ( 1, 2 ) Imaging Standards Working Group (IWG), working in conjunction with the B io I maging N orth A merica (BINA) Quality Control and Data Management Working Group (QC-DM-WG) ( 3 ), here propose light Microscopy Metadata specifications that scale with experimental intent and with the complexity of the instrumentation and analytical requirements. They consist of a revision of the Core of the Open Microscopy Environment (OME) Data Model, which forms the basis for the widely adopted Bio-Formats library ( 4 – 6 ), accompanied by a suite of three extensions, each with three tiers, allowing the classification of imaging experiments into levels of increasing imaging and analytical complexity ( 7, 8 ). Hence these specifications not only provide an OME-based comprehensive set of metadata elements that should be recorded, but they also specify which subset of the full list should be recorded for a given experimental tier. In order to evaluate the extent of community interest, an extensive outreach effort was conducted to present the proposed metadata specifications to members of several core-facilities and international bioimaging initiatives including the E uropean L ight M icroscopy I nitiative (ELMI), G lobal B io I maging (GBI), and E uropean M olecular B iology L aboratory (EMBL) - E uropean B ioinformatics I nstitute (EBI). Consequently, close ties were established between our endeavour and the undertakings of the recently established QUA lity Assessment and REP roducibility for Instruments and Images in Li ght Mi croscopy global community initiative ( 9 ). As a result this flexible 4D N - B INA- O ME (NBO namespace) framework ( 7, 8 ) represents a turning point towards achieving community-driven Microscopy Metadata standards that will increase data fidelity, improve repeatability and reproducibility, ease future analysis and facilitate the verifiable comparison of different datasets, experimental setups, and assays, and it demonstrates the method for future extensions. Such universally accepted microscopy standards would serve a similar purpose as the Encode guidelines successfully adopted by the genomic community ( 10, 11 ). The intention of this proposal is therefore to encourage participation, critiques and contributions from the entire imaging community and all stakeholders, including research and imaging scientists, facility personnel, instrument manufacturers, software developers, standards organizations, scientific publishers, and funders.","authors":["Mathias Hammer","Maximiliaan Huisman","Alex Rigano","Ulrike Boehm"],"meta":["April 2021","DOI:10.1101/2021.04.25.441198"],"references":["350553616_OME-NGFF_scalable_format_strategies_for_interoperable_bioimaging_data","348907267_QUAREP-LiMi_A_community-driven_initiative_to_establish_guidelines_for_quality_assessment_and_reproducibility_for_instruments_and_images_in_light_microscopy","348702580_Reproducible_image_handling_and_analysis","347811196_Robust_integrated_intracellular_organization_of_the_human_iPS_cell_where_how_much_and_how_variable","356715954_A_perspective_on_Microscopy_Metadata_data_provenance_and_quality_control_preprint","355201283_The_4D_Nucleome_Project","352202273_Best_practices_and_tools_for_reporting_reproducible_fluorescence_microscopy_methods","351784765_QUAREP-LiMi_a_community_endeavor_to_advance_quality_assessment_and_reproducibility_in_light_microscopy","350509656_A_guide_to_accurate_reporting_in_digital_image_processing_-_can_anyone_reproduce_your_quantitative_analysis","350506096_A_guide_to_accurate_reporting_in_digital_image_acquisition_-_can_anyone_replicate_your_microscopy_data"]}