{"id":"351154158_Uso_do_aplicativo_MIT_app_inventor_na_aprendizagem_de_programacao_uma_revisao_sistematica_da_literatura_entre_2011_e_2020","abstract":"RESUMO A aprendizagem da programação envolve a compreensão de um conjunto de teorias, práticas e o conhecimento sobre paradigmas, sintaxes e semânticas das linguagens, competências de raciocínio lógico, matemático e abstrato e algorítmico. Estes aspetos tornam a aprendizagem difícil para os alunos inciantes, sendo uma disciplina com elevadas taxas de reprovação e evasão. Vários estudos têm apontado os ambientes de programação visual e por blocos como ferramentas que podem ajudar a ultrapassar algumas das barreiras inicias. Este artigo apresenta uma Revisão Sistemática da Literatura sobre a utilização do ambiente de programação por blocos MIT App Inventor no ensino e aprendizagem de programação. Para tal, desenvolveu-se uma pesquisa sistemática de artigos publicados, entre 2011 e 2020, em seis das principais bases de dados relacionadas com as ciências da computação e educação. Os resultados dos 10 artigos analisados salientaram as potencialidades do ambiente para a aprendizagem de conceitos de programação e revelaram, igualmente, a falta de estudos experimentais que analisem o efeito da sua utilização na aprendizagem e na motivação dos alunos. Palavras-chave: Ambiente de programação por blocos. Aprendizagem de programação. MIT app inventor. Revisão sistemática.","authors":["Rosana Gomes Costa","João Piedade"],"meta":["April 2021REVISTA INTERSABERES 16(37):160-177","DOI:10.22169/revint.v16i37.2120"],"references":["334431513_A_Cross-analysis_of_Block-based_and_Visual_Programming_Apps_with_Computer_Science_Student-Teachers","329710744_Levantamento_sobre_as_dificuldades_dos_discentes_nas_disciplinas_de_Programacao_no_curso_tecnico_de_Informatica","329038384_Improving_students'_understanding_of_basic_programming_concepts_through_visual_programming_language_The_role_of_self-efficacy","290190169_Diversifying_Activities_to_Improve_Student_Performance_in_Programming_Courses","287607767_Mobile_App_Design_for_Teaching_and_Learning_Educators'_Experiences_in_an_Online_Graduate_Course","324762596_CodeMaster_-_Automatic_Assessment_and_Grading_of_App_Inventor_and_Snap_Programs","269724670_Supporting_all_learners_in_school-wide_computational_thinking_A_cross-case_qualitative_analysis","262326946_Creative_thinking_in_digital_game_design_and_development_A_case_study"]}