{"id":"351133230_Computational_Thinking_Between_Papert_and_Wing","abstract":"The pervasiveness of Computer Science (CS) in today’s digital society and the extensive use of computational methods in other sciences call for its introduction in the school curriculum. Hence, Computer Science Education is becoming more and more relevant. In CS K-12 education, computational thinking (CT) is one of the abused buzzwords: different stakeholders (media, educators, politicians) give it different meanings, some more oriented to CS, others more linked to its interdisciplinary value. The expression was introduced by two leading researchers, Jeannette Wing (in 2006) and Seymour Papert (much early, in 1980), each of them stressing different aspects of a common theme. This paper will use a historical approach to review, discuss, and put in context these first two educational and epistemological approaches to CT. We will relate them to today’s context and evaluate what aspects are still relevant for CS K-12 education. Of the two, particular interest is devoted to “Papert’s CT,” which is the lesser-known and the lesser-studied. We will conclude that “Wing’s CT” and “Papert’s CT,” when correctly understood, are both relevant to today’s computer science education. From Wing, we should retain computer science’s centrality, CT being the (scientific and cultural) substratum of the technical competencies. Under this interpretation, CT is a lens and a set of categories for understanding the algorithmic fabric of today’s world. From Papert, we should retain the constructionist idea that only a social and affective involvement of students into the technical content will make programming an interdisciplinary tool for learning (also) other disciplines. We will also discuss the often quoted (and often unverified) claim that CT automatically “transfers” to other broad 21st century skills. Our analysis will be relevant for educators and scholars to recognize and avoid misconceptions and build on the two core roots of CT.","authors":["Michael Lodi","Simone Martini"],"meta":["August 2021Science & Education 30(4)","DOI:10.1007/s11191-021-00202-5"],"references":["331402669_On_Thinking_and_STEM_Education","331292292_From_computational_thinking_to_computational_action","345392952_Computational_Thinking","344978607_Informatical_Thinking","342426146_Computer_Science_in_K-12_An_A-Z_Handbook_on_Teaching_Programing","339243615_From_theory_bias_to_theory_dialogue_embracing_cognitive_situated_and_critical_framings_of_computational_thinking_in_K-12_CS_education","337591653_Constructing_Computational_Thinking_Without_Using_Computers","336787634_Computational_thinking_should_just_be_good_thinking","335045104_Transitioning_from_introductory_block-based_and_text-based_environments_to_professional_programming_languages_in_high_school_computer_science_classrooms","334966880_Computer_Science_in_K-12_Education_The_Big_Picture"]}