{"id":"351104433_Kmap_Solver_um_aplicativo_movel_gratuito_para_o_ensino_de_simplificacoes_pelo_mapa_de_Karnaugh","abstract":"O objetivo deste trabalho é documentar o desenvolvimento de um aplicativo didático para o Google Android - sistema operacional para dispositivos móveis -, capaz de resolver expressões lógicas de até cinco variáveis, mostrando soluções obtidas por meio de mapas de Karnaugh. O mapa de Karnaugh é um método tradicional de simplificação de expressões booleanas que permite, a partir de uma visualização gráfica, encontrar variáveis comuns entre termos, minimizando-os. Apesar de simples, aprender competentemente a técnica operatória do mapa requer treino e exemplos com diversas combinações das variáveis de entrada, o que é propiciado nesse aplicativo. A pesquisa realizada a partir das avaliações obtidas no Google Play revelou que existe interesse de alunos e professores na utilização do aplicativo como suporte didático em aulas de ciência da computação, eletrônica e outras áreas afins, tanto em nível médio técnico como em nível superior. A partir das sugestões coletadas na pesquisa, almejam-se, num trabalho próximo, adaptações do algoritmo utilizado, tornando-o mais versátil, de forma que ele possa ser aplicado a disciplinas mais instrumentais, como Álgebra I. Além disso, o próprio desenvolvimento do algoritmo aqui apresentado representa um ótimo exercício para o ensino de lógica de programação, além da própria lógica booleana.\nPALAVRAS-CHAVE: Aplicativo para Android. Expressões lógicas. Mapa de Karnaugh. Ensino de lógica.","authors":["Adriano Martins Moutinho","José Carlos Andrades","José Fernandes Pereira","Jose Antonio Fontes de Carvalho Ribeiro Rodrigues"],"meta":["January 2021Revista Brasileira de Ensino de Ciência e Tecnologia 14(1):58-78","DOI:10.3895/rbect.v14n1.11585"],"references":["336136994_Ensino_de_programacao_trajetoria_historico-social_e_os_avancos_na_cultura_digital_do_Brasil","302206108_The_Problem_of_Simplifying_Truth_Functions","247126247_Pedagogia_da_Autonomia-saberes_necessmanrios_biao_prmantica_educativa"]}