{"id":"351184135_Artificial_Intelligence_A_Survey_on_Evolution_and_Future_Trends","abstract":"Today, the world has heard a lot about artificial intelligence (AI) and its influence in accomplishing responsibilities, and it has become famous through films, series TV and social networking sites. Artificial Intelligence (AI) is a combination of algorithms and techniques developed by developers and programmers to build metal bodies that can work for centuries with individuals. Despite the interest of everyone in this topic and its spread significantly, most people do not have adequate knowledge and understanding of this science. This science is considered as one of the essential topics in computer sciences and engineering. In this article, it has been decided to write an overview on the topic of artificial intelligence and understand how its ideas started and spread universally. In addition, there is a review of Expert Systems, Artificial Neural Networks, Fuzzy Logic, and AI applications in the medical field and power systems, especially in investigating lung images of people with COVID-19. The idea presented in this article is that the future will soon come when humans and machines will merge into cyborgs or cybernetic creatures, and they will work together when completing tasks. This idea is described as transhumanism.","authors":["Maad M. Mijwil","Rana Abttan"],"meta":["April 2021Asian Journal of Applied Sciences 9(2):87-93","DOI:10.24203/ajas.v9i2.6589"],"references":["345992279_Artificial_intelligence_The_technology_challenges_and_applications","338723814_Fundamentals_of_Recurrent_Neural_Network_RNN_and_Long_Short-Term_Memory_LSTM_network","338516289_Application_of_artificial_neural_networks_for_automated_analysis_of_cystoscopic_images_a_review_of_the_current_status_and_future_prospects","337832409_Multiple_Fault_Detection_Classification_and_Location_in_Electric_Power_Transmission_Lines_in_Matlab_Environment","337300503_Two-Dimensional_Optical_Character_Recognition_of_Mouse_Drawn_in_Turkish_Capital_Letters_Using_Multi-Layer_Perceptron_Classification","336430543_How_artificial_intelligence_will_change_the_future_of_marketing","336304381_An_Optimized_Architecture_of_Image_Classification_Using_Convolutional_Neural_Network","333523357_Artificial_Intelligence_and_the_Implementation_Challenge_Preprint","342598724_Feedforward_Neural_Networks","334177223_Machine_Learning_for_Health_Services_Researchers"]}