{"id":"351221547_Spotting_Football_Events_Using_Two-Stream_Convolutional_Neural_Network_and_Dilated_Recurrent_Neural_Network","abstract":"This paper addresses the problem of event detection and localization in long football (soccer) videos. Our key idea is that understanding the long-range dependencies between video frames is imperative for accurate event localization in long football videos. Additionally, proper event detection is not likely for fast movements in football videos without considering mid-range and short-range correlations between neighboring video frames. We argue that event spotting can be considerably improved by considering short-range to long-range frame dependencies in a unified architecture. To model long-range and mid-range dependencies, we propose to use the dilated recurrent neural network (DilatedRNN) with long short-term memory (LSTM) units, grounded on two-stream convolutional neural network (Two-stream CNN) features. While two-stream CNN extracts local spatiotemporal features necessary for fine-level details, the DilatedRNN makes the information obtained from distant frames available for the classifier and spotting algorithms. Evaluating our event spotting algorithm on the largest publicly available benchmark football dataset –SoccerNet– shows an accuracy improvement of 0.8% - 13.6% compared to state of the art, and up to 30.1% accuracy gain in comparison to the baselines. We also investigate the contribution of each neural network component in spotting accuracy through an extensive ablation study.","authors":["Behzad Mahaseni","Erma Rahayu","Ram Gopal Raj"],"meta":["January 2021IEEE Access 9:61929-61942","DOI:10.1109/ACCESS.2021.3074831"],"references":["329751327_SoccerNet_A_Scalable_Dataset_for_Action_Spotting_in_Soccer_Videos","329748362_Actor_and_Action_Video_Segmentation_from_a_Sentence","322498470_Real-world_Anomaly_Detection_in_Surveillance_Videos","343456675_A_Context-Aware_Loss_Function_for_Action_Spotting_in_Soccer_Videos","343276285_Event_detection_in_coarsely_annotated_sports_videos_via_parallel_multi_receptive_field_1D_convolutions","339562382_Video_Classification_With_Channel-Separated_Convolutional_Networks","337296155_Online_Aggregated-Event_Representation_for_Multiple_Event_Detection_in_Videos","336152062_Two-Stream_Convolution_Neural_Network_with_Video-stream_for_Action_Recognition","333702196_Two-Stream_Region_Convolutional_3D_Network_for_Temporal_Activity_Detection","322647613_Attending_to_Distinctive_Moments_Weakly-Supervised_Attention_Models_for_Action_Localization_in_Video"]}