{"id":"351246363_COVID-Nets_Deep_CNN_Architectures_for_Detecting_COVID-19_Using_Chest_CT_Scans","abstract":"This paper introduces two novel deep convolutional neural network (CNN) architectures for automated detection of COVID-19. The first model, CovidResNet, is inspired by the deep residual network (ResNet) architecture. The second model, CovidDenseNet, exploits the power of densely connected convolutional networks (DenseNet). The proposed networks are designed to provide fast and accurate diagnosis of COVID-19 using computed tomography (CT) images for the multi-class and binary classification tasks. The architectures are utilized in a first experimental study on the SARS-CoV-2 CT-scan dataset, which contains 4173 CT images for 210 subjects structured in a subject-wise manner for three different classes. First, we train and test the networks to differentiate COVID-19, non-COVID-19 viral infections, and healthy. Second, we train and test the networks on binary classification with three different scenarios: COVID-19 vs. healthy, COVID-19 vs. other non-COVID-19 viral pneumonia, and non-COVID-19 viral pneumonia vs. healthy. Our proposed models achieve up to 93.96% accuracy, 99.13% precision, 94% sensitivity, 97.73% specificity, and a 95.80% F1-score for binary classification, and up to 83.89% accuracy, 80.36% precision, 82% sensitivity, 92% specificity, and a 81% F1-score for the three-class classification tasks. The experimental results reveal the validity and effectiveness of the proposed networks in automated COVID-19 detection. The proposed models also outperform the baseline ResNet and DenseNet architectures while being more efficient.","authors":["Hammam Alshazly","Christoph Linse","Mohamed Abdalla Abul-Dahab","Erhardt Barth"],"meta":["April 2021","DOI:10.1101/2021.04.19.21255763","Project: COVID-19 Detection"],"references":["352019043_Coronavirus_Covid-19_Classification_Using_CT_Images_by_Machine_Learning_Methods","351916706_An_Optimized_Transfer_Learning-based_Approach_for_Automatic_Diagnosis_of_COVID-19_from_Chest_X-ray_Images","349139854_Densely_connected_convolutional_networks-based_COVID-19_screening_model","348225382_Pneumonia_Classification_Using_Deep_Learning_from_Chest_X-ray_Images_During_COVID-19","349447922_Large-scale_screening_of_COVID-19_from_community_acquired_pneumonia_using_infection_size-aware_classification","349342717_CoVNet-19_A_Deep_Learning_model_for_the_detection_and_analysis_of_COVID-19_patients","349114611_DeepCoroNet_A_deep_LSTM_approach_for_automated_detection_of_COVID-19_cases_from_chest_X-ray_images","349088086_Covid_CT-net_A_deep_learning_framework_for_COVID-19_prognosis_using_CT_images","348531605_RLDD_An_Advanced_Residual_Learning_Diagnosis_Detection_System_for_COVID-19_in_IIoT","348137582_COVID-ResNet_A_Deep_Learning_Framework_for_Screening_of_COVID19_from_Radiographs"]}