{"id":"351227910_Review_of_Automatic_Micro-Expression_Recognition_in_the_Past_Decade","abstract":"Facial expressions provide important information concerning one’s emotional state. Unlike regular facial expressions, micro-expressions are particular kinds of small quick facial movements, which generally last only 0.05 to 0.2 seconds. They reflect individuals’ subjective emotions and real psychological states more accurately than regular expressions which can be acted. However, the small range and short duration of facial movements when micro-expressions happen make them challenging to recognize both by humans and machines alike. In the past decade, automatic micro-expression recognition has attracted the attention of researchers in psychology, computer science, and security, amongst others. Also, a number of specialized micro-expression databases have been collected and made publicly available. The purpose of this article is to provide a comprehensive overview of the current state of the art automatic facial micro-expression recognition work. To be specific, the features and learning methods using in automatic micro-expression recognition, the existing micro-expression data sets, the major outstanding challenges, as well as possible future development directions are all discussed.","authors":["Liangfei Zhang","Ognjen Arandjelovic"],"meta":["April 2021","DOI:10.3390/make3020021"],"references":["349594225_Review_of_micro-expression_spotting_and_recognition_in_video_sequences","342148313_Micro-Attention_for_Micro-Expression_Recognition","340579657_Quantification_of_Advanced_Dementia_Patients'_Engagement_in_Therapeutic_Sessions_An_Automatic_Video_Based_Approach_using_Computer_Vision_and_Machine_Learning","334425302_Shallow_Triple_Stream_Three-dimensional_CNN_STSTNet_for_Micro-expression_Recognition","334416955_A_Novel_Apex-Time_Network_for_Cross-Dataset_Micro-Expression_Recognition","346184729_AU-assisted_Graph_Attention_Convolutional_Network_for_Micro-Expression_Recognition","345217111_Emotion_recognition_using_fixed_length_micro-expressions_sequence_and_weighting_method","334427846_Dual-Inception_Network_for_Cross-Database_Micro-Expression_Recognition","334425175_CapsuleNet_for_Micro-Expression_Recognition","334425071_A_Neural_Micro-Expression_Recognizer"]}