{"id":"351317283_Secure_multiparty_quantum_key_agreement_against_collusive_attacks","abstract":"Quantum key agreement enables remote participants to fairly establish a secure shared key based on their private inputs. In the circular-type multiparty quantum key agreement mode, two or more malicious participants can collude together to steal private inputs of honest participants or to generate the final key alone. In this work, we focus on a powerful collusive attack strategy in which two or more malicious participants in particular positions, can learn sensitive information or generate the final key alone without revealing their malicious behaviour. Many of the current circular-type multiparty quantum key agreement protocols are not secure against this collusive attack strategy. As an example, we analyze the security of a recently proposed multiparty key agreement protocol to show the vulnerability of existing circular-type multiparty quantum key agreement protocols against this collusive attack. Moreover, we design a general secure multiparty key agreement model that would remove this vulnerability from such circular-type key agreement protocols and describe the necessary steps to implement this model. The proposed model is general and does not depend on the specific physical implementation of the quantum key agreement.","authors":["Hussein Abulkasim","Atefeh Atty Mashatan","Shohini Ghose"],"meta":["May 2021Scientific Reports 11(1)","DOI:10.1038/s41598-021-88837-w"],"references":["338561989_Quantum_Signature_of_a_Squeezed_Mechanical_Oscillator","337602622_Secure_dynamic_multiparty_quantum_private_comparison","337394593_New_Fair_Multiparty_Quantum_Key_Agreement_Secure_against_Collusive_Attacks","336905276_Improvement_on_'Multiparty_Quantum_Key_Agreement_with_Four-Qubit_Symmetric_W_State'","335820984_Designing_Secure_Quantum_Key_Agreement_Protocols_Against_Dishonest_Participants","334752478_Efficient_Multiparty_Quantum_Key_Agreement_With_a_Single_d_-Level_Quantum_System_Secure_Against_Collusive_Attack","333864339_Multi-party_quantum_key_agreement_with_four-qubit_cluster_states","333220162_Privacy-preserving_Quantum_Sealed-bid_Auction_Based_on_Grover's_Search_Algorithm","339379383_A_Verifiable_Multiparty_Quantum_Key_Agreement_Based_on_Bivariate_Polynomial","339021379_Continuous-variable_multiparty_quantum_key_agreement_based_on_third_party"]}