{"id":"351373031_Toward_a_richer_understanding_of_human_cognition_Unleashing_the_full_potential_of_the_concurrent_information-processing_paradigm","abstract":"One of the most influential working hypotheses in psychology, to this day, is that human information processing in higher-order cognition (e.g., judgment and decision-making) is constrained by having to process objects serially, one at a time. However, a rather large body of research, accumulated over the past 50 years, has demonstrated that serial-processing models provide a poor descriptive account of human information processing. An alternate to the serial-processing view is that people can process information concurrently; many cognitive processes can advance independently of each other even if the system involves only a single central information-processing unit (i.e., central executive). Perhaps this general idea can be advanced beyond its present standing and is to provide new powerful tools in the pursuit of understanding human behavior. To this end, the article provides a review of (i) the conceptual differences between different types of processing (serial, concurrent, parallel), (ii) recent advancements in the field of computer science, and (iii) existing research on human information-processing, which is in line with the advancements in computer science. Finally, the article provides a discussion of outstanding research questions gleaned from these reviews-questions that could stimulate entirely new research programs.","authors":["Philip Millroth"],"meta":["December 2021New Ideas in Psychology 63(4):100873","DOI:10.1016/j.newideapsych.2021.100873"],"references":["337070481_How_to_Explain_Behavior","335512140_Consciousness_Is_Not_Key_in_the_Serial-versus-Parallel_Debate","334765848_Pseudo-mechanistic_Explanations_in_Psychology_and_Cognitive_Neuroscience","342718772_Components_of_attentional_effort_for_repeated_tasks","338873720_The_association_between_dual-task_walking_and_counting_responses_and_cognitive_function_and_disability_after_severe_head_injury_A_preliminary_study","335507403_You_Can't_Recognize_Two_Words_Simultaneously","335003304_On_the_simplicity_of_simple_heuristics","334033958_Components_of_Effort_for_Repeated_Tasks","332442283_Forward_inference_in_risky_choice_Mapping_gaze_and_decision_processes","327118871_Cognitive_computational_neuroscience"]}