{"id":"351355809_Co-design_of_mini_games_for_learning_computational_thinking_in_an_online_environment","abstract":"Understanding the principles of computational thinking (CT), e.g., problem abstraction, decomposition, and recursion, is vital for computer science (CS) students. Unfortunately, these concepts can be difficult for novice students to understand. One way students can develop CT skills is to involve them in the design of an application to teach CT. This study focuses on co-designing mini games to support teaching and learning CT principles and concepts in an online environment. Online co-design (OCD) of mini games enhances students’ understanding of problem-solving through a rigorous process of designing contextual educational games to aid their own learning. Given the current COVID-19 pandemic, where face-to-face co-designing between researchers and stakeholders could be difficult, OCD is a suitable option. CS students in a Nigerian higher education institution were recruited to co-design mini games with researchers. Mixed research methods comprising qualitative and quantitative strategies were employed in this study. Findings show that the participants gained relevant knowledge, for example, how to (i) create game scenarios and game elements related to CT, (ii) connect contextual storyline to mini games, (iii) collaborate in a group to create contextual low-fidelity mini game prototypes, and (iv) peer review each other’s mini game concepts. In addition, students were motivated toward designing educational mini games in their future studies. This study also demonstrates how to conduct OCD with students, presents lesson learned, and provides recommendations based on the authors’ experience.","authors":["Agbo Friday Joseph","Solomon Sunday Oyelere","Jarkko Suhonen","Teemu Laine"],"meta":["September 2021Education and Information Technologies 26(2):1-35","DOI:10.1007/s10639-021-10515-1"],"references":["354343538_Science_Teacher's_Self-Confidence_on_Integrating_Computational_Thinking_into_Classroom_Pedagogies_for_Teaching_and_Learning","350740410_The_impact_of_Worms_and_Ladders_an_innovative_health_educational_board_game_on_Soil-Transmitted_Helminthiasis_control_in_Abeokuta_Southwest_Nigeria","346028652_FIRST_Principles_to_Design_for_Online_Synchronous_High_School_CS_Teacher_Training_and_Curriculum_Co-Design","341070470_Social_Media_Usage_for_Computing_Education_The_Effect_of_Tie_Strength_and_Group_Communication_on_Perceived_Learning_Outcome","350150939_Investigating_Network_Performance_of_a_Multi-user_Virtual_Reality_Environment_for_Mining_Education","347373232_A_UML_approach_for_designing_a_VR-based_smart_learning_environment_for_programming_education","344931353_A_Distributed_Multiplayer_Game_to_Promote_Active_Transport_at_Workplaces_User-Centred_Design_Implementation_and_Lessons_Learned","344218566_Designing_Mini-Games_for_Micro-Learning_Open_Educational_Resources_on_Cultural_Risks_in_Multi-Cultural_Organisations","343436910_Co-Designing_Machine_Learning_Apps_in_K-12_With_Primary_School_Children","340659698_Digital_games_developing_democracies_and_civic_engagement_a_study_of_games_in_Kenya_and_Nigeria"]}