{"id":"351300489_Robust_implementation_of_generative_modeling_with_parametrized_quantum_circuits","abstract":"Although the performance of hybrid quantum-classical algorithms is highly dependent on the selection of the classical optimizer and the circuit ansätze (Benedetti et al, npj Quantum Inf 5:45, 2019; Hamilton et al, 2018; Zhu et al, 2018), a robust and thorough assessment on-hardware of such features has been missing to date. From the optimizer perspective, the primary challenge lies in the solver’s stochastic nature, and their significant variance over the random initialization. Therefore, a robust comparison requires one to perform several training curves for each solver before one can reach conclusions about their typical performance. Since each of the training curves requires the execution of thousands of quantum circuits in the quantum computer, such a robust study remained a steep challenge for most hybrid platforms available today. Here, we leverage on Rigetti’s Quantum Cloud Services (QCS™) to overcome this implementation barrier, and we study the on-hardware performance of the data-driven quantum circuit learning (DDQCL) for three different state-of-the-art classical solvers, and on two-different circuit ansätze associated to different entangling connectivity graphs for the same task. Additionally, we assess the gains in performance from varying circuit depths. To evaluate the typical performance associated with each of these settings in this benchmark study, we use at least five independent runs of DDQCL towards the generation of quantum generative models capable of capturing the patterns of the canonical Bars and Stripes dataset. In this experimental benchmarking, the gradient-free optimization algorithms show an outstanding performance compared to the gradient-based solver. In particular, one of them had better performance when handling the unavoidable noisy objective function to be minimized under experimental conditions.","authors":["Vicente Leyton-Ortega","Alejandro Perdomo-Ortiz","Oscar Perdomo"],"meta":["June 2021Quantum Machine Intelligence 3(1)","DOI:10.1007/s42484-021-00040-2"],"references":["350192046_Cost_function_dependent_barren_plateaus_in_shallow_parametrized_quantum_circuits","349759674_Entanglement_types_for_two-qubit_states_with_real_amplitudes","341141380_Classical_versus_quantum_models_in_machine_learning_insights_from_a_finance_application","336656301_Training_of_quantum_circuits_on_a_hybrid_quantum_computer","324104887_Barren_plateaus_in_quantum_neural_network_training_landscapes","322675079_A_generative_modeling_approach_for_benchmarking_and_training_shallow_quantum_circuits","322674855_Fast_and_Unconditional_All-Microwave_Reset_of_a_Superconducting_Qubit","347641038_Quantum_versus_Classical_Generative_Modelling_in_Finance","333865331_Generative_model_benchmarks_for_superconducting_qubits","324492525_Differentiable_Learning_of_Quantum_Circuit_Born_Machine","322419167_Cloud_Quantum_Computing_of_an_Atomic_Nucleus","322221592_ZOOptZOOjl_Toolbox_for_Derivative-Free_Optimization","281896299_The_theory_of_variational_hybrid_quantum-classical_algorithms","319683740_Hardware-efficient_variational_quantum_eigensolver_for_small_molecules_and_quantum_magnets","269935079_Adam_A_Method_for_Stochastic_Optimization"]}