{"id":"351360664_Developing_preservice_teachers'_understanding_of_computational_thinking_A_constructionist_approach","abstract":"Research relating to the development of computational thinking (CT) at primary school level is still in its infancy despite indications that it is most effective when introduced in primary/early secondary education. Teachers are pivotal to ensuring children develop CT, so it is essential they are effectively prepared, starting at preservice level, to incorporate CT into pedagogical practices. Grounded in constructionist principles and adopting the stance that CT be developed as part of subject areas other than computer science, this qualitative study presents findings focused on the understandings of CT of 51 preservice teachers who engaged in a digital learning specialism. Carried out over a 2‐year period, the research investigated preservice teachers' understandings of CT and how the design of the specialism helped to develop their understanding. Findings highlight deep understandings of CT among the preservice teachers who were able to make connections between constructionism and the development of CT. They also demonstrated a high level of pedagogical knowledge, indicating they understood why they designed particular challenges for children as part of their classroom experience. Findings are relevant for the design of teacher preparation programmes illustrating how CT can be effectively embedded to combine theory and practice. Practitioner notes What is already known about this topic Existing research base in relation to preservice teacher education and computational thinking is limited. When computational thinking is introduced as part of initial teacher education, preservice teachers: develop more accurate and increased understandings of computational thinking demonstrate more positive attitudes towards the implementation of computational thinking in the classroom. Duration of module seems to be a significant factor. A 1‐week module might be enough to develop preservice teachers' surface‐level understanding of computational thinking, but it would not provide them with enough knowledge to embed computational thinking in meaningful ways in the classroom (Yadav et al., 2014). What this paper adds Adopting the stance that computational thinking should be developed as part of subject areas other than computer science. This paper presents and discusses findings from the implementation of a model for preservice teacher education grounded in constructionism, that supports preservice primary teachers in building an understanding of CT as well as the pedagogical knowledge necessary for embedding CT into their classroom practice. Implications for practice and/or policy The insights gained from this study are particularly relevant for the design of teacher preparation programmes indicating how CT can be effectively embedded to combine theory and practice. This will ensure that CT concepts are not developed in a decontexualised manner but are embedded within the prescribed curriculum in a relevant and meaningful manner. What is already known about this topic Existing research base in relation to preservice teacher education and computational thinking is limited. When computational thinking is introduced as part of initial teacher education, preservice teachers: develop more accurate and increased understandings of computational thinking demonstrate more positive attitudes towards the implementation of computational thinking in the classroom. Duration of module seems to be a significant factor. A 1‐week module might be enough to develop preservice teachers' surface‐level understanding of computational thinking, but it would not provide them with enough knowledge to embed computational thinking in meaningful ways in the classroom (Yadav et al., 2014). What this paper adds Adopting the stance that computational thinking should be developed as part of subject areas other than computer science. This paper presents and discusses findings from the implementation of a model for preservice teacher education grounded in constructionism, that supports preservice primary teachers in building an understanding of CT as well as the pedagogical knowledge necessary for embedding CT into their classroom practice. Implications for practice and/or policy The insights gained from this study are particularly relevant for the design of teacher preparation programmes indicating how CT can be effectively embedded to combine theory and practice. This will ensure that CT concepts are not developed in a decontexualised manner but are embedded within the prescribed curriculum in a relevant and meaningful manner.","authors":["Deirdre Butler","Margaret Leahy"],"meta":["May 2021British Journal of Educational Technology 52(3)","DOI:10.1111/bjet.13090"],"references":["337718407_Computational_Thinking_from_a_Disciplinary_Perspective_Integrating_Computational_Thinking_in_K-12_Science_Technology_Engineering_and_Mathematics_Education","336709713_Teacher_Change_Following_a_Professional_Development_Experience_in_Integrating_Computational_Thinking_into_Elementary_Science","335056738_Hopscotch_into_Coding_Introducing_Pre-Service_Teachers_Computational_Thinking","327302966_Computational_thinking_-_a_guide_for_teachers","321339849_Enhancing_future_K-8_teachers'_computational_thinking_skills_through_modeling_and_simulations","319959476_Demystifying_computational_thinking","316446592_Computational_Thinking_in_Teacher_Education","351199742_A_constructionist_view_of_what_it_means_to_be_digitally_literate_-_Learning_in_21st_century_classrooms","324373353_Mindstorms_Children_Computers_and_Powerful_Ideas","319009176_Computational_Thinking_A_21st_Century_Skill","312039564_Developing_Computational_Thinking_in_Compulsory_Education_Implications_for_policy_and_practice","311568775_Effect_of_Robotics_on_Elementary_Preservice_Teachers'_Self-Efficacy_Science_Learning_and_Computational_Thinking","314191072_Assessing_elementary_students'_computational_thinking_in_everyday_reasoning_and_robotics_programming","308846015_Starting_from_scratch_Developing_a_pre-service_teacher_training_program_in_computational_thinking","306296469_Epistemological_Pluralism_Styles_and_Voices_Within_the_Computer_Culture"]}