{"id":"351350190_JAS-GAN_Generative_Adversarial_Network_Based_Joint_Atrium_and_Scar_Segmentation_on_Unbalanced_Atrial_Targets","abstract":"Automated and accurate segmentation of the left atrium (LA) and atrial scars from late gadolinium-enhanced cardiac magnetic resonance (LGE CMR) images are in high demand for quantifying atrial scars. The previous quantification of atrial scars relies on a two-phase segmentation for LA and atrial scars due to their large volume difference (unbalanced atrial targets). In this paper, we propose an inter-cascade generative adversarial network, namely JAS-GAN, to segment the unbalanced atrial targets from LGE CMR images automatically and accurately in an end-to-end way. Firstly, JAS-GAN investigates an adaptive attention cascade to automatically correlate the segmentation tasks of the unbalanced atrial targets. The adaptive attention cascade mainly models the inclusion relationship of the two unbalanced atrial targets, where the estimated LA acts as the attention map to adaptively focus on the small atrial scars roughly. Then, an adversarial regularization is applied to the segmentation tasks of the unbalanced atrial targets for making a consistent optimization. It mainly forces the estimated joint distribution of LA and atrial scars to match the real ones. We evaluated the performance of our JAS-GAN on a 3D LGE CMR dataset with 192 scans. Compared with state-of-the-art methods, our proposed approach yielded better segmentation performance (Average Dice Similarity Coefficient (DSC) values of 0.946 and 0.821 for LA and atrial scars, respectively), which indicated the effectiveness of our proposed approach for segmenting unbalanced atrial targets.","authors":["Jun Chen","Guang Yang","Habib Khan","Heye Zhang"],"meta":["May 2021IEEE Journal of Biomedical and Health Informatics PP","DOI:10.1109/JBHI.2021.3077469"],"references":["339049694_Simultaneous_left_atrium_anatomy_and_scar_segmentations_via_deep_learning_in_multiview_information_with_attention","338513481_Hybrid_Task_Cascade_for_Instance_Segmentation","334857036_Evaluation_of_Algorithms_for_Multi-Modality_Whole_Heart_Segmentation_An_Open-Access_Grand_Challenge","327238620_Fully_Automatic_Left_Atrium_Segmentation_From_Late_Gadolinium_Enhanced_Magnetic_Resonance_Imaging_Using_a_Dual_Fully_Convolutional_Neural_Network","347485491_A_global_benchmark_of_algorithms_for_segmenting_the_left_atrium_from_late_gadolinium-enhanced_cardiac_magnetic_resonance_imaging","331869988_Unsupervised_domain_adaptation_for_medical_imaging_segmentation_with_self-ensembling","329748830_Taskonomy_Disentangling_Task_Transfer_Learning","329747447_Multi-task_Learning_Using_Uncertainty_to_Weigh_Losses_for_Scene_Geometry_and_Semantics","329745476_Cascade_R-CNN_Delving_Into_High_Quality_Object_Detection","327515710_Inter-observer_variability_of_manual_contour_delineation_of_structures_in_CT"]}