{"id":"351496794_Effect_of_Trail_Bifurcation_Asymmetry_and_Pheromone_Presence_or_Absence_on_Trail_Choice_by_Lasius_niger_Ants","abstract":"During foraging, ant workers are known to make use of multiple information sources, such as private information (personal memory) and social information (trail pheromones). Environmental effects on foraging, and how these interact with other information sources, have, however, been little studied. One environmental effect is trail bifurcation asymmetry. Ants forage on branching trail networks and must often decide which branch to take at a junction (bifurcation). This is an important decision, as finding food sources relies on making the correct choices at bifurcations. Bifurcation angle may provide important information when making this choice. We used a Y-maze with a pivoting 90° bifurcation to study trail choice of Lasius niger foragers at varying branch asymmetries (0°, [both branches 45° from straight ahead], 30° [branches at 30° and 60° from straight ahead], 45°, 60° and 90° [one branch straight ahead, the other at 90°]). The experiment was carried out either with equal amounts of trail pheromone on both branches of the bifurcation or with pheromone present on only one branch. Our results show that with equal pheromone, trail asymmetry has a significant effect on trail choice. Ants preferentially follow the branch deviating least from straight, and this effect increases as asymmetry increases (47% at 0°, 54% at 30°, 57% at 45°, 66% at 60° and 73% at 90°). However, when pheromone is only present on one branch, the graded effect of asymmetry disappears. Overall, however, there is an effect of asymmetry as the preference of ants for the pheromone-marked branch over the unmarked branch is reduced from 65%, when it is the less deviating branch, to 53%, when it is the more deviating branch. These results demonstrate that trail asymmetry influences ant decision-making at bifurcations and that this information interacts with trail pheromone presence in a non-hierarchical manner.","authors":["Antonia Forster","Tomer Joseph Czaczkes","Emma Warner","Tom Woodall"],"meta":["April 2014Ethology 120(8)","DOI:10.1111/eth.12248","Project: Information use in ant foraging"],"references":["271924615_Ants_use_directionless_odour_cues_to_recall_odour-associated_locations","271007973_Social_learning_strategies_in_honeybee_foragers_Do_the_costs_of_using_private_information_affect_the_use_of_social_information","329476370_Controlling_the_False_Discovery_Rate_A_Practical_and_Powerful_Approach_to_Multiple_Testing","313077208_The_orientation_of_two_allied_species_of_British_ant_I_Visual_direction_finding_in_Acanthomyops_Lasius_niger","312455832_R_A_Language_and_Environment_for_Statistical_Computing","278028778_Mixed_Effects_Models_and_Extensions_in_Ecology_With_R","277514351_The_influence_of_beacon-aiming_on_the_routes_of_wood_ants","272161385_The_ants","265499774_Mixed_Effect_Models_and_Extensions_in_Ecology_With_R","261476823_The_ants"]}