{"id":"351486637_QUBO_formulations_for_training_machine_learning_models","abstract":"Training machine learning models on classical computers is usually a time and compute intensive process. With Moore’s law nearing its inevitable end and an ever-increasing demand for large-scale data analysis using machine learning, we must leverage non-conventional computing paradigms like quantum computing to train machine learning models efficiently. Adiabatic quantum computers can approximately solve NP-hard problems, such as the quadratic unconstrained binary optimization (QUBO), faster than classical computers. Since many machine learning problems are also NP-hard, we believe adiabatic quantum computers might be instrumental in training machine learning models efficiently in the post Moore’s law era. In order to solve problems on adiabatic quantum computers, they must be formulated as QUBO problems, which is very challenging. In this paper, we formulate the training problems of three machine learning models—linear regression, support vector machine (SVM) and balanced k-means clustering—as QUBO problems, making them conducive to be trained on adiabatic quantum computers. We also analyze the computational complexities of our formulations and compare them to corresponding state-of-the-art classical approaches. We show that the time and space complexities of our formulations are better (in case of SVM and balanced k-means clustering) or equivalent (in case of linear regression) to their classical counterparts.","authors":["Prasanna Date","Davis Arthur","Lauren Pusey-Nazzaro"],"meta":["May 2021Scientific Reports 11(1):10029","DOI:10.1038/s41598-021-89461-4"],"references":["354357872_Balanced_k-means_clustering_on_an_adiabatic_quantum_computer","342769180_Circuit_Depth_Reduction_for_Gate-Model_Quantum_Computers","339857182_Quantum_State_Optimization_and_Computational_Pathway_Evaluation_for_Gate-Model_Quantum_Computers","338507141_Optimizing_High-Efficiency_Quantum_Memory_with_Quantum_Machine_Learning_for_Near-Term_Quantum_Devices","337013955_Support_vector_machines_on_the_D-Wave_quantum_annealer","337011758_Least-squares_solutions_to_polynomial_systems_of_equations_with_quantum_annealing","336744162_Quantum_supremacy_using_a_programmable_superconducting_processor","336628546_Parameterized_quantum_circuits_as_machine_learning_models","335611387_A_QUBO_Formulation_of_the_k-Medoids_Problem","335580302_Training_Optimization_for_Gate-Model_Quantum_Neural_Networks"]}