{"id":"351489856_Power_of_data_in_quantum_machine_learning","abstract":"The use of quantum computing for machine learning is among the most exciting prospective applications of quantum technologies. However, machine learning tasks where data is provided can be considerably different than commonly studied computational tasks. In this work, we show that some problems that are classically hard to compute can be easily predicted by classical machines learning from data. Using rigorous prediction error bounds as a foundation, we develop a methodology for assessing potential quantum advantage in learning tasks. The bounds are tight asymptotically and empirically predictive for a wide range of learning models. These constructions explain numerical results showing that with the help of data, classical machine learning models can be competitive with quantum models even if they are tailored to quantum problems. We then propose a projected quantum model that provides a simple and rigorous quantum speed-up for a learning problem in the fault-tolerant regime. For near-term implementations, we demonstrate a significant prediction advantage over some classical models on engineered data sets designed to demonstrate a maximal quantum advantage in one of the largest numerical tests for gate-based quantum machine learning to date, up to 30 qubits.","authors":["Hsin-Yuan Huang","Michael Broughton","M. Mohseni","Ryan Babbush"],"meta":["May 2021Nature Communications 12(1)","DOI:10.1038/s41467-021-22539-9"],"references":["353197069_A_rigorous_and_robust_quantum_speed-up_in_supervised_machine_learning","348758575_Layerwise_learning_for_quantum_neural_networks","343157224_Experimental_kernel-based_quantum_machine_learning_in_finite_feature_space","342764055_Quantum_Overlapping_Tomography","341403483_Quantum_classifier_with_tailored_quantum_kernel","340955425_Predicting_Many_Properties_of_a_Quantum_System_from_Very_Few_Measurements","337846240_An_initialization_strategy_for_addressing_barren_plateaus_in_parametrized_quantum_circuits","336744162_Quantum_supremacy_using_a_programmable_superconducting_processor","351529326_Information-Theoretic_Bounds_on_Quantum_Advantage_in_Machine_Learning","350359303_Effect_of_data_encoding_on_the_expressive_power_of_variational_quantum-machine-learning_models"]}