{"id":"351568404_Positionless_aspect_based_sentiment_analysis_using_attention_mechanism","abstract":"Aspect-based sentiment analysis (ABSA) aims at identifying fine-grained polarity of opinion associated with a given aspect word. Several existing articles demonstrated promising ABSA accuracy using positional embedding to show the relationship between an aspect word and its context. In most cases, the positional embedding depends on the distance between the aspect word and the remaining words in the context, known as the position index sequence. However, these techniques usually employ both complex preprocessing approaches with additional trainable positional embedding and complex architectures to obtain the state-of-the-art performance. In this paper, we simplify preprocessing by including polarity lexicon replacement and masking techniques that carry the information of the aspect word’s position and eliminate the positional embedding. We then adopt a novel and concise architecture using two Bidirectional GRU along with an attention layer to classify the aspect based on its context words. Experiment results show that the simplified preprocessing and the concise architecture significantly improve the accuracy of the publicly available ABSA datasets, obtaining 81.37%, 75.39%, 80.88%, and 89.30% in restaurant 14, laptop 14, restaurant 15, and restaurant 16 respectively.","authors":["Rohan Kumar Yadav","Lei Jiao","Morten Goodwin","Ole-Christoffer Granmo"],"meta":["May 2021Knowledge-Based Systems 226(3):107136","DOI:10.1016/j.knosys.2021.107136"],"references":["355084552_BiERU_Bidirectional_Emotional_Recurrent_Unit_for_Conversational_Sentiment_Analysis","343315798_Aspect-Specific_Heterogeneous_Graph_Convolutional_Network_for_Aspect-Based_Sentiment_Classification","341978698_Is_position_important_deep_multi-task_learning_for_aspect-based_sentiment_analysis","354272236_A_Position-aware_Bidirectional_Attention_Network_for_Aspect-level_Sentiment_Analysis","351984648_Human-Level_Interpretable_Learning_for_Aspect-Based_Sentiment_Analysis","344589336_ABCDM_An_Attention-based_Bidirectional_CNN-RNN_Deep_Model_for_sentiment_analysis","342842139_Multi-Level_Fine-Scaled_Sentiment_Sensing_with_Ambivalence_Handling","342837253_Attention-based_sentiment_analysis_using_convolutional_and_recurrent_neural_network","341801569_Emoji-Based_Sentiment_Analysis_Using_Attention_Networks","341744192_Target_Embedding_and_Position_Attention_with_LSTM_for_Aspect_Based_Sentiment_Analysis"]}