{"id":"351566138_You_can_simply_rely_on_communities_for_a_robust_characterization_of_stances","abstract":"We show that the structure of communities in social me- dia provides robust information for weakly supervised approaches to assign stances to tweets. Using as seed the SemEval 2016 Stance Detection Task annotated data, we retrieved a high number of topically related tweets. We then propagated information from the manually an- notated seed to the retrieved tweets and thus obtained a bigger training corpus. Classifiers trained with this bigger, weakly supervised dataset reach similar or better performance than those trained with the manually annotated seed. In addition, they are more robust with respect to common manual annotator errors or biases and they have arguably more coverage than smaller datasets. Weakly supervised approaches, most notably self- supervision, commonly suffer from error propagation. Interestingly, communities seem to provide a structure that constrains error propagation. In particular, weakly supervised classifiers that incorporate community struc- ture are more robust with respect to class imbalance. Additionally, this is a straightforward, transparent ap- proach, using standard tools and pipelines, cheaper and faster than methods like crowd sourcing for manual an- notations. Thus it facilitates adoption, interpretability and accountability.","authors":["Damián Ariel Furman","Santiago Marro","Cristian Cardellino","Diana Nicoleta Popa"],"meta":["April 2021","DOI:10.32473/flairs.v34i1.128515"],"references":["345434708_SemEval-2019_Task_7_RumourEval_Determining_Rumour_Veracity_and_Support_for_Rumours","344722263_SemEval-2019_Task_5_Multilingual_Detection_of_Hate_Speech_Against_Immigrants_and_Women_in_Twitter","334116365_Universal_Language_Model_Fine-tuning_for_Text_Classification","311990776_Weakly_Supervised_Tweet_Stance_Classification_by_Relational_Bootstrapping","305334714_INF-UFRGS-OPINION-MINING_at_SemEval-2016_Task_6_Automatic_Generation_of_a_Training_Corpus_for_Unsupervised_Identification_of_Stance_in_Tweets","305334597_SemEval-2016_Task_6_Detecting_Stance_in_Tweets","305334507_NLDS-UCSC_at_SemEval-2016_Task_6_A_Semi-Supervised_Approach_to_Detecting_Stance_in_Tweets","318741395_Bag_of_Tricks_for_Efficient_Text_Classification","305334717_MITRE_at_SemEval-2016_Task_6_Transfer_Learning_for_Stance_Detection"]}