{"id":"351503209_Nonlinear_MHD_simulations_of_external_kinks_in_quasi-axisymmetric_stellarators_using_an_axisymmetric_external_rotational_transform_approximation","abstract":"Reduced magnetohydrodynamic (MHD) equations are used to study the nonlinear dynamics of external kinks in a quasi-axisymmetric (QA) stellarator with varying fractions of external rotational transform. The large bootstrap currents associated with high beta plasmas may make QA configurations susceptible to low n external modes, limiting their operational space. The violence of the nonlinear dynamics, and, in particular, when these modes lead to a disruption, is not yet understood. In this paper, the nonlinear phase of external kinks in an unstable QA configuration with an edge safety factor below two is simulated. An axisymmetric approximation of this stellarator is constructed in the nonlinear MHD code, JOREK, capturing the influence of the external rotational transform. The use of this approximation for the considered stellarator is validated by comparing the linear dynamics against the linear viscoresistive MHD code, CASTOR3D. The nonlinear dynamics of this stellarator approximation are compared with an equivalent tokamak to understand the influence of a relatively small external rotational transform. While the external rotational transform does have a stabilizing influence on the MHD activity, it remains violent. To explore the first order influence of a larger external rotational transform, this equilibrium parameter is artificially increased for the considered stellarator, reducing the effective plasma current. The violence of the kink instability is quantified, and shown to reduce with the increasing external rotational transform. At the same time, the external kink triggers internal modes that exacerbate the loss in confinement during the nonlinear phase, such that it remains large over much of the parameter space. It is only with a significant fraction of external rotational transform that these subsequent modes are stabilized.","authors":["Rohan Ramasamy","Matthias Hoelzl","Erika Strumberger","Karl Lackner"],"meta":["May 2021Nuclear Fusion 61(7)","DOI:10.1088/1741-4326/abffdf"],"references":["351494763_Testing_of_the_new_JOREK_stellarator-capable_model_in_the_tokamak_limit","351020447_The_JOREK_non-linear_extended_MHD_code_and_applications_to_large-scale_instabilities_and_their_control_in_magnetically_confined_fusion_plasmas","351818509_3D_simulations_of_vertical_displacement_events_in_tokamaks_A_benchmark_of_M3D-C_1_NIMROD_and_JOREK","344827455_Extended_full-MHD_simulation_of_non-linear_instabilities_in_tokamak_plasmas","341337529_Numerical_modeling_of_the_electron_temperature_crashes_observed_in_Wendelstein_7-X_stellarator_experiments","336541082_A_three-dimensional_reduced_MHD_model_consistent_with_full_MHD","334403094_Linear_stability_studies_for_a_quasi-axisymmetric_stellarator_configuration_including_effects_of_parallel_viscosity_plasma_flow_and_resistive_walls","331397627_FREE-BOUNDARY_SIMULATIONS_OF_MHD_PLASMA_INSTABILITIES_IN_TOKAMAKS","329458046_Properties_of_a_new_quasi-axisymmetric_configuration","319054273_Comprehensive_magnetohydrodynamic_hybrid_simulations_of_fast_ion_driven_instabilities_in_a_Large_Helical_Device_experiment"]}