{"id":"351557784_Cues_to_gender_and_racial_identity_reduce_creativity_in_diverse_social_networks","abstract":"The characteristics of social partners have long been hypothesized as influential in guiding group interactions. Understanding how demographic cues impact networks of creative collaborators is critical for elevating creative performances therein. We conducted a randomized experiment to investigate how the knowledge of peers’ gender and racial identities distorts people’s connection patterns and the resulting creative outcomes in a dynamic social network. Consistent with prior work, we found that creative inspiration links are primarily formed with top idea-generators. However, when gender and racial identities are known, not only is there (1) an increase of $$82.03\\%$$ 82.03 % in the odds of same-gender connections to persist (but not for same-race connections), but (2) the semantic similarity of idea-sets stimulated by these connections also increase significantly compared to demography-agnostic networks, negatively impacting the outcomes of divergent creativity. We found that ideas tend to be significantly more homogeneous within demographic groups than between, taking away diversity-bonuses from similarity-based links and partly explaining the results. These insights can inform intelligent interventions to enhance network-wide creative performances.","authors":["Raiyan Abdul Baten","Richard N. Aslin","Gourab Ghoshal","Ehsan Hoque"],"meta":["May 2021Scientific Reports 11(1)","DOI:10.1038/s41598-021-89498-5"],"references":["341317328_Adaptive_social_networks_promote_the_wisdom_of_crowds","338204745_Upskilling_Together_How_Peer-interaction_Influences_Speaking-skills_Development_Online","335712317_Epistemic_modalities_of_racialised_knowledge_production_in_the_Swedish_academy","333587336_Underrepresented_faculty_play_a_disproportionate_role_in_advancing_diversity_and_inclusion","332388436_Toward_understanding_the_impact_of_artificial_intelligence_on_labor","346233892_Creativity_in_temporal_social_networks_how_divergent_thinking_is_impacted_by_one's_choice_of_peers","342061671_The_Effects_of_Racial_Diversity_Congruence_between_Upper_Management_and_Lower_Management_on_Firm_Productivity","340634704_The_Diversity-Innovation_Paradox_in_Science","338269306_The_Diversity_Bonus_How_Great_Teams_Pay_Off_in_the_Knowledge_Economy","332010657_The_Diversity_Bonus_How_Great_Teams_Pay_Off_in_the_Knowledge_Economy"]}