{"id":"351501627_A_Serial-Parallel_Self-Attention_Network_Joint_With_Multi-Scale_Dilated_Convolution","abstract":"Semantic segmentation is a high-level task in the field of computer vision, which paves the way for the realization of a complete understanding of the scene, and has been widely used in automatic driving, human-computer interaction, virtual reality, and other aspects. Recently, the semantic segmentation method of convolutional neural networks with deep structure has been more accurate and efficient than other methods. However, there are some problems in these methods, such as the loss of information caused by the down-sampling operation, the lack of usage of image context information, and the neglect of the relationship between spatial features and channel features. To solve these problems, a novel self-attention network based on the series-parallel structure is proposed in the paper. Firstly, a multi-scale dilated convolution backbone network is constructed by combining the dilated convolution and the residual network, which makes up for the information loss caused by the restriction of the receptor field in the ordinary network and improves the richness of extracted features. Secondly, the self-attention modules are stacked with serial and parallel structures, which can effectively extract the contextual information of space, channel, and space-channel and fully integrate them. Finally, the proposed algorithm is tested extensively and compared with the existing classical algorithms. The experimental results show that the proposed algorithm achieves state-of-the-art performance on the public dataset.","authors":["Wang Gaihua","Zhang Tianlun","Dai Yingying","Lin Jinheng"],"meta":["May 2021IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2021.3079243"],"references":["340694786_Review_of_Artificial_Intelligence_Techniques_in_Imaging_Data_Acquisition_Segmentation_and_Diagnosis_for_COVID-19","329743873_Context_Encoding_for_Semantic_Segmentation","329740252_Context_Contrasted_Feature_and_Gated_Multi-scale_Aggregation_for_Scene_Segmentation","350808699_Adobe_Photoshop_CS5_for_Photographers_A_professional_image_editor's_guide_to_the_creative_use_of_Photoshop_for_the_Macintosh_and_PC","349409608_Image_Segmentation_Using_Deep_Learning_A_Survey","343465903_Strip_Pooling_Rethinking_Spatial_Pooling_for_Scene_Parsing","343412998_Scene_Segmentation_With_Dual_Relation-Aware_Attention_Network","338512016_Dual_Attention_Network_for_Scene_Segmentation","329743787_Learning_a_Discriminative_Feature_Network_for_Semantic_Segmentation","329740202_Squeeze-and-Excitation_Networks"]}