{"id":"351591629_Improved_Lower_Bound_of_LFMD_with_Applications_of_Prism-Related_Networks","abstract":"e different distance-based parameters are used to study the problems in various fields of computer science and chemistry such as pattern recognition, image processing, integer programming, navigation, drug discovery, and formation of different chemical compounds. In particular, distance among the nodes (vertices) of the networks plays a supreme role to study structural properties of networks such as connectivity, robustness, completeness, complexity, and clustering. Metric dimension is used to find the locations of machines with respect to minimum utilization of time, lesser number of the utilized nodes as places of the objects, and shortest distance among destinations. In this paper, lower bound of local fractional metric dimension for the connected networks is improved from unity and expressed in terms of ratio obtained by the cardinalities of the understudy network and the local resolving neighborhood with maximum order for some edges of network. In the same context, the LFMDs of prism-related networks such as circular diagonal ladder, antiprism, triangular winged prism, and sun flower networkngs are computed with the help of obtained criteria. At the end, the bounded-and unboundedness of the obtained results is also shown numerically.","authors":["Muhammad Javaid","Hassan zafar Zafar","Quanxin Zhu","Abdulaziz Mohammed Alanazi"],"meta":["May 2021Mathematical Problems in Engineering 2021(Special):9","DOI:10.1155/2021/9950310","Project: Improved Lower Bound of LFMD with Applications of Prism-Related Networks"],"references":["346894724_Sharp_Bounds_of_Local_Fractional_Metric_Dimensions_of_Connected_Networks","335508336_Computing_Metric_Dimension_of_Certain_Families_of_Toeplitz_Graphs","332301859_On_the_local_fractional_metric_dimension_of_corona_product_graphs","330490436_Fractional_Metric_Dimension_of_Generalized_Jahangir_Graph","273511739_Percolation_in_a_Hierarchical_Lattice","265889329_The_metric_dimension_and_metric_independence_of_a_graph","346975875_On_sharp_bounds_of_the_Partition_Dimension_of_Convex_Polytoes","341093777_Local_Fractional_Metric_Dimensions_of_Rotationally_Symmetric_and_Planar_Networks","338077946_On_some_new_edge_odd_graceful_graphs","303151748_Leaves_of_trees"]}