{"id":"351600978_Leveraging_Final_Degree_Projects_for_Open_Source_Software_Contributions","abstract":"1) Background: final year students of computer science engineering degrees must carry out a final degree project (FDP) in order to graduate. Students' contributions to improve open source software (OSS) through FDPs can offer multiple benefits and challenges, both for the students, the instructors and for the project itself. This work reports on a practical experience developed by four students contributing to mature OSS projects during their FDPs, detailing how they addressed the multiple challenges involved, both from the students and teachers perspective. (2) Methods: we followed the work of four students contributing to two established OSS projects for two academic years and analyzed their work on GitHub and their responses to a survey. (3) Results: we obtained a set of specific recommendations for future practitioners and detailed a list of benefits achieved by steering FDP towards OSS contributions, for students, teachers and the OSS projects. (4) Conclusion: we find out that FDPs oriented towards enhancing OSS projects can introduce students into real-world, practical examples of software engineering principles, give them a boost in their confidence about their technical and communication skills and help them build a portfolio of contributions to daily used worldwide open source applications.","authors":["Juanan Pereira"],"meta":["May 2021Electronics 10(10):1181","DOI:10.3390/electronics10101181","Project: Teaching Software Engineering by Contributing to Free, Libre and Open Source Software"],"references":["331113706_Engaging_Students_in_Open_Source_Establishing_FOSS_Development_at_a_University","351421780_GitHub-OSS_Fixit_Fixing_bugs_at_scale_in_a_Software_Engineering_Course","347814626_Do_we_use_FLOSS_in_Software_Engineering_Education_Mapping_the_Profiles_and_Practices_of_Higher_Education_Teachers_from_Brazil","345604183_Teaching_Software_Testing_with_Free_and_Open_Source_Software","342452008_Guide_to_the_Software_Engineering_Body_of_Knowledge_-_SWEBOK_V30","337794091_Teaching_Software_Maintenance","337714901_Google_Summer_of_Code_Student_Motivations_and_Contributions","335951189_FLOSS_in_Software_Engineering_Education_Supporting_the_Instructor_in_the_Quest_for_Providing_Real_Experience_for_Students","333313149_Does_FLOSS_in_Software_Engineering_Education_Narrow_the_Theory-Practice_Gap_A_Study_Grounded_on_Students'_Perception","332087114_Teaching_Software_Engineering_with_Free_Open_Source_Software_Development_An_Experience_Report"]}