{"id":"351686977_Book_of_Proceedings_esdBaku2020_Vol3_Online","abstract":"THE DEVELOPMENT PROCESS OF DISTANCE EDUCATION IN AZERBAIJAN\nAybaniz Huseinova\nAzerbaijan State University of Economics (UNEC), Azerbaijan\naybaniz_huseynova@unec.edu.az\nABSTRACT\nThe widespread use of distance education in accordance with the requirements of modern times allows more people to be involved in education. Thanks to distance education, people living in remote villages, people with disabilities, or those who for some reason cannot continue their education, also get a comfortable education.\nDistance education is widely used in many higher education institutions of the world. For the last 10 years distance education in Azerbaijan is developing. Although distance education did not receive much attention in the early years, demand for this type of education has been growing over the past five years. A number of steps have been taken in this direction. Since 2010, the Ministry of Education has launched a distance learning project called “e-Learning Systems”. The main goal of the project is to involve children with disabilities in distance education, to support their integration in society, to improve their educational opportunities, to create Internet access by improving their ability to use computer and electronic resources. \nDistance education programs are implemented at UNEC, ADA, West Caspian University and other universities. There are regularly organized trainings for professors-teachers of distance education with the participation of foreign experts. In the trainings there are provided information on a specially created platform, the methods and technologies used in distance education are considered. \nWe can positively assess the activity of the Distance Learning Center in the Training-Innovation Center of the Institute of Information Technologies of ANAS, as the most successful step in distance education. The distance education center conducts computer science classes for doctoral students and dissertators from different regions of Azerbaijan. The article discusses the steps taken in the field of distance education, the work done, as well as the experiences of leading world scientific centers and their application in educational institutions of Azerbaijan.\nKeywords: Azerbaijan, distance, education, school, university","authors":["Aybeniz Huseynova"],"meta":["June 2020","Project: THE DEVELOPMENT PROCESS OF DISTANCE EDUCATION IN AZERBAIJAN"],"references":["353418160_RELATIONSHIPS_BETWEEN_FINANCIAL_DEVELOPMENT_AND_ECONOMIC_GROWTH_A_NEW_APPROACH_BY_INPUTS","353194667_Income_and_Life_Satisfaction_A_'Wave_Formation'_Framework","351118405_How_Dividend_Policy_Affects_Volatility_of_Stock_Prices_of_Financial_Sector_Firms_of_Pakistan","339665439_Operational_control_over_the_financial_stability_of_banking","337872570_Factors_affecting_the_liquidity_of_commercial_banks_in_India_a_longitudinal_analysis","337412185_Financial_stability_management_in_banks_strategy_maps","356299458_Minimum_Wages_and_Aggregate_Job_Growth_Causal_Effect_or_Statistical_Artifact","343901681_The_OECD_principles_of_corporate_governance","338874766_Sustainability_and_marketing_in_tourism_its_contexts_paradoxes_approaches_challenges_and_potential","338313352_The_Appellate_Body_of_the_WTO_and_Its_Reform","337128510_ASSESSMENT_OF_CAPITAL_CONCENTRATION_IMPACT_ON_THE_BANKING_SYSTEM_EFFICIENCY_UNDER_MODERN_TRANSFORMATION","337122193_HOW_TO_INCREASE_PUBLIC_CONFIDENCE_IN_UNDERSTANDING_AND_USE_OF_THE_BANKING_SYSTEM_MARKETING_MODEL_'NETS_FOR_TRUST'","333674086_The_impact_of_bank_credits_on_non-oil_GDP_evidence_from_Azerbaijan","334264994_Nexus_Between_Financial_Development_and_Economic_Growth_in_Malaysia","333389214_Civil_service_reform_in_the_mirror_of_budget_expenditures"]}