{"id":"351611914_Semantic_and_relational_spaces_in_science_of_science_deep_learning_models_for_article_vectorisation","abstract":"Over the last century, we observe a steady and exponential growth of scientific publications globally. The overwhelming amount of available literature makes a holistic analysis of the research within a field and between fields based on manual inspection impossible. Automatic techniques to support the process of literature review are required to find the epistemic and social patterns that are embedded in scientific publications. In computer sciences, new tools have been developed to deal with large volumes of data. In particular, deep learning techniques open the possibility of automated end-to-end models to project observations to a new, low-dimensional space where the most relevant information of each observation is highlighted. Using deep learning to build new representations of scientific publications is a growing but still emerging field of research. The aim of this paper is to discuss the potential and limits of deep learning for gathering insights about scientific research articles. We focus on document-level embeddings based on the semantic and relational aspects of articles, using Natural Language Processing (NLP) and Graph Neural Networks (GNNs). We explore the different outcomes generated by those techniques. Our results show that using NLP we can encode a semantic space of articles, while GNN we enable us to build a relational space where the social practices of a research community are also encoded.","authors":["Diego Kozlowski","Jennifer Dusdal","Jun Pang","Andreas Zilian"],"meta":["May 2021Scientometrics 126(7451)","DOI:10.1007/s11192-021-03984-1"],"references":["347233464_Transformers_State-of-the-Art_Natural_Language_Processing","343625264_Bridging_the_divide_between_qualitative_and_quantitative_science_studies","342246082_The_world-systemic_network_of_global_elite_sociology_the_western_male_monoculture_at_faculties_of_the_top_one-hundred_sociology_departments_of_the_world","338724588_Mapping_the_scattered_field_of_research_on_higher_education_A_correlated_topic_model_of_17000_articles_1991-2018","333840644_The_Methodological_Divide_of_Sociology_Evidence_from_Two_Decades_of_Journal_Publications","342900357_A_context-aware_citation_recommendation_model_with_BERT_and_graph_convolutional_networks","342546115_Against_method_Exploding_the_boundary_between_qualitative_and_quantitative_studies_of_science","335778883_BERT_Rediscovers_the_Classical_NLP_Pipeline","335100749_P2V_large-scale_academic_paper_embedding","324055041_The_Geometry_of_Culture_Analyzing_Meaning_through_Word_Embeddings"]}