{"id":"351671220_Machine_learning-accelerated_computational_fluid_dynamics","abstract":"Numerical simulation of fluids plays an essential role in modeling many physical phenomena, such as weather, climate, aerodynamics, and plasma physics. Fluids are well described by the Navier–Stokes equations, but solving these equations at scale remains daunting, limited by the computational cost of resolving the smallest spatiotemporal features. This leads to unfavorable trade-offs between accuracy and tractability. Here we use end-to-end deep learning to improve approximations inside computational fluid dynamics for modeling two-dimensional turbulent flows. For both direct numerical simulation of turbulence and large-eddy simulation, our results are as accurate as baseline solvers with 8 to 10× finer resolution in each spatial dimension, resulting in 40- to 80-fold computational speedups. Our method remains stable during long simulations and generalizes to forcing functions and Reynolds numbers outside of the flows where it is trained, in contrast to black-box machine-learning approaches. Our approach exemplifies how scientific computing can leverage machine learning and hardware accelerators to improve simulations without sacrificing accuracy or generalization.","authors":["Dmitrii Kochkov","Jamie A. Smith","Ayya Alieva","Qing Wang"],"meta":["May 2021Proceedings of the National Academy of Sciences 118(21):e2101784118","DOI:10.1073/pnas.2101784118"],"references":["352806930_Large-Scale_Discrete_Fourier_Transform_on_TPUs","352394785_Learned_discretizations_for_passive_scalar_advection_in_a_two-dimensional_turbulent_flow","348638656_Kohn-Sham_Equations_as_Regularizer_Building_Prior_Knowledge_into_Machine-Learned_Physics","351540606_Perspectives_on_machine_learning-augmented_Reynolds-averaged_and_large_eddy_simulation_models_of_turbulence","346581064_DPM_A_deep_learning_PDE_augmentation_method_with_application_to_large-eddy_simulation","345364278_Statistical_Properties_of_Subgrid-Scale_Turbulence_Models","343777149_Towards_Physics-informed_Deep_Learning_for_Turbulent_Flow_Prediction","342540311_CFDNet_a_deep_learning-based_accelerator_for_fluid_simulations","340439031_Neural_Operator_Graph_Kernel_Network_for_Partial_Differential_Equations","337110149_High_performance_Monte_Carlo_simulation_of_ising_model_on_TPU_clusters"]}