{"id":"351736442_ELLA_-UMA_PROPOSTA_DECOLONIAL_DE_ENSINO-APRENDIZAGEM_DE_LINGUA_INGLESA_A_DISTANCIA","abstract":"Este artigo tem o objetivo de problematizar a produção de material didático, explicitando algumas atividades criadas por um viés decolonial, dentro do ELLA: English Language Learning Laboratory, um laboratório virtual dotado de inteligência artificial voltado ao ensino de língua inglesa a distância para instituições federais de ensino superior. O ELLA está ligado ao grupo de pesquisa Linguagem Natural e Inteligência Artificial, do qual fazemos parte, formado por uma equipe transdisciplinar, principalmente das áreas de Linguística Aplicada e Ensino de Inglês e Ciência da Computação. O ELLA é responsivo às questões sociais emergentes e se preocupa em oportunizar para que a(o) sua(seu) estudante possa se legitimar no aprendizado em língua inglesa. Utilizamos para esse artigo uma metodologia qualitativa de cunho bibliográfico decolonial que perpassa pela Linguística Aplicada Crítica no contexto da produção de material didático. Temos trabalhado em uma perspectiva epistemológica que questiona o silenciamento das vozes do Sul como produtora de conhecimento e de saberes e é nesse aspecto que o ELLA está sendo desenvolvido, colocando-se como meio de produção de saberes em alinhamento às questões de relevância social. O resultado esperado é que as(os) estudante consigam tomar a palavra e se posicionarem em uma língua outra.","authors":["Isabella Zaiden Zara Fagundes","Giselly Tiago Ribeiro Amado"],"meta":["August 2020"],"references":["282390866_Colonialidad_del_Poder_y_Clasi_cacion_Social","298635004_The_Handbook_of_Applied_Linguistics","288110856_Language_teacher_education_for_a_global_society_A_modular_model_for_knowing_analyzing_recognizing_doing_and_seeing","286350116_Afinal_o_que_e_Linguistica_Aplicada","249238019_The_Soft_Ideological_Underbelly_of_the_Notion_of_Intelligibility_in_Discussions_about_'World_Englishes'","239487850_Critical_Applied_Linguistics_A_Critical_Introduction"]}