{"id":"351793344_MOTIVACAO_DE_ESTUDANTES_NON-MAJORS_EM_UMA_DISCIPLINA_DE_PROGRAMACAO","abstract":"Programar computadores é considerada uma competência complexa de se aprender por envolver uma variedade de conhecimentos, estratégias e modelos nos diferentes níveis de domínio do problema, do design de solução e do programa propriamente dito Robins et al. (2003). Neste contexto, disciplinas de introdução à programação geralmente apresentam altos índices de abandono e reprovação Watson & Li (2014). Apesar de muitas iniciativas visando a resolução deste problema, estudos evidenciam que as taxas não têm melhorado significativamente ao longo do tempo Watson & Li (2014).Disciplinas de introdução a programação, rotineiramente chamadas de CS1 (Computer Science 1) na literatura, costumam fazer parte das matrizes curriculares de cursos de graduação fora da área de TI, principalmente nas ciências exatas e tecnológicas. Adotamos aqui o termo inglês non-majors para identificar os estudantes que cursam uma disciplina (neste caso, CS1) de uma área diferente da que se graduam. Entendemos que as disciplinas de introdução a programação ofertadas podem ser adaptadas para melhor atender este público. Várias iniciativas buscam potencializar a motivação e comprometimento dos estudantes Forte & Guzdial (2005), como cursos focados na habilidade de resolução de problemas, contextualizados para a área do estudante, utilizando as linguagens Logo e Python, utilizando ferramentas como Scratch e Greenfoot, ou utilizando mídias e a ferramenta Jython Environment for Students (JES).A motivação já vem sendo apontada como um fator importante na aprendizagem há algum tempo. Compreendendo a sua importância, percebe-se que a abordagem empregada pode contribuir para o aumento ou diminuição da motivação dos estudantes Jenkins (2001). Para melhor atuar sobre as diversas dimensões da motivação, Keller (1987), criou o modelo ARCS (Atenção, Relevância, Confiança e Satisfação), que inclui um conjunto de estratégias utilizadas para aumentar o apelo motivacional de materiais instrucionais. A partir do modelo ARCS, Keller desenvolveu um instrumento de medição chamado de Instructional Material Motivation Survey (IMMS) para identificar possíveis problemas motivacionais em materiais instrucionais. Este instrumento consta de 36 declarações sobre o material, gerados a partir das categorias definidas pelo ARCS.O trabalho desenvolvido investiga como uma abordagem de ensino-aprendizagem de programação para calouros de engenharia Civil, que faz uso do ambiente Scratch, da linguagem de programação Python e do ambiente de desenvolvimento JES, influencia na motivação dos estudantes. A avaliação é realizada apartir de um questionário adaptado do IMMS ao contexto da abordagem, além de umaavaliação qualitativa.","authors":["José Solenir Lima Figuerêdo"],"meta":["November 2017","DOI:10.13102/semic.v0i21.2268"],"references":["3050987_Motivation_and_Nonmajors_in_Computer_Science_Identifying_Discrete_Audiences_for_Introductory_Courses","225508617_Development_and_Use_of_the_ARCS_Model_of_Instructional_Design","200085837_Learning_and_Teaching_Programming_A_Review_and_Discussion"]}