{"id":"351778447_Comprehensive_influence_of_topological_location_and_neighbor_information_on_identifying_influential_nodes_in_complex_networks","abstract":"Identifying the influential nodes of complex networks is now seen as essential for optimizing the network structure or efficiently disseminating information through networks. Most of the available methods determine the spreading capability of nodes based on their topological locations or the neighbor information, the degree of node is usually used to denote the neighbor information, and the k-shell is used to denote the locations of nodes, However, k-shell does not provide enough information about the topological connections and position information of the nodes. In this work, a new hybrid method is proposed to identify highly influential spreaders by not only considering the topological location of the node but also the neighbor information. The percentage of triangle structures is employed to measure both the connections among the neighbor nodes and the location of nodes, the contact distance is also taken into consideration to distinguish the interaction influence by different step neighbors. The comparison between our proposed method and some well-known centralities indicates that the proposed measure is more highly correlated with the real spreading process, Furthermore, another comprehensive experiment shows that the top nodes removed according to the proposed method are relatively quick to destroy the network than other compared semi-local measures. Our results may provide further insights into identifying influential individuals according to the structure of the networks.","authors":["Xiaohua Wang","Qing Yang","Meizhen Liu","Xiaojian Ma"],"meta":["May 2021PLoS ONE 16(5):e0251208","DOI:10.1371/journal.pone.0251208"],"references":["342964253_Interplay_Between_Hierarchy_and_Centrality_in_Complex_Networks","335091513_Immunization_of_networks_with_non-overlapping_community_structure","334428562_Centrality_in_Complex_Networks_with_Overlapping_Community_Structure","333686362_Identifying_influential_spreaders_by_gravity_model","332996102_Centrality_in_modular_networks","328992003_Betweenness_Centrality_for_Networks_with_Non-Overlapping_Community_Structure","343664210_The_identification_of_influential_nodes_based_on_structure_similarity","339789811_Vital_spreaders_identification_in_complex_networks_with_multi-local_dimension","338511298_GMM_A_generalized_mechanics_model_for_identifying_the_importance_of_nodes_in_complex_networks","332449769_Mixing_patterns_and_individual_differences_in_networks"]}