{"id":"351860530_On_the_sparsity_of_fitness_functions_and_implications_for_learning","abstract":"Fitness functions map biological sequences to a scalar property of interest. Accurate estimation of these functions yields biological insight and sets the foundation for model-based sequence design. However, the amount of fitness data available to learn these functions is typically small relative to the large combinatorial space of sequences; characterizing how much data is needed for accurate estimation remains an open problem. There is a growing body of evidence demonstrating that empirical fitness functions display substantial sparsity when represented in terms of epistatic interactions. Moreover, the theory of Compressed Sensing provides scaling laws for the number of samples required to exactly recover a sparse function. Motivated by these results, we study the sparsity of fitness functions sampled from a generalization of the NK model, a widely-used random field model of fitness functions. In particular, we present theoretical results that allow us to test the effect of the Generalized NK (GNK) model's interpretable parameters---sequence length, alphabet size, and assumed interactions between sequence positions---on the sparsity of fitness functions sampled from the model and, consequently, the number of measurements required to exactly recover these functions. Further, we show that GNK fitness functions with parameters set according to protein structural contacts can be used to accurately approximate the number of samples required to estimate two empirical protein fitness functions, and are able to identify important higher-order epistatic interactions in these functions using only structural information.","authors":["David H Brookes","Amirali Aghazadeh","Jennifer Listgarten"],"meta":["May 2021","DOI:10.1101/2021.05.24.445506"],"references":["350711230_Low-N_protein_engineering_with_data-efficient_deep_learning","349232068_Deep_diversification_of_an_AAV_capsid_protein_by_machine_learning","342924517_CRISPRL_and_Interpretable_large-scale_inference_of_DNA_repair_landscape_based_on_a_spectral_approach","340627102_Minimum_epistasis_interpolation_for_sequence-function_relationships","339659959_Sparse_Epistatic_Patterns_in_the_Evolution_of_Terpene_Synthases","336703780_Higher-order_epistasis_shapes_the_fitness_landscape_of_a_xenobiotic-degrading_enzyme","349308604_Principal_eigenvector_of_the_signless_Laplacian_matrix","348735894_Evaluating_Protein_Transfer_Learning_with_TAPE","343345918_An_evolution-based_model_for_designing_chorismate_mutase_enzymes","336366578_Adaptive_walks_on_high-dimensional_fitness_landscapes_and_seascapes_with_distance-dependent_statistics"]}