{"id":"351819201_A_Comprehensive_Survey_of_Neural_Architecture_Search_Challenges_and_Solutions","abstract":"Deep learning has made substantial breakthroughs in many fields due to its powerful automatic representation capabilities. It has been proven that neural architecture design is crucial to the feature representation of data and the final performance. However, the design of the neural architecture heavily relies on the researchers’ prior knowledge and experience. And due to the limitations of humans’ inherent knowledge, it is difficult for people to jump out of their original thinking paradigm and design an optimal model. Therefore, an intuitive idea would be to reduce human intervention as much as possible and let the algorithm automatically design the neural architecture. Neural Architecture Search ( NAS ) is just such a revolutionary algorithm, and the related research work is complicated and rich. Therefore, a comprehensive and systematic survey on the NAS is essential. Previously related surveys have begun to classify existing work mainly based on the key components of NAS: search space, search strategy, and evaluation strategy. While this classification method is more intuitive, it is difficult for readers to grasp the challenges and the landmark work involved. Therefore, in this survey, we provide a new perspective: beginning with an overview of the characteristics of the earliest NAS algorithms, summarizing the problems in these early NAS algorithms, and then providing solutions for subsequent related research work. In addition, we conduct a detailed and comprehensive analysis, comparison, and summary of these works. Finally, we provide some possible future research directions.","authors":["Ren Pengzhen","Yun Xiao","Xiaojun Chang","Po-Yao Huang"],"meta":["May 2021ACM Computing Surveys 54(4):1-34","DOI:10.1145/3447582"],"references":["348798568_NATS-Bench_Benchmarking_NAS_Algorithms_for_Architecture_Topology_and_Size","354141110_AutoSpeech_Neural_Architecture_Search_for_Speaker_Recognition","347629575_FNA_Fast_Network_Adaptation_via_Parameter_Remapping_and_Architecture_Search","346160386_Single_Path_One-Shot_Neural_Architecture_Search_with_Uniform_Sampling","343463669_Improving_One-Shot_NAS_by_Suppressing_the_Posterior_Fading","343460787_Block-Wisely_Supervised_Neural_Architecture_Search_With_Knowledge_Distillation","343456743_When_NAS_Meets_Robustness_In_Search_of_Robust_Architectures_Against_Adversarial_Attacks","343456489_Densely_Connected_Search_Space_for_More_Flexible_Neural_Architecture_Search","343336654_Neural_Architecture_Optimization","341306821_Deep_Attentive_Video_Summarization_With_Distribution_Consistency_Learning"]}