{"id":"351870218_Project_Based_Learning_with_Peer_Assessment_in_an_Introductory_Programming_Course","abstract":"Introductory programming course traditionally have higher rates of failures and dropouts. Teachers and researchers have to develop strategies to combat this problem. This article reports an experience on the first semester of a degree in computer science and the use of Project Based Learning for two projects with groups of three students. With this methodology, independence and self-study are created in the students, accompanying the subjects taught in classes with works related to real life. Since peer assessment is used in part of the classification of each project, the distribution of students by the groups was made by the teacher, who used as criteria for ordering said groups attendance in class for the first project and grade in the first test for the second project. The first project was submitted and presented by 95% of the students and the second project was only completed by 44% of the students who mostly correspond to the best grades on the first test. 93% of the students who passed the course presented both projects. Most of the students who submitted the papers found this to be an excellent strategy. It is concluded that the project is a way to improve and develop the skills of motivated students but that others have a lot of difficulty or even reluctance to follow. Index Terms-Project based learning, introduction to programming, motivation, active learning methodologies, peer assessment.","authors":["Sonia Rolland Sobral"],"meta":["May 2021International Journal of Information and Education Technology 11(7):337-341","DOI:10.18178/ijiet.2021.11.7.1532"],"references":["308343816_Effective_compiler_error_message_enhancement_for_novice_programming_students","305081807_Learning_to_Program_is_Easy","228872057_How_Does_Technology-Enabled_Active_Learning_Affect_Undergraduate_Students'_Understanding_of_Electromagnetism_Concepts","225207396_Teachers'_beliefs_about_issues_in_the_implementation_of_a_student-centered_learning_environment","313017285_One_more_time_How_do_you_motivate_employees","279352964_The_Science_of_Programming","262493823_The_Art_of_Computer_Programming","244488020_Peer_Assessment_Between_Students_in_Colleges_and_Universities","232543390_Motivating_Project-Based_Learning_Sustaining_the_Doing_Supporting_the_Learning","228328452_Active_Learning_Creating_Excitement_in_the_Classroom"]}