{"id":"351885658_Traitement_automatique_de_la_langue_pour_une_reponse_rapide_dans_le_cadre_d'une_maladie_emergente_exemple_de_la_COVID-19","abstract":"Introduction\nUne maladie émergente pose des problèmes spécifiques pour les outils informatiques. L’informatique biomédicale repose en grande partie sur les données structurées qui requièrent l’existence de données ou de modèles de connaissances. Cependant, une nouvelle maladie ne peut avoir de modèle de connaissances préexistant. Au cours d’une épidémie de maladie émergente, le traitement automatique de la langue (TAL) peut permettre la conversion rapide de données textuelles non structurées en un nouveau modèle de connaissances. Bien que cette idée ait déjà été suggérée, il n’y avait pas eu jusqu’à présent d’opportunité pour la tester en temps réel. La pandémie actuelle de COVID-19 en est une. L’objectif de cette étude était de montrer la valeur ajoutée de l’extraction par TAL de l’information clinique présente dans les textes pour répondre aux questions posées dans le cadre d’une maladie émergente.\n\nMéthodes\nNous avons exploré les effets à long-terme des traitements par inhibiteurs calciques sur le devenir des patients hypertendus, hospitalisés pour une infection COVID-19. Dans l’entrepôt de données de santé de l’AP-HP, nous avons comparé deux sources différentes d’information : les données structurées (codes diagnostics CIM10, résultats biologiques, prescriptions médicamenteuses) et les données extraites des textes cliniques par TAL.\n\nRésultats\nDans cette étude multicentrique sur les 39 hôpitaux de l’AP-HP, le TAL a permis d’augmenter suffisamment la puissance statistique pour rendre significatif un résultat de risque relatif ajusté alors qu’il ne l’était pas avec les données structurées uniquement (Fig. 1). En comparant aux données structurées, le nombre de patients incluables dans l’étude a été multiplié par 2,95, la quantité d’information sur les médicaments par 7,2 et les informations phénotypiques par 11,9.\n\nConclusion\nDans notre étude, l’utilisation d’inhibiteurs calciques était associée à une diminution de la mortalité intra-hospitalière chez les patients avec une infection COVID-19. Ces résultats ont été obtenus en adaptant rapidement des pipelines TAL au domaine d’une nouvelle maladie. Ce pipeline d’extraction était suffisamment performant pour extraire des informations utiles. Quand ces informations ont été utilisées pour enrichir les données structurées déjà disponibles, l’échantillon de l’étude a pu être suffisamment augmenté pour voir apparaitre un effet de traitement qui n’était jusqu’alors pas détectable.","authors":["Antoine Neuraz","Ivan Lerner","William Digan","Rosy Tsopra"],"meta":["June 2021Revue d Épidémiologie et de Santé Publique 69:S53-S54","DOI:10.1016/j.respe.2021.04.089"],"references":[]}