{"id":"351826871_Information_Cartography_in_Association_Rule_Mining","abstract":"Association Rule Mining is a machine learning method for discovering the interesting relations between the attributes in a huge transaction database. Typically, algorithms for Association Rule Mining generate a huge number of association rules, from which it is hard to extract structured knowledge and present this automatically in a form that would be suitable for the user. Recently, an information cartography has been proposed for creating structured summaries of information and visualizing with methodology called “metro maps”. This was applied to several problem domains, where pattern mining was necessary. The aim of this study is to develop a method for automatic creation of metro maps of information obtained by Association Rule Mining and, thus, spread its applicability to the other machine learning methods. Although the proposed method consists of multiple steps, its core presents metro map construction that is defined in the study as an optimization problem, which is solved using an evolutionary algorithm. Finally, this was applied to four well-known UCI Machine Learning datasets and one sport dataset. Visualizing the resulted metro maps not only justifies that this is a suitable tool for presenting structured knowledge hidden in data, but also that they can tell stories to users.","authors":["Iztok Fister jr.","Iztok Fister"],"meta":["May 2021IEEE Transactions on Emerging Topics in Computational Intelligence PP(99):1-17","DOI:10.1109/TETCI.2021.3074919"],"references":["338184751_Explainable_Artificial_Intelligence_XAI_Concepts_Taxonomies_Opportunities_and_Challenges_toward_Responsible_AI","330617148_The_Extraordinary_Characteristics_of_Dyslexia","323081337_arulesViz_Interactive_Visualization_of_Association_Rules_with_R","319335558_Apriori_Versions_Based_on_MapReduce_for_Mining_Frequent_Patterns_on_Big_Data","319126483_Combining_Apriori_Heuristic_and_Bio-Inspired_Algorithms_for_Solving_the_Frequent_Itemsets_Mining_Problem","307587257_The_SPMF_Open-Source_Data_Mining_Library_Version_2","341415517_Maximal_Association_Analysis_Using_Logical_Formulas_over_Soft_Sets","338039379_XAI-Explainable_artificial_intelligence","326745038_Mining_diversified_association_rules_in_big_datasets_A_clusterGPUgenetic_approach","312449512_Mining_Frequent_Patterns_without_Candidate_Generation"]}