{"id":"351846694_EFFECTIVE_FORMS_OF_IN-SERVICE_TEACHER_TRAINING","abstract":"Recently, when choosing types of in-service teacher training, the emphasis has shifted towards increasing the activity of participants in the educational process. Therefore, more effective are those types that are based on active interaction and intensive communication, based on unique life and professional experience and willingness to share it. Among such types of in-service teacher training, the authors distinguish participation in trainings, during which attention is paid to the practical development of skills through their own educational experience, and master classes, during which attention is paid to practical demonstration of creative solutions to a problem, new methodology, technology, author's model. The Department of Computer Science of Makarenko Sumy State Pedagogical University developed short courses of in-service teacher (computer science, physics, mathematics) training of Sumy region, which are focused on the formation / development of skills to create computer animations to support the educational process which was organized as trainings and master classes. The pedagogical experiment consisted in a comparative study of the effectiveness of selected learning forms (training or master class) for heterogeneous groups (groups of teachers with different experience). In addition, the following things were determined: degree of use of IT in professional activities, willingness to use computer animation at lessons, self-assessment of skills to develop computer animations for the learning purpose. According to the results of the experiment, it was found that the master class was more effective for teachers with less than 10 years of experience, and training – for teachers with more than 10 years of experience.","authors":["Marina Drushlyak","Artem Yurchenko","Anatolii Rozumenko","Olena Semenikhina"],"meta":["January 2021OPEN EDUCATIONAL E-ENVIRONMENT OF MODERN UNIVERSITY","DOI:10.28925/2414-0325.2021.108"],"references":["339588399_VIDKRITI_CIFROVI_OSVITNI_RESURSI_U_GALUZI_IT_KILKISNIJ_ANALIZ","327981335_In-service_Teacher_Training_Problems_of_the_Teachers_as_Learners","288409993_Computer_Science_Teachers'_In-service_Training_Needs_and_Their_Technological_Pedagogical_Content_Knowledge","28090794_Enlaces'_In-service_Teacher_Training_Strategies_A_Review_of_Critical_Features","339489863_INTELLECTUAL_TRAINING_-_MATHEMATICAL_PRACTICE_COMPETITION","333208338_A_Proposal_of_In-Service_Teacher_Training_Approach_for_Computer_Science_Teachers","332436127_Master-Class_As_An_Effective_Form_For_Pre-Service_Teacher_To_Implement_Visualization_Technologies_In_Subject_And_Professional_Activity"]}