{"id":"351892278_Generative_Adversarial_Network_Based_Automatic_Segmentation_of_Corneal_Subbasal_Nerves_on_In_Vivo_Confocal_Microscopy_Images","abstract":"Purpose: \nIn vivo confocal microscopy (IVCM) is a noninvasive, reproducible, and inexpensive diagnostic tool for corneal diseases. However, widespread and effortless image acquisition in IVCM creates serious image analysis workloads on ophthalmologists, and neural networks could solve this problem quickly. We have produced a novel deep learning algorithm based on generative adversarial networks (GANs), and we compare its accuracy for automatic segmentation of subbasal nerves in IVCM images with a fully convolutional neural network (U-Net) based method.\n\nMethods: \nWe have collected IVCM images from 85 subjects. U-Net and GAN-based image segmentation methods were trained and tested under the supervision of three clinicians for the segmentation of corneal subbasal nerves. Nerve segmentation results for GAN and U-Net-based methods were compared with the clinicians by using Pearson's R correlation, Bland-Altman analysis, and receiver operating characteristics (ROC) statistics. Additionally, different noises were applied on IVCM images to evaluate the performances of the algorithms with noises of biomedical imaging.\n\nResults: \nThe GAN-based algorithm demonstrated similar correlation and Bland-Altman analysis results with U-Net. The GAN-based method showed significantly higher accuracy compared to U-Net in ROC curves. Additionally, the performance of the U-Net deteriorated significantly with different noises, especially in speckle noise, compared to GAN.\n\nConclusions: \nThis study is the first application of GAN-based algorithms on IVCM images. The GAN-based algorithms demonstrated higher accuracy than U-Net for automatic corneal nerve segmentation in IVCM images, in patient-acquired images and noise applied images. This GAN-based segmentation method can be used as a facilitating diagnostic tool in ophthalmology clinics.\n\nTranslational relevance: \nGenerative adversarial networks are emerging deep learning models for medical image processing, which could be important clinical tools for rapid segmentation and analysis of corneal subbasal nerves in IVCM images.","authors":["Erdost Yıldız","Abdullah Taha Arslan","Ayse Yildiz Tas","Ali Faik Acer"],"meta":["May 2021Translational Vision Science & Technology 10(6):33","DOI:10.1167/tvst.10.6.33"],"references":["343522849_M-GAN_Retinal_Blood_Vessel_Segmentation_by_Balancing_Losses_Through_Stacked_Deep_Fully_Convolutional_Networks","343244902_Match_Feature_U-Net_Dynamic_Receptive_Field_Networks_for_Biomedical_Image_Segmentation","343164729_Automatic_Nodule_Segmentation_Method_for_CT_Images_Using_Aggregation-U-Net_Generative_Adversarial_Networks","355718745_An_Attention-oriented_U-Net_Model_and_Global_Feature_for_Medical_Image_Segmentation","346296011_A_descriptive_framework_for_the_field_of_deep_learning_applications_in_medical_images","344867557_Overview_of_Machine_Learning_Part_2_Deep_Learning_for_Medical_Image_Analysis","343733362_High_tissue_contrast_image_synthesis_via_multistage_attention-GAN_Application_to_segmenting_brain_MR_scans","343546193_GANs_for_Medical_Image_Analysis","343276841_Neuroaxonal_Degeneration_in_Patients_With_Multiple_Sclerosis_An_Optical_Coherence_Tomography_and_in_Vivo_Corneal_Confocal_Microscopy_Study","343196077_RefineU-Net_Improved_U-Net_with_Progressive_Global_Feedbacks_and_Residual_Attention_Guided_Local_Refinement_for_Medical_Image_Segmentation"]}