{"id":"351961248_Normalized_Multivariate_Time_Series_Causality_Analysis_and_Causal_Graph_Reconstruction","abstract":"Causality analysis is an important problem lying at the heart of science, and is of particular importance in data science and machine learning. An endeavor during the past 16 years viewing causality as a real physical notion so as to formulate it from first principles, however, seems to have gone unnoticed. This study introduces to the community this line of work, with a long-due generalization of the information flow-based bivariate time series causal inference to multivariate series, based on the recent advance in theoretical development. The resulting formula is transparent, and can be implemented as a computationally very efficient algorithm for application. It can be normalized and tested for statistical significance. Different from the previous work along this line where only information flows are estimated, here an algorithm is also implemented to quantify the influence of a unit to itself. While this forms a challenge in some causal inferences, here it comes naturally, and hence the identification of self-loops in a causal graph is fulfilled automatically as the causalities along edges are inferred. To demonstrate the power of the approach, presented here are two applications in extreme situations. The first is a network of multivariate processes buried in heavy noises (with the noise-to-signal ratio exceeding 100), and the second a network with nearly synchronized chaotic oscillators. In both graphs, confounding processes exist. While it seems to be a challenge to reconstruct from given series these causal graphs, an easy application of the algorithm immediately reveals the desideratum. Particularly, the confounding processes have been accurately differentiated. Considering the surge of interest in the community, this study is very timely.","authors":["X. San Liang"],"meta":["May 2021Entropy 23(6):679","DOI:10.3390/e23060679","Project: Causality and information flow ab initio"],"references":["349861944_A_Note_on_Causation_Versus_Correlation_in_an_Extreme_Situation","336604031_Testing_for_Dynamical_Dependence_Application_to_the_Surface_Mass_Balance_Over_Antarctica","326475420_Causality_dynamical_systems_and_the_arrow_of_time","295686948_On_the_causal_structure_between_CO2_and_global_temperature","295088352_Causal_discovery_and_inference_concepts_and_recent_methodological_advances","348280088_A_generalized_permutation_entropy_for_noisy_dynamics_and_random_processes","337909333_Disrupted_Information_Flow_in_Resting-State_in_Adolescents_With_Sports_Related_Concussion","335041777_A_Time-Varying_Causality_Formalism_Based_on_the_Liang-Kleeman_Information_Flow_for_Analyzing_Directed_Interactions_in_Nonstationary_Climate_Systems","326593966_Causation_and_information_flow_with_respect_to_relative_entropy","324292531_Statistical_Inference"]}