{"id":"351992378_Computing_Analysis_for_First_Zagreb_Connection_Index_and_Coindex_of_Resultant_Graphs","abstract":"A numeric parameter which studies the behaviour, structural, toxicological, experimental, and physicochemical properties of chemical compounds under several graphs' isomorphism is known as topological index. In 2018, Ali and Trinajstić studied the first Zagreb connection index (ZC 1) to evaluate the value of a molecule. is concept was first studied by Gutman and Trinajstić in 1972 to find the solution of π-electron energy of alternant hydrocarbons. In this paper, the first Zagreb connection index and coindex are obtained in the form of exact formulae and upper bounds for the resultant graphs in terms of different indices of their factor graphs, where the resultant graphs are obtained by the product-related operations on graphs such as tensor product, strong product, symmetric difference, and disjunction. At the end, an analysis of the obtained results for the first Zagreb connection index and coindex on the aforesaid resultant graphs is interpreted with the help of numerical values and graphical depictions.","authors":["Muhammad Javaid","Usman Ali Madaan","Jia-Bao Liu"],"meta":["March 2021Mathematical Problems in Engineering 2021(2021):19","DOI:10.1155/2021/6019517","Project: Computing Analysis for first Zagreb connection index and coindex of Resultant graphs"],"references":["347541665_First_General_Zagreb_Index_of_Generalized_F-sum_Graphs","346953508_Topological_properties_of_metal-organic_frameworks","344215911_On_bounds_for_topological_descriptors_of_ph-sum_graphs","343712782_Zagreb_Connection_Indices_of_Disjunction_and_Symmetric_Difference_Operations_on_Graphs","343712778_Upper_Bounds_of_Zagreb_Connection_Indices_of_Tensor_and_Strong_Product_on_Graphs","343700168_Zagreb_Connection_Indices_of_Molecular_Graphs_Based_on_Operations","343563009_Computing_Analysis_of_Connection-Based_Indices_and_Coindices_for_Product_of_Molecular_Networks","341224317_Modified_Zagreb_connection_indices_of_the_T-sum_graphs","340486206_Degree-Based_Topological_Invariants_Of_Metal-Organic_Networks","344343053_FORGOTTEN_INDEX_OF_GENERALIZED_F-SUM_GRAPHS"]}