{"id":"352030887_Deep_learning-based_classification_of_the_polar_emotions_of_moe-style_cartoon_pictures","abstract":"The cartoon animation industry has developed into a huge industrial chain with a large potential market involving games, digital entertainment, and other industries. However, due to the coarse-grained classification of cartoon materials, cartoon animators can hardly find relevant materials during the process of creation. The polar emotions of cartoon materials are an important reference for creators as they can help them easily obtain the pictures they need. Some methods for obtaining the emotions of cartoon pictures have been proposed, but most of these focus on expression recognition. Meanwhile, other emotion recognition methods are not ideal for use as cartoon materials. We propose a deep learning-based method to classify the polar emotions of the cartoon pictures of the \"Moe\" drawing style. According to the expression feature of the cartoon characters of this drawing style, we recognize the facial expressions of cartoon characters and extract the scene and facial features of the cartoon images. Then, we correct the emotions of the pictures obtained by the expression recognition according to the scene features. Finally, we can obtain the polar emotions of corresponding picture. We designed a dataset and performed verification tests on it, achieving 81.9% experimental accuracy. The experimental results prove that our method is competitive.","authors":["Qinchen Cao","Weilin Zhang","Yonghua Zhu"],"meta":["June 2021Tsinghua Science & Technology 26(3):275-286","DOI:10.26599/TST.2019.9010035"],"references":["282334489_Matching_caricatures_to_photographs","282072489_Robust_Image_Sentiment_Analysis_Using_Progressively_Trained_and_Domain_Transferred_Deep_Networks","267156066_Cross-Modal_Face_Matching_Beyond_Viewed_Sketches","261051365_Towards_automated_caricature_recognition","260299833_Memetically_Optimized_MCWLD_for_Matching_Sketches_With_Digital_Face_Images","221111151_ORB_an_efficient_alternative_to_SIFT_or_SURF","47641425_Analyzing_and_Predicting_Sentiment_of_Images_on_the_Social_Web","306081091_Deep_Learning_for_Emotion_Recognition_in_Faces","301876276_Joint_Face_Detection_and_Alignment_Using_Multitask_Cascaded_Convolutional_Networks","301875817_From_Pixels_to_Sentiment_Fine-tuning_CNNs_for_Visual_Sentiment_Prediction","301452472_Face_Painting_querying_art_with_photos","262370020_Sentribute_image_sentiment_analysis_from_a_mid-level_perspective","262314937_Large-scale_visual_sentiment_ontology_and_detectors_using_adjective_noun_pairs","262274175_Scaring_or_pleasing_Exploit_emotional_impact_of_an_image"]}