{"id":"352057362_The_Impact_of_ICDL_Training_on_Developing_Digital_Literacy_of_Young_People","abstract":"The purpose of this study is to examine how teaching ICDL courses could improve the IT skills of young people. A sample of 27 young participants was selected from Mosul city. A questionnaire and interviews regarding digital skills and knowledge were the data collection methods. The data were then analyzed to determine the current level of participants and to fulfill the objective of this study. At the end of the training course, the students were evaluated to analyze the learning outcomes of the course. According to the study findings, most of the participants improved their online and spreadsheets skills by an increase of 90 percent from their previously recorded results and around 50 percent increase for the computer and word processing essentials. The gender gap was not entirely evident in the conducted test as the participation rate of females was high and reached an approximation of 50% in total, however, female, and male counterparts of both age groups, proved competent during the tests, with males proving to be more successful in both age groups. This leads to the conclusion that more efforts are needed to rally females into being involved in the computer world and to challenge their male counterparts in computer literacy and in taking their future path in computer science majors. Additional ICDL training is also recommended to be given to IDPs and war-torn areas where a large percentage of youth lack the basic IT skills, as it is deemed useful to the recovery of their community and in turn, provide an adequate future to shape the return framework.","authors":["Mohammed Salim","Israa Nazhat","Saifuldeen H. Abdulrahman","Adnan Fadhil Khaleel"],"meta":["May 2021International Journal of Social Sciences and Educational Studies 8(2):16-27","DOI:10.23918/ijsses.v8i2p16"],"references":["316600734_Developing_a_New_e-Exam_Platform_to_Enhance_the_University_Academic_Examinations_the_Case_of_Lebanese_French_University","289678199_Ict_training_courses_for_teacher_professional_development_in_jordan","234728714_Certification_of_Computer_Literacy","225653208_Digital_Literacy_A_Vital_Competence_for_2010"]}