{"id":"352093380_Knowledge_and_Geo-Object_Based_Graph_Convolutional_Network_for_Remote_Sensing_Semantic_Segmentation","abstract":"Pixel-based semantic segmentation models fail to effectively express geographic objects and their topological relationships. Therefore, in semantic segmentation of remote sensing images, these models fail to avoid salt-and-pepper effects and cannot achieve high accuracy either. To solve these problems, object-based models such as graph neural networks (GNNs) are considered. However, traditional GNNs directly use similarity or spatial correlations between nodes to aggregate nodes’ information, which rely too much on the contextual information of the sample. The contextual information of the sample is often distorted, which results in a reduction in the node classification accuracy. To solve this problem, a knowledge and geo-object-based graph convolutional network (KGGCN) is proposed. The KGGCN uses superpixel blocks as nodes of the graph network and combines prior knowledge with spatial correlations during information aggregation. By incorporating the prior knowledge obtained from all samples of the study area, the receptive field of the node is extended from its sample context to the study area. Thus, the distortion of the sample context is overcome effectively. Experiments demonstrate that our model is improved by 3.7% compared with the baseline model named Cluster GCN and 4.1% compared with U-Net.","authors":["Wei Cui","Meng Yao","Yuanjie Hao","Ziwei Wang"],"meta":["June 2021Sensors 21(11):3848","DOI:10.3390/s21113848"],"references":["347957604_A_Fast_and_Compact_3-D_CNN_for_Hyperspectral_Image_Classification","347484413_Mapping_Land_Use_from_High_Resolution_Satellite_Images_by_Exploiting_the_Spatial_Arrangement_of_Land_Cover_Objects","346881748_Improved_Graph_Neural_Networks_for_Spatial_Networks_Using_Structure-Aware_Sampling","344579396_Remote_Sensing_Image_Classification_Based_on_a_Cross-Attention_Mechanism_and_Graph_Convolution","339790400_A_Multi-Scale_Superpixel-Guided_Filter_Feature_Extraction_and_Selection_Approach_for_Classification_of_Very-High-Resolution_Remotely_Sensed_Imagery","338509657_Knowledge-Embedded_Routing_Network_for_Scene_Graph_Generation","349431461_Self-Constructing_Graph_Convolutional_Networks_for_Semantic_Labeling","341583963_Hyperspectral_Image_Classification_With_Context-Aware_Dynamic_Graph_Convolutional_Network","339555274_Learning_Semantic-Specific_Graph_Representation_for_Multi-Label_Image_Recognition","338973172_Land-cover_classification_with_high-resolution_remote_sensing_images_using_transferable_deep_models"]}