{"id":"352005969_A_CASE_STUDY_CORPUS_FOR_ACADEMIC_ENGLISH_WRITING_BY_NNS_AUTHORS","abstract":"The concern with academic English writing as performed by NNS (non-native speakers of \nEnglish) has led to extensive literature and research over the past three decades. The origins \nwere probably best represented in the British Council’s realization of the term EAP (English \nfor Academic Purposes), in 1975, to refer to “interdisciplinary studies in relation to existing \npractices and institutions” (Brumfit, 1984: 17), or to “exchange of knowledge [...] according \nto specific features of specialised subject fields” (Baunmann, 1994: 1). Different perspectives \never since on the matter have been adopted, such as academic vocabulary knowledge (e.g., \nMartin, 1976), or writing in the genre conventions (e.g., Swales, 1995). Various schools or \nassociations have also formed as a result, for instance, in Britain, BALEAP, from which \nsignificant studies have developed (e.g., corpus data-driven learning, academic phraseology, \ndiscourse analysis in the academic setting, etc —see, among others, work by Johns, 1993; \nHowarth, 1998; Lockett, 1999, etc—). \nEAP often stands to the test in the achievement of foreign undergraduate and graduate \nwriting proficiency for specialized fields. The focus is on university compositions or essays \nwhere L2 learners ought to go through the re-writing procedures of content clarification, \nstructure revision, lexical-grammatical revision, and so forth, and where aspects of register \nand genre conventions play significant reference roles. Less consideration seems to be given, \nby comparison, to NNS research writing for publication aims, although just to give two \nexamples, Burrough-Boenisch (2003; 2005) examine proof-reading procedures in this line, \nobserving, among other aspects, the important position of rhetorical organization in the \nreviewing process. As far as my knowledge goes, however, no work has been done on corpus \nmaterial with the aim of analyzing L2 writing in the last phase prior to publication. \nIn this paper, the aim is to examine corpus-based analysis with both NS and NNS \nmaterial. The texts available for the corpus analysis are those authored by Spanish writers in \nComputer Science in their final versions; however, they are accessed prior to the journal \neditors’ last review. The corpus examination has been done by comparing the texts with NS \nmaterial from a selection of the BNC (British National Corpus) Sampler (Burnard and \nMcEnery, 1999). The chief objective in the process has been to identify both similarity and \ndivergence in terms of the significant lexical items used, especially academic lexical items \nand / or rhetorical-lexical items. Word co-occurrence and use probability in the contrasted \ncontexts determine academic competence, since the mastery of specific lexical patterns should \nindicate specialized writing (cf. Hoey, 2005). Based on the literature described below, an \nattempt at assessing two general hypotheses on NNS writing is also included.","authors":["Alejandro Curado"],"meta":["May 2009","In book: A survey of corpus-based research [Recurso electrónico] (pp.1101-1114)Publisher: AELINCO","Project: Foreign Language Learning Data-driven Learning"],"references":["292305786_Legal_discourse_Opportunities_and_threats_for_corpus_linguistics","233495397_Formulating_Writer_Stance_A_Contrastive_Study_of_EFL_Learner_Corpora","284191462_English_lexical_collocations","273555477_Phraseology_and_Second_Language_Proficiency","271693156_Teaching_Academic_Vocabulary_to_Foreign_Graduate_Students","245835400_Data-Driven_Learning_An_Update","245802611_Corpus_studies_and_probabilistic_grammar","240920269_Native_speaker_performance_validity_In_vain_or_for_gain","233571752_A_Corpus_Linguistic_Investigation_of_Vocabulary-based_Discourse_Units_in_University_Registers","223690768_Indirectness_in_L1_and_L2_academic_writing"]}