{"id":"352004240_A_Survey_on_Domination_in_Vague_Graphs_with_Application_in_Transferring_Cancer_Patients_between_Countries","abstract":"Many problems of practical interest can be modeled and solved by using fuzzy graph (FG) algorithms. In general, fuzzy graph theory has a wide range of application in various fields. Since indeterminate information is an essential real-life problem and is often uncertain, modeling these problems based on FG is highly demanding for an expert. A vague graph (VG) can manage the uncertainty relevant to the inconsistent and indeterminate information of all real-world problems in which fuzzy graphs may not succeed in bringing about satisfactory results. Domination in FGs theory is one of the most widely used concepts in various sciences, including psychology, computer sciences, nervous systems, artificial intelligence, decision-making theory, etc. Many research studies today are trying to find other applications for domination in their field of interest. Hence, in this paper, we introduce different kinds of domination sets, such as the edge dominating set (EDS), the total edge dominating set (TEDS), the global dominating set (GDS), and the restrained dominating set (RDS), in product vague graphs (PVGs) and try to represent the properties of each by giving some examples. The relation between independent edge sets (IESs) and edge covering sets (ECSs) are established. Moreover, we derive the necessary and sufficient conditions for an edge dominating set to be minimal and show when a dominance set can be a global dominance set. Finally, we try to explain the relationship between a restrained dominating set and a restrained independent set with an example. Today, we see that there are still diseases that can only be treated in certain countries because they require a long treatment period with special medical devices. One of these diseases is leukemia, which severely affects the immune system and the body’s defenses, making it impossible for the patient to continue living a normal life. Therefore, in this paper, using a dominating set, we try to categorize countries that are in a more favorable position in terms of medical facilities, so that we can transfer the patients to a suitable hospital in the countries better suited in terms of both cost and distance.","authors":["Yongsheng Rao","Ruxian Chen","Pu Wu","Huiqin Jiang"],"meta":["May 2021","DOI:10.3390/math9111258"],"references":["345400317_Vague_Graph_Structure_with_Application_in_Medical_Diagnosis","344238728_Domination_in_product_fuzzy_graphs","344238589_Domination_in_product_intuitionistic_fuzzy_graphs","343309796_New_Concepts_in_Intuitionistic_Fuzzy_Graph_with_Application_in_Water_Supplier_Systems","338781481_Maximal_Product_of_Graphs_under_Vague_Environment","336734598_Total_Efficient_Domination_in_Fuzzy_Graphs","328464770_Fuzzy_Decision_Making_in_Medical_Diagnosis_Using_an_Advanced_Distance_Measure_on_Intuitionistic_Fuzzy_Sets","326965390_Energy_of_Pythagorean_Fuzzy_Graphs_with_Applications","350196183_Arc_domination_in_fuzzy_graphs_using_strong_arcs","336812660_Novel_TOPSIS_Method_for_Group_Decision-Making_Based_on_Hesitant_m-Polar_Fuzzy_Model"]}