{"id":"352017840_Evolution_Strategies_for_Approximate_Solution_of_Bayesian_Games","abstract":"We address the problem of solving complex Bayesian games, characterized by high-dimensional type and action spaces, many (> 2) players, and general-sum payoffs. Our approach applies to symmetric one-shot Bayesian games, with no given analytic structure. We represent agent strategies in parametric form as neural networks, and apply natural evolution strategies (NES) (Wierstra et al. 2014) for deep model optimization. For pure equilibrium computation, we formulate the problem as bi-level optimization, and employ NES in an iterative algorithm to implement both inner-loop best response optimization and outer-loop regret minimization. In simple games including first-and second-price auctions, it is capable of recovering known analytic solutions. For mixed equilibrium computation, we adopt an incremental strategy generation framework, with NES as strategy generator producing a finite sequence of approximate best-response strategies. We then calculate equilib-ria over this finite strategy set via a model-based optimization process. Both our pure and mixed equilibrium computation methods employ NES to efficiently search for strategies over the function space, given only black-box simulation access to noisy payoff samples. We experimentally demonstrate the efficacy of all methods on two simultaneous sealed-bid auction games with distinct type distributions, and observe that the solutions exhibit qualitatively different behavior in these two environments.","authors":["Zun Li","Michael P Wellman"],"meta":["June 2021","Conference: Thirty-Fifth AAAI Conference on Artificial Intelligence"],"references":["333939999_Iterated_Deep_Reinforcement_Learning_in_Games_History-Aware_Training_for_Improved_Stability","319984839_Equilibria_in_symmetric_games_Theory_and_applications","355845732_Open-ended_learning_in_symmetric_zero-sum_games","344252397_A_Generalized_Training_Approach_for_Multiagent_Learning","331477508_A_Unified_Game-Theoretic_Approach_to_Multiagent_Reinforcement_Learning","318830250_Computing_Bayes-Nash_Equilibria_in_Combinatorial_Auctions_with_Continuous_Value_and_Action_Spaces","312078011_Best-Response_Dynamics_in_Combinatorial_Auctions_with_Item_Bidding","287274164_An_Exact_Double-Oracle_Algorithm_for_Zero-Sum_Extensive-Form_Games_with_Imperfect_Information","276395436_Fictitious_Self-Play_in_Extensive-Form_Games","269050392_Auctions_with_unique_equilibria"]}