{"id":"352074144_A_route_pruning_algorithm_for_an_automated_geographic_location_graph_construction","abstract":"Automated construction of location graphs is instrumental but challenging, particularly in logistics optimisation problems and agent-based movement simulations. Hence, we propose an algorithm for automated construction of location graphs, in which vertices correspond to geographic locations of interest and edges to direct travelling routes between them. Our approach involves two steps. In the first step, we use a routing service to compute distances between all pairs of L locations, resulting in a complete graph. In the second step, we prune this graph by removing edges corresponding to indirect routes, identified using the triangle inequality. The computational complexity of this second step is $$\\mathscr{O}(L^3)$$ O ( L 3 ) , which enables the computation of location graphs for all towns and cities on the road network of an entire continent. To illustrate the utility of our algorithm in an application, we constructed location graphs for four regions of different size and road infrastructures and compared them to manually created ground truths. Our algorithm simultaneously achieved precision and recall values around 0.9 for a wide range of the single hyperparameter, suggesting that it is a valid approach to create large location graphs for which a manual creation is infeasible.","authors":["Christoph Schweimer","Bernhard C. Geiger","Meizhu Wang","Sergiy Gogolenko"],"meta":["June 2021Scientific Reports 11(1)","DOI:10.1038/s41598-021-90943-8"],"references":["343777143_FACS_a_geospatial_agent-based_simulator_for_analysing_COVID-19_spread_and_public_health_measures_on_local_regions","334866029_Agent-Based_Model_ABM_for_City-Scale_Traffic_Simulation_A_Case_Study_on_San_Francisco","324739719_Hurricane_Evacuation_Modeling_Using_Behavior_Models_and_Scenario-Driven_Agent-based_Simulations","321321987_A_Conceptual_Design_of_Spatio-Temporal_Agent-Based_Model_for_Volcanic_Evacuation","320453789_A_generalized_simulation_development_approach_for_predicting_refugee_destinations","316736456_A_Survey_of_Shortest-Path_Algorithms","309738462_OSMNX_New_Methods_for_Acquiring_Constructing_Analyzing_and_Visualizing_Complex_Street_Networks","331747225_PruneJuice_Pruning_Trillion-edge_Graphs_to_a_Precise_Pattern-Matching_Solution","317319215_Modeling_logistic_systems_with_an_agent-based_model_and_dynamic_graphs","310515781_Route_Planning_in_Transportation_Networks"]}