{"id":"352107893_Botnet_Attack_Detection_Using_Local_Global_Best_Bat_Algorithm_for_Industrial_Internet_of_Things","abstract":"The need for timely identification of Distributed Denial-of-Service (DDoS) attacks in the Internet of Things (IoT) has become critical in minimizing security risks as the number of IoT devices deployed rapidly grows globally and the volume of such attacks rises to unprecedented levels. Instant detection facilitates network security by speeding up warning and disconnection from the network of infected IoT devices, thereby preventing the botnet from propagating and thereby stopping additional attacks. Several methods have been developed for detecting botnet attacks, such as Swarm Intelligence (SI) and Evolutionary Computing (EC)-based algorithms. In this study, we propose a Local-Global best Bat Algorithm for Neural Networks (LGBA-NN) to select both feature subsets and hyperparameters for efficient detection of botnet attacks, inferred from 9 commercial IoT devices infected by two botnets: Gafgyt and Mirai. The proposed Bat Algorithm (BA) adopted the local-global best-based inertia weight to update the bat’s velocity in the swarm. To tackle with swarm diversity of BA, we proposed Gaussian distribution used in the population initialization. Furthermore, the local search mechanism was followed by the Gaussian density function and local-global best function to achieve better exploration during each generation. Enhanced BA was further employed for neural network hyperparameter tuning and weight optimization to classify ten different botnet attacks with an additional one benign target class. The proposed LGBA-NN algorithm was tested on an N-BaIoT data set with extensive real traffic data with benign and malicious target classes. The performance of LGBA-NN was compared with several recent advanced approaches such as weight optimization using Particle Swarm Optimization (PSO-NN) and BA-NN. The experimental results revealed the superiority of LGBA-NN with 90% accuracy over other variants, i.e., BA-NN (85.5% accuracy) and PSO-NN (85.2% accuracy) in multi-class botnet attack detection.","authors":["Abdullah Alharbi","Wael Alosaimi","Hashem Alyami","Hafiz Tayyab Rauf"],"meta":["June 2021Electronics 10(11):1341","DOI:10.3390/electronics10111341","Project: Special issue: Recent Advances in Metaheuristic Techniques and Their Real-World Applications (Impact factor>4)"],"references":["349537101_Deep_Learning_Techniques_for_Android_Botnet_Detection","348743030_Classification_of_botnet_attacks_in_IoT_smart_factory_using_honeypot_combined_with_machine_learning","348286495_LNNLS-KH_A_Feature_Selection_Method_for_Network_Intrusion_Detection","348162473_Botnet_detection_using_negative_selection_algorithm_convolution_neural_network_and_classification_methods","347766379_The_Tangled_Genealogy_of_IoT_Malware","344726867_Network_intrusion_detection_system_A_systematic_study_of_machine_learning_and_deep_learning_approaches","344667545_Intelligent_Detection_of_IoT_Botnets_Using_Machine_Learning_and_Deep_Learning","343661977_Ensemble_Adaboost_classifier_for_accurate_and_fast_detection_of_botnet_attacks_in_connected_vehicles","346564822_An_Efficient_Approach_to_Detect_IoT_Botnet_Attacks_Using_Machine_Learning","343735920_Ensemble_machine_learning_approaches_for_webshell_detection_in_Internet_of_things_environments"]}