{"id":"352132667_Understanding_the_role_of_single-board_computers_in_engineering_and_computer_science_education_A_systematic_literature_review","abstract":"In the last decade, Single-Board Computers (SBCs) have been employed more frequently in engineering and computer science both to technical and educational levels. Several factors such as the versatility, the low-cost, and the possibility to enhance the learning process through technology have contributed to the educators and students usually employ these devices. However, the implications, possibilities, and constraints of these devices in engineering and Computer Science (CS) education have not been explored in detail. In this systematic literature review, we explore how the SBCs are employed in engineering and computer science and what educational results are derived from their usage in the period 2010-2020 at tertiary education. For that, 154 studies were selected out of n=605 collected from the academic databases Ei Compendex, ERIC, and Inspec. The analysis was carried out in two phases, identifying, e.g., areas of application, learning outcomes, and students and researchers’ perceptions. The results mainly indicate the following aspects: (1) The areas of laboratories and e-learning, computing education, robotics, Internet of Things (IoT), and persons with disabilities gather the studies in the review. (2) Researchers highlight the importance of the SBCs to transform the curricula in engineering and CS for the students to learn complex topics through experimentation in hands-on activities. (3) The typical cognitive learning outcomes reported by the authors are the improvement of the students’ grades and the technical skills regarding the topics in the courses. Concerning the affective learning outcomes, the increase of interest, motivation, and engagement are commonly reported by the authors.","authors":["Jonathan Álvarez Ariza","Heyson Baez"],"meta":["June 2021Computer Applications in Engineering Education","DOI:10.1002/cae.22439","Project: Education alternatives to teaching and learning programming"],"references":["335784485_Raspberry_Pi-based_HIL_simulators_for_control_education","343172080_Physical_Computing_and_its_Scope_-_Towards_a_Constructionist_Computer_Science_Curriculum_with_Physical_Computing","342136028_History_of_Logo","340549675_Physical_Computing_A_Key_Element_of_Modern_Computer_Science_Education","338366240_The_Impact_of_Incorporating_Hands-on_Raspberry_Pi_Projects_with_Undergraduate_Education_in_Boosting_Students'_Interest_in_ScientificEngineering_Majors_and_Encouraging_Women_and_Minorities_to_Advance_t","338203995_Teaching_on_Demand_an_HPC_Experience","337435483_Enhancing_Students'_Learning_Experience_via_Low-Cost_Network_Laboratories","336970785_A_Remote_Controllable_Supporting_Device_for_Deaf-blind_Person_using_Handwritten_Character","335784640_An_Approach_of_Training_Virtual_Environment_for_Teaching_Electro-Pneumatic_Systems","335479846_Developing_a_Condition_Monitoring_System_as_an_Artificial_Intelligence_Lab_Experiment","334766109_Case_Study_Using_Project_Based_Learning_to_Develop_Parallel_Programing_and_Soft_Skills","331266588_Raspberry_PI_and_role_of_IoT_in_Education","334766920_Using_Embedded_Xinu_and_the_Raspberry_Pi_3_to_Teach_Parallel_Computing_in_Assembly_Programming","331607434_Integrating_Hardware_Prototyping_Platforms_into_the_Classroom","331301765_CS0_Introducing_Computing_with_Raspberry_Pis"]}