{"id":"352182344_A_Framework_for_Evaluating_Agricultural_Ontologies","abstract":"An ontology is a formal representation of domain knowledge, which can be interpreted by machines. In recent years, ontologies have become a major tool for domain knowledge representation and a core component of many knowledge management systems, decision-support systems and other intelligent systems, inter alia, in the context of agriculture. A review of the existing literature on agricultural ontologies, however, reveals that most of the studies, which propose agricultural ontologies, are lacking an explicit evaluation procedure. This is undesired because without well-structured evaluation processes, it is difficult to consider the value of ontologies to research and practice. Moreover, it is difficult to rely on such ontologies and share them on the Semantic Web or between semantic-aware applications. With the growing number of ontology-based agricultural systems and the increasing popularity of the Semantic Web, it becomes essential that such evaluation methods are applied during the ontology development process. Our work contributes to the literature on agricultural ontologies by presenting a framework that guides the selection of suitable evaluation methods, which seems to be missing from most existing studies on agricultural ontologies. The framework supports the matching of appropriate evaluation methods for a given ontology based on the ontology’s purpose.","authors":["Anat Goldstein","Lior Fink","Gilad Ravid"],"meta":["June 2021Sustainability 13(11):6387","DOI:10.3390/su13116387"],"references":["351204313_Collaborative_Ontology_Engineering_Methodologies_for_the_Development_of_Decision_Support_Systems_Case_Studies_in_the_Healthcare_Domain","350527640_DOMUS_a_domestic_ontology_managed_ubiquitous_system","344385985_The_Ontologies_Community_of_Practice_A_CGIAR_Initiative_for_Big_Data_in_Agrifood_Systems","344372275_Ontologies_and_Artificial_Intelligence_Systems_for_the_Cooperative_Smart_Farming_Ecosystem","337497789_Study_on_Evolution_of_Food_Safety_Status_and_Supervision_Policy-A_System_Based_on_Quantity_Quality_and_Development_Safety","348546998_Traffic_accident_detection_and_condition_analysis_based_on_social_networking_data","343187063_An_intelligent_healthcare_monitoring_framework_using_wearable_sensors_and_social_networking_data","340126128_An_OWL_Based_Ontology_Model_for_Soils_and_Fertilizations_Knowledge_on_Maize_Crop_Farming_Scenario_for_Developing_Intelligent_Systems","337061483_Addressing_the_'Tower_of_Babel'_of_pesticide_regulations_an_ontology_for_supporting_pest-control_decisions","332993507_Review_and_Trend_Analysis_of_Knowledge_Graphs_for_Crop_Pest_and_Diseases_March_2019"]}