{"id":"352107858_Bad_machines_corrupt_good_morals","abstract":"As machines powered by artificial intelligence (AI) influence humans’ behaviour in ways that are both like and unlike the ways humans influence each other, worry emerges about the corrupting power of AI agents. To estimate the empirical validity of these fears, we review the available evidence from behavioural science, human–computer interaction and AI research. We propose four main social roles through which both humans and machines can influence ethical behaviour. These are: role model, advisor, partner and delegate. When AI agents become influencers (role models or advisors), their corrupting power may not exceed the corrupting power of humans (yet). However, AI agents acting as enablers of unethical behaviour (partners or delegates) have many characteristics that may let people reap unethical benefits while feeling good about themselves, a potentially perilous interaction. On the basis of these insights, we outline a research agenda to gain behavioural insights for better AI oversight. Köbis et al. outline how artificial intelligence (AI) agents can negatively influence human ethical behaviour. They discuss how this capacity of AI agents can cause problems in the future and put forward a research agenda to gain behavioural insights for better AI oversight.","authors":["Nils Kobis","Jean-François Bonnefon","Iyad Rahwan"],"meta":["June 2021Nature Human Behaviour 5(6)","DOI:10.1038/s41562-021-01128-2"],"references":["344431853_Artificial_intelligence_versus_Maya_Angelou_Experimental_evidence_that_people_cannot_differentiate_AI-generated_from_human-written_poetry","343898542_Forbidden_knowledge_in_machine_learning_reflections_on_the_limits_of_research_and_publication","351401372_Faultless_Responsibility_On_the_Nature_and_Allocation_of_Moral_Responsibility_for_Distributed_Moral_Actions","350181089_The_hype_machine_How_social_media_disrupts_our_elections_our_economy_and_our_health-_and_how_we_must_adapt","348784134_The_Effects_of_Experience_on_Deception_in_Human-Agent_Negotiation","347667235_Corruption_What_Everyone_Needs_to_KnowRWhat_Everyone_Needs_to_KnowR","347195209_Protecting_consumers_from_collusive_prices_due_to_AI","346875896_We_and_It_An_Interdisciplinary_Review_of_the_Experimental_Evidence_on_Human-Machine_Interaction","345845016_Artificial_Intelligence_Algorithmic_Pricing_and_Collusion","345032758_Chatbots_and_Gender_Stereotyping"]}