{"id":"352126952_Analysis_of_Network_Robustness_in_Weighted_and_Unweighted_Approaches_A_Case_Study_of_the_Air_Transport_Network_in_the_Belt_and_Road_Region","abstract":"Aviation transport is one of the most important and critical infrastructures in today’s global economy. Failure in its proper operations can seriously impact regional economic development, which is why it is important to evaluate network robustness. Previous analyses of robustness have mainly been conducted with an unweighted approach. In the development of air transport, however, the demand for route configuration has gradually decreased, while the demand for flight adjustments has increased. Consequently, the aviation network has developed unevenly, so adhering to a uniform approach for evaluating network robustness may lead to inaccurate results. Therefore, we examined which centrality sequence is the most sensitive to network robustness in both unweighted and weighted approaches. The air transport network selected for the case study comprised the six subregions of the Eurasian landmass of the Belt and Road region. The study results showed the following: (a) in the network constructed as an unweighted one, betweenness, and degree centrality had higher priorities in preserving network functionalities than eigenvector and closeness centrality; (b) in the network constructed as a weighted one, recursive power had a higher priority in preserving network functionalities than recursive centrality; and (c) no particular centrality measurement had a significant advantage in representing the totality of robustness. The betweenness centrality sequence was sensitive to the average shortest path length and global efficiency; the recursive power sequence was sensitive to the clustering coefficient, while degree centrality was sensitive to graph diversity. The findings of this study support the decisions about managing air transportation in the Belt and Road region.","authors":["Lu Zhang","Yannan Zhao","Dongli Chen","Xinhuan Zhang"],"meta":["June 2021Journal of Advanced Transportation 2021:1-13","DOI:10.1155/2021/8810254"],"references":["343580762_Integrators'_global_networks_A_topology_analysis_with_insights_into_the_effect_of_the_COVID-19_pandemic","341276235_Analysis_of_the_Air_Cargo_Transport_Network_using_a_Complex_Network_Theory_Perspective","335940746_Drawing_topological_properties_from_a_multi-layered_network_The_case_of_an_air_transport_network_in_the_Belt_and_Road_region","334555708_Robustness_and_Edge_Addition_Strategy_of_Air_Transport_Networks_A_Case_Study_of_the_Belt_and_Road","331108863_Approximating_Betweenness_Centrality_to_Identify_Key_Nodes_in_a_Weighted_Urban_Complex_Transportation_Network","329371929_Resilience_of_Transportation_Systems_Concepts_and_Comprehensive_Review","329371690_Efficiency_and_robustness_of_weighted_air_transport_networks","316449782_Robustness_Assessment_of_Urban_Road_Network_with_Consideration_of_Multiple_Hazard_Events","321215886_Identifying_multiple_influential_spreaders_based_on_generalized_closeness_centrality","313607570_The_architecture_of_complex_weighted_networks"]}