{"id":"352224784_MLatom_2_An_Integrative_Platform_for_Atomistic_Machine_Learning","abstract":"Atomistic machine learning (AML) simulations are used in chemistry at an ever-increasing pace. A large number of AML models has been developed, but their implementations are scattered among different packages, each with its own conventions for input and output. Thus, here we give an overview of our MLatom 2 software package, which provides an integrative platform for a wide variety of AML simulations by implementing from scratch and interfacing existing software for a range of state-of-the-art models. These include kernel method-based model types such as KREG (native implementation), sGDML, and GAP-SOAP as well as neural-network-based model types such as ANI, DeepPot-SE, and PhysNet. The theoretical foundations behind these methods are overviewed too. The modular structure of MLatom allows for easy extension to more AML model types. MLatom 2 also has many other capabilities useful for AML simulations, such as the support of custom descriptors, farthest-point and structure-based sampling, hyperparameter optimization, model evaluation, and automatic learning curve generation. It can also be used for such multi-step tasks as Δ-learning, self-correction approaches, and absorption spectrum simulation within the machine-learning nuclear-ensemble approach. Several of these MLatom 2 capabilities are showcased in application examples.","authors":["Pavlo O. Dral","Fuchun Ge","Bx Xue","Yi-Fan Hou"],"meta":["August 2021Topics in Current Chemistry 379(4)","DOI:10.1007/s41061-021-00339-5"],"references":["348140824_Restricted-Variance_Constrained_Reaction_Path_and_Transition_State_Molecular_Optimizations_Using_Gradient-Enhanced_Kriging","346821893_On_the_role_of_gradients_for_machine_learning_of_molecular_energies_and_forces","345976030_Neural_Network_Potential_Energy_Surfaces_for_Small_Molecules_and_Reactions","344301569_Array_programming_with_NumPy","343488835_Machine_Learning_for_Absorption_Cross_Sections","343586646_A_Gaussian_process_regression_adaptive_density_guided_approach_for_potential_energy_surface_construction","343337355_Permutationally_Invariant_Reproducing_Kernel-Based_Potential_Energy_Surfaces_for_Polyatomic_Molecules_From_Formaldehyde_to_Acetone","342369725_TorchANI_A_Free_and_Open_Source_PyTorch_Based_Deep_Learning_Implementation_of_the_ANI_Neural_Network_Potentials","342126478_Exploring_chemical_compound_space_with_quantum-based_machine_learning","341891223_Quantum_chemistry_assisted_by_machine_learning"]}