{"id":"352288846_DESIGNING_AN_ESP_COURSE_FOR_THE_21ST_CENTURY_STUDENTS_THE_CLASH_OF_THE_DIGITAL_IMMIGRANTS_AND_NATIVES","abstract":"How do teachers design an ESP syllabus for the students born and raised with technology? Are we prepared for the students arriving at universities with new ways of thinking and consuming information? Is it time for us to rethink and re-examine the way we create our syllabi? The ESP course for Computer Science students taught at the South East European University (SEEU) in Macedonia is designed according to students’ needs and it includes a number of 21st century skills. 21st Century skills are 12 abilities that today’s students need to succeed in their careers during the Information Age. Upon successful completion of the course, students are expected to be able to use the language that they will acquire and practice throughout the course, integrating the four main language elements and skills towards fulfilling their academic needs as well as their occupational needs for their future careers. The idea of this paper is to show whether the author, being a digital immigrant herself, has succeed in creating an engaging and motivating syllabus for the digital natives. It will also cover some aspects of the online teaching during the COVID-19 pandemic. As it will be demonstrated in the paper, letting students have a say in the design of the syllabus proved to be beneficial for both parties.","authors":["Daniela Kirovska-Simjanoska"],"meta":["March 2021Journal of Teaching English for Specific and Academic Purposes","DOI:10.22190/JTESAP2101017K"],"references":["282905477_The_use_of_technology_in_English_for_specific_purposes_ESP_instruction_a_literature_review","260675245_Interactive_Education_Impact_of_the_Internet_on_Learning_Teaching","292455981_Content_area_literacy_lessons_go_high_tech","259850562_Fostering_learner_autonomy_in_English_for_science_A_collaborative_digital_video_project_in_a_technological_learning_environment","245875187_Discourse_functions_and_syntactic_complexity_in_synchronous_and_asynchronous_communication_Electronic_version","242605045_Effects_of_computer_assisted_instruction_CAI_on_secondary_school_students'_performance_in_biology","235316599_Digital_Natives_Digital_Immigrants_Part_1","223107305_Surveying_instructor_and_learner_attitudes_toward_E-learning","222416067_Investigating_students'_perceived_satisfaction_behavioral_intention_and_effectiveness_of_e-learning_A_case_study_of_the_Blackboard_system","29470946_First_Year_Students'_Experiences_with_Technology_Are_they_really_Digital_Natives"]}