{"id":"352285471_Protected_area_networks_do_not_represent_unseen_biodiversity","abstract":"Most existing protected area networks are biased to protect charismatic species or landscapes. We hypothesized that conservation networks designed to include unseen biodiversity—species rich groups that consist of inconspicuous taxa, or groups affected by knowledge gaps—are more efficient than networks that ignore these groups. To test this hypothesis, we generated species distribution models for 3006 arthropod species to determine which were represented in three networks of different sizes and biogeographic origin. We assessed the efficiency of each network using spatial prioritization to measure its completeness, the increment needed to achieve conservation targets, and its specificity, the extent to which proposed priority areas to maximize unseen biodiversity overlap with existing networks. We found that the representativeness of unseen biodiversity in the studied protected areas, or extrinsic representativeness, is low, with ~ 40% of the analyzed unseen biodiversity species being unprotected. We also found that existing networks should be expanded ~ 26% to 46% of their current area to complete targets, and that existing networks do not efficiently conserve the unseen biodiversity given their low specificity (as low as 8.8%) unseen biodiversity. We conclude that information on unseen biodiversity must be included in systematic conservation planning approaches to design more efficient and ecologically representative protected areas.","authors":["Ángel Delso","Javier Fajardo","Jesús Muñoz"],"meta":["June 2021Scientific Reports 11(1):12275","DOI:10.1038/s41598-021-91651-z"],"references":["347784945_On_opportunities_and_threats_to_conserve_the_phylogenetic_diversity_of_Neotropical_palms","346776896_Towards_a_taxonomically_unbiased_European_Union_biodiversity_strategy_for_2030","334495831_Total_economic_valuation_of_the_National_Park_units_and_National_Park_Service_cooperative_programs","332356315_Protected_area_targets_post-2020","330910306_Are_we_eating_the_world's_megafauna_to_extinction","330510248_CoordinateCleaner_Standardized_cleaning_of_occurrence_records_from_biological_collection_databases","338842238_Shaping_the_Fate_of_Life_on_Earth_The_Post-2020_Global_Biodiversity_Framework_The_Post-2020_Global_Biodiversity_Framework","338813656_Evaluation_of_five_taxa_as_surrogates_for_conservation_prioritization_in_the_Transmexican_Volcanic_Belt_Mexico","333247468_Cost-effective_protection_of_biodiversity_in_the_western_Amazon","330752604_Worldwide_decline_of_the_entomofauna_A_review_of_its_drivers"]}