{"id":"352216111_Early_assessment_of_lung_function_in_coronavirus_patients_using_invariant_markers_from_chest_X-rays_images","abstract":"The primary goal of this manuscript is to develop a computer assisted diagnostic (CAD) system to assess pulmonary function and risk of mortality in patients with coronavirus disease 2019 (COVID-19). The CAD system processes chest X-ray data and provides accurate, objective imaging markers to assist in the determination of patients with a higher risk of death and thus are more likely to require mechanical ventilation and/or more intensive clinical care.To obtain an accurate stochastic model that has the ability to detect the severity of lung infection, we develop a second-order Markov-Gibbs random field (MGRF) invariant under rigid transformation (translation or rotation of the image) as well as scale (i.e., pixel size). The parameters of the MGRF model are learned automatically, given a training set of X-ray images with affected lung regions labeled. An X-ray input to the system undergoes pre-processing to correct for non-uniformity of illumination and to delimit the boundary of the lung, using either a fully-automated segmentation routine or manual delineation provided by the radiologist, prior to the diagnosis. The steps of the proposed methodology are: (i) estimate the Gibbs energy at several different radii to describe the inhomogeneity in lung infection; (ii) compute the cumulative distribution function (CDF) as a new representation to describe the local inhomogeneity in the infected region of lung; and (iii) input the CDFs to a new neural network-based fusion system to determine whether the severity of lung infection is low or high. This approach is tested on 200 clinical X-rays from 200 COVID-19 positive patients, 100 of whom died and 100 who recovered using multiple training/testing processes including leave-one-subject-out (LOSO), tenfold, fourfold, and twofold cross-validation tests. The Gibbs energy for lung pathology was estimated at three concentric rings of increasing radii. The accuracy and Dice similarity coefficient (DSC) of the system steadily improved as the radius increased. The overall CAD system combined the estimated Gibbs energy information from all radii and achieved a sensitivity, specificity, accuracy, and DSC of 100%, 97% ± 3%, 98% ± 2%, and 98% ± 2%, respectively, by twofold cross validation. Alternative classification algorithms, including support vector machine, random forest, naive Bayes classifier, K-nearest neighbors, and decision trees all produced inferior results compared to the proposed neural network used in this CAD system. The experiments demonstrate the feasibility of the proposed system as a novel tool to objectively assess disease severity and predict mortality in COVID-19 patients. The proposed tool can assist physicians to determine which patients might require more intensive clinical care, such a mechanical respiratory support.","authors":["Mohamed Elsharkawy","Ahmed Sharafeldeen","Dr. Fatma Taher","Ahmed Shalaby"],"meta":["June 2021Scientific Reports 11(1):12095","DOI:10.1038/s41598-021-91305-0"],"references":["352225050_Deep_Learning_on_Chest_X-ray_Images_to_Detect_and_Evaluate_Pneumonia_Cases_at_the_Era_of_COVID-19","351445526_Automatic_detection_of_coronavirus_disease_COVID-19_using_X-ray_images_and_deep_convolutional_neural_networks","346521704_COVID-Net_a_tailored_deep_convolutional_neural_network_design_for_detection_of_COVID-19_cases_from_chest_X-ray_images","343882469_Coronavirus_Disease_COVID-19_Detection_in_Chest_X-Ray_Images_using_Majority_Voting_Based_Classifier_Ensemble","341508266_Artificial_intelligence-enabled_rapid_diagnosis_of_patients_with_COVID-19","341414651_Diagnostic_Tools_for_Coronavirus_Disease_COVID-19_Comparing_CT_and_RT-PCR_Viral_Nucleic_Acid_Testing","349974101_Typical_Imaging_Patterns_in_COVID-19_Infections_of_the_Lung_on_Plain_Chest_Radiographs_to_Aid_Early_Triage","341645521_ICU_and_Ventilator_Mortality_Among_Critically_Ill_Adults_With_Coronavirus_Disease_2019","341557901_A_review_on_the_use_of_artificial_intelligence_for_medical_imaging_of_the_lungs_of_patients_with_coronavirus_disease_2019","341372933_Diagnostic_Performance_of_Chest_X-Ray_for_COVID-19_Pneumonia_During_the_SARS-CoV-2_Pandemic_in_Lombardy_Italy"]}