{"id":"352387163_Evolutionary_Multitasking_Multilayer_Network_Reconstruction","abstract":"Due to the multilayer nature of real-world systems, the problem of inferring multilayer network structures from nonlinear and complex dynamical systems is prominent in many fields, including engineering, biological, physical, and computer sciences. Many network reconstruction methods have been proposed to address this problem, but none of them consider the similarities among network reconstruction tasks at different component layers, which are inspired by topology correlations and dynamic couplings among different component layers. This paper develops an evolutionary multitasking multilayer network reconstruction framework to make use of the correlations among different component layers to improve the reconstruction performance; we refer to this framework as EM2MNR. In EM2MNR, the multilayer network reconstruction problem is first established as a multitasking multilayer network reconstruction problem, where the goal of each task is to reconstruct the network structure of a component layer. In addition, multitasking multilayer network reconstruction problems are high-dimensional, but existing evolutionary multitasking algorithms may have poor performance when dealing with optimization problems with a high-dimensional search space. Inspired by the sparsity of multilayer networks, EM2MNR employs the restricted Boltzmann machine to extract low effective features from the original decision space and then decides whether to conduct knowledge transfer on these features. To verify the performance of EM2MNR, this paper also designs a test suite for multilayer network reconstruction problems. The experimental results demonstrate the significant improvement obtained by the proposed EM2MNR framework on 96 multilayer network reconstruction problems. Index Terms-Multilayer network, evolutionary multitasking optimization, knowledge transfer, network reconstruction.","authors":["Kai Wu","Chao Wang","Jing Liu"],"meta":["June 2021IEEE Transactions on Cybernetics PP(99)","DOI:10.1109/TCYB.2021.3090769","Project: Evolutionary Multitasking Optimization"],"references":["350365520_Solving_Multi-task_Optimization_Problems_with_Adaptive_Knowledge_Transfer_via_Anomaly_Detection","343688291_An_Evolutionary_Multi-Objective_Framework_for_Complex_Network_Reconstruction_Using_Community_Structure","339999367_Cognizant_Multitasking_in_Multi-Objective_Multifactorial_Evolution_MO-MFEA-II","339782398_Solving_Large-Scale_Multi-Objective_Optimization_Problems_with_Sparse_Optimal_Solutions_via_Unsupervised_Neural_Networks","341096103_A_Unified_Framework_of_Graph-Based_Evolutionary_Multitasking_Hyper-Heuristic","339937265_SDARE_A_stacked_denoising_autoencoder_method_for_game_dynamics_network_structure_reconstruction","339859079_An_Effective_Knowledge_Transfer_Approach_for_Multiobjective_Multitasking_Optimization","339757725_Toward_Adaptive_Knowledge_Transfer_in_Multifactorial_Evolutionary_Computation","339703772_Explicit_Evolutionary_Multitasking_for_Combinatorial_Optimization_A_Case_Study_on_Capacitated_Vehicle_Routing_Problem","338444893_Data_Based_Reconstruction_of_Duplex_Networks"]}