{"id":"352359072_A_Gigabyte_Interpreted_Seismic_Dataset_for_Automatic_Fault_Recognition","abstract":"The lack of large-scale open-source expert-labelled seismic datasets is one of the barriers to applying today’s AI techniques to automatic fault recognition tasks. The dataset present in this article consists of a large number of processed seismic images and their corresponding fault annotations. The processed seismic images, which are originally from a seismic survey called Thebe Gas Field in the Exmouth Plateau of the Carnarvan Basin on the NW shelf of Australia, are represented in Python Numpy format, which can be easily adopted by various AI models and will facilitate cooperation with researchers in the field of computer science. The corresponding fault annotations were firstly manually labelled by expert interpreters of faults from seismic data in order to investigate the structural style and associated evolution of the basin. Then the fault interpretation and seismic survey are processed and collected using Petrel software and Python programs separately. This dataset can help to train, validate, and evaluate the performance of different automatic fault recognition workflow.","authors":["Yu An","Jiulin Guo","Qing Ye","Conrad Childs"],"meta":["June 2021Data in Brief 37(7825):107219","DOI:10.1016/j.dib.2021.107219","Project: Automatic Geological Fault Interpretation"],"references":["350930239_Deep_convolutional_neural_network_for_automatic_fault_recognition_from_3D_seismic_datasets","344301569_Array_programming_with_NumPy","335103802_Building_realistic_structure_models_to_train_convolutional_neural_networks_for_seismic_structural_interpretation","330993964_FaultSeg3D_Using_synthetic_data_sets_to_train_an_end-to-end_convolutional_neural_network_for_3D_seismic_fault_segmentation","347432108_Overlap_Training_to_Mitigate_Inconsistencies_Caused_by_Image_Tiling_in_CNNs","337147967_Seismic_fault_detection_in_real_data_using_transfer_learning_from_a_convolutional_neural_network_pre-trained_with_synthetic_seismic_data","328327471_Seismic_Fault_Detection_from_Post-Stack_Amplitude_by_Convolutional_Neural_Networks"]}