{"id":"352338383_Mainsail_Planform_Optimization_For_IRC_52_Using_Fluid_Structure_Interaction","abstract":"Most IRC 52 based upon existing TP52 retain their original rig proportions and mainsail girths to avoid the cost and disruption of a rig change and to not disturb he finely tuned yaw balance. It is not obvious whether the mainsail proportions essentially dictated by the TP52 box rule (aggressively square topped mainsails) are actually optimal under IRC even though IRC 52 with TP52 style mainsails tend to successfully compete under IRC. To determine the answer to this question, a mainsail planform investigation was performed as collaboration between Botin Partners and Quantum Sail Design Group.\nThe mainsail planform investigation utilized a Fluid Structure Interaction (FSI) program developed by Quantum Sail Design Group (QSDG) known as IQ Technology (IQT) that consists of sail geometry definition, inviscid Computational Fluid Dynamics (CFD), Finite Element Analysis (FEA), Velocity Prediction Program (VPP), and shape validation (based upon VSPARS) modules. Applicability of the inviscid CFD was validated by comparison to a limited number of viscous flow solutions, i.e. RANS analysis, performed by Porto Ricerca.\nTwo mainsails were considered, a conventional TP52 style and an alternative that was chosen to be closer to the IRC default girth values. To maintain sail area and yaw balance, the alternative mainsail had a longer P and E. The focus of the study was exclusively on upwind performance, i.e. to maximize upwind Velocity Made Good (VMG).\nResults from the study suggest that a TP52 style mainsail is not optimal under IRC. The combination of rating reduction and predicted performance advantages over a wide range of wind speeds suggest that an alternative mainsail with larger P and E with girth values closer to the IRC default values is a superior choice for an IRC 52.","authors":["Robert Ranzenbach","Dave Armitage","Adolfo Carrau"],"meta":["March 2013","DOI:10.5957/CSYS-2013-005","Conference: SNAME 21st Chesapeake Sailing Yacht Symposium"],"references":[]}