{"id":"352440890_RDF-BF-Hypergraph_Representation_for_Relational_Database","abstract":"The semantic web is designed to provide machine accessible meaning for its constructs. Semantic web depends on Resource Description Framework (RDF), which is a standard model for data interchange on the Web. The RDF can be represented as graph which is known as RDF graph data model. One of the goals of the semantic web is to display the huge quantities of data that is stored in the Rela-tional Databases (RDB) for computer processing. In order to integrate RDB into semantic web applications, RDB should be represented as RDF graph data model, which is fundamental for developing the semantic web in the recent decade. In the last decades a special class of database schemes, called acyclic database schema was introduced. This class is preferred in order to minimize the time of answering query and decrease its space efficient access paths. Also the result of answering a query will be reduced specially in the case of representing RDB as graph data model. This paper introduces a Backward and Forward hypergrapg (BF-hypergraph) representation for the RDF schema that corresponds to RDB schema. The BF-hypergraph is a suitable model to represent the set of functional dependencies of RDB, since the domain and codomain of the functional dependency may contain more than one attribute. Finally, the paper proposes a model to represent the RDF-BF-hypergraph schema that corresponds to an acyclic/cyclic RDB schema according to its set of functional dependency. A formal representation of RDF graph schema will preserve the integrity constraints and data semantics. Moreover, a formal representation of RDF graph schema will facilitate the data conversion and will allow graph connectivity which is essential for querying the RDF using various traversal algorithms.","authors":["F M Fayed","Fayed F. M. Ghaleb","Azza A Taha","Maryam Hazman"],"meta":["January 2020International Journal of Mathematics and Computer Science 15(1):41-64"],"references":["228532507_Directed_hyper-graphs_for_RDF_documents","225265076_Bipartite_Graphs_as_Intermediate_Model_for_RDF","333840258_Instance_and_Output_Optimal_Parallel_Algorithms_for_Acyclic_Joins","320074732_Foundations_of_Modern_Query_Languages_for_Graph_Databases","305300783_An_Introduction_To_Database_System","272829811_Resource_Description_Framework_RDF_Concepts_and_Abstract_Syntax_W3C_Recommendation_10_February_2004","247337588_RDF_Model_and_Syntax_Specification_W3C_Recommendation","242378067_On_the_universal_relation","238307944_Resource_Description_Framework_RDF_W3C_Semantic_Web_Activity","222469115_Directed_Hypergraphs_And_Applications"]}