{"id":"352404302_Belief_propagation_with_quantum_messages_for_quantum-enhanced_classical_communications","abstract":"For space-based laser communications, when the mean photon number per received optical pulse is much smaller than one, there is a large gap between communications capacity achievable with a receiver that performs individual pulse-by-pulse detection, and the quantum-optimal “joint-detection receiver” that acts collectively on long codeword-blocks of modulated pulses; an effect often termed “superadditive capacity”. In this paper, we consider the simplest scenario where a large superadditive capacity is known: a pure-loss channel with a coherent-state binary phase-shift keyed (BPSK) modulation. The two BPSK states can be mapped conceptually to two non-orthogonal states of a qubit, described by an inner product that is a function of the mean photon number per pulse. Using this map, we derive an explicit construction of the quantum circuit of a joint-detection receiver based on a recent idea of “belief-propagation with quantum messages” (BPQM). We quantify its performance improvement over the Dolinar receiver that performs optimal pulse-by-pulse detection, which represents the best “classical” approach. We analyze the scheme rigorously and show that it achieves the quantum limit of minimum average error probability in discriminating 8 (BPSK) codewords of a length-5 binary linear code with a tree factor graph. Our result suggests that a BPQM receiver might attain the Holevo capacity of this BPSK-modulated pure-loss channel. Moreover, our receiver circuit provides an alternative proposal for a quantum supremacy experiment, targeted at a specific application that can potentially be implemented on a small, special-purpose, photonic quantum computer capable of performing cat-basis universal qubit logic.","authors":["Narayanan Rengaswamy","Kaushik Parasuram Seshadreesan","Saikat Guha","Henry David Pfister"],"meta":["June 2021npj Quantum Information 7(1):97","DOI:10.1038/s41534-021-00422-1"],"references":["339634438_Low-cost_limit_of_classical_communication_with_restricted_quantum_measurements","336744162_Quantum_supremacy_using_a_programmable_superconducting_processor","315764648_A_Message-Passing_Algorithm_for_Graph_Isomorphism","305401725_Belief_propagation_decoding_of_quantum_channels_by_passing_quantum_messages","257200993_Threshold_saturation_for_spatially_coupled_LDPC_and_LDGM_codes_on_BMS_channels","323165109_Fundamental_Limitations_for_Measurements_in_Quantum_Many-Body_Systems","312594447_Duality_of_Channels_and_Codes","287728022_An_optimum_receiver_for_the_binary_coherent_state_quantum_channel","265564295_Quantum_Computation_and_Quantum_Information_10th_Anniversary_Edition","235449004_Quantum_belief_propagation_An_algorithm_for_thermal_quantum_systems","231115434_Schrodinger_cats_and_their_power_for_quantum_information_processing","235410460_Understanding_belief_propagation_and_its_generalizations","230750460_Achieving_minimum-error_discrimination_of_an_arbitrary_set_of_laser-light_pulses","228571361_Characterization_of_belief_propagation_and_its_generalizations","226104110_Quantum_Detection_and_Estimation_Theory"]}