{"id":"352563636_Research_on_the_cultivation_of_applied_innovative_talents_in_art_design_under_the_background_of_new_liberal_arts_construction_based_on_Cocos_Digital_Technology","abstract":"In today’s new era of digital technology-driven innovation, the continuous development of information technology has brought reforms and innovations to the education field, and has injected new vitality into the modernization of education in my country. The use of information technology to promote educational reforms is incorporated into education related policies. Innovation is the driving force of national development, and it is also the focus of international competition and talent training under the background of economic globalization. The construction of new liberal arts is an innovative development measure for China’s higher liberal arts education in the new era. It is the emphasis and requirement of liberal arts in the development of science and technology today. In the context of the new liberal arts, the training of art design professionals should be cross-integrated with computer science, information technology and other disciplines, combined with the development and needs of regional digital industries, breaking professional boundaries, and mastering cutting-edge technology on the premise of adhering to the core values of art and design education. At the same time, reconstruct the talent training model. This article elaborated on the development trend of digital and informatization of art design education in the talent training and discipline construction of the art design major, and the official team of Cocos Engine-Yaji Software to build the Cocos Digital Technology Industry College to create a new mode of efficient integration of production and education., To build a unique digital art talent training system, to effectively connect the talent chain and the industrial chain, to promote the industrialization of academic achievements, to cultivate application-oriented talents that meet the needs of the digital industry, and to promote the construction of a new liberal arts major in art design.","authors":["Jianjie Gao","Wenqing Lai","Xiurong Huang"],"meta":["January 2021E3S Web of Conferences 275:03026","DOI:10.1051/e3sconf/202127503026"],"references":[]}