{"id":"352559206_El_impacto_de_los_recursos_educativos_abiertos_en_la_socializacion_del_conocimiento_en_el_sistema_educativo_ecuatoriano","abstract":"La educación superior se encuentra frente a retos muy importantes en el proceso de enseñanza-aprendizaje, uno de ellos es la accesibilidad a los recursos educativos. Las Tecnologías de la Información y la Comunicación (TIC) cumplen un papel importante en este proceso, por contribuir a la accesibilidad de los recursos educativos que un estudiante puede consultar en la construcción de conocimientos. Además, permite que el contenido de una disciplina pueda ser distribuido por instituciones educativas para que los estudiantes puedan capacitarse en un área específica. La investigación se desenvuelve dentro de una problemática social de la población ecuatoriana, específicamente en el sistema educativo, debido a que la accesibilidad de los recursos educativos afecta en el proceso de enseñanza-aprendizaje. El objetivo de la investigación es realizar un análisis crítico de los resultados del plan piloto implementado en la Escuela de Ciencias de la Computación de la UTPL, a partir de la aplicación de Recursos Educativos Abiertos, que contribuya a mejorar el proceso de enseñanza-aprendizaje en las universidades del Ecuador. Para ello, la investigación se compuso por 3 fases, el estudio de los principales referentes teóricos, la aplicación de los recursos educativos abiertos en la Universidad Técnica Particular de Loja (UTPL) del Ecuador y el análisis de los resultados arrojados, siendo utilizados varios métodos científicos como la entrevista y el análisis documental. Los criterios obtenidos como resultado permitieron cumplir con el objetivo definido en la investigación. Palabras clave: accesibilidad; gestión del conocimiento; recursos educativos abiertos, tecnología de la información y la comunicación.","authors":["José Felipe Ramírez Pérez","Jessenia Guadalupe Chalén Ortega","Roxana Cañizares González"],"meta":["June 2021","Project: Gestión Integrada de Proyectos"],"references":["351286286_Impacto_de_la_Maestria_en_Informatica_Medica_Aplicada_en_la_informatizacion_de_la_salud_publica_cubana","336174794_Objetos_de_Aprendizaje_y_Recursos_Educativos_Abiertos_en_Educacion_Superior","324833239_EVALUACION_DE_ACCESIBILIDAD_DE_RECURSOS_EDUCATIVOS_DIGITALES_identificando_barreras_para_usuarios_con_discapacidad_visual_total","295249293_Open_educational_resources_and_college_textbook_choices_a_review_of_research_on_efficacy_and_perceptions","275249778_Acceso_abierto_y_su_repercusion_en_la_Sociedad_del_Conocimiento_Reflexiones_de_casos_practicos_en_Latinoamerica","256282309_Perspectives_on_Open_and_Distance_Learning_Open_Educational_Resources_Innovation_Research_and_Practice","349262322_Tecnologias_digitales_para_la_innovacion_en_educacion_una_revision_teorica_de_procesos_de_aprendizaje_mediados_por_dispositivos_moviles","284196134_Open_Educational_Resources","277074045_Software_libre_para_una_sociedad_libre","234021610_Social_Behavior_as_Exchange","221955684_Trust_in_management_and_knowledge_sharing_The_mediating_effects_of_fear_and_knowledge_documentation"]}