{"id":"352563696_Convex_restrictions_in_physical_design","abstract":"In a physical design problem, the designer chooses values of some physical parameters, within limits, to optimize the resulting field. We focus on the specific case in which each physical design parameter is the ratio of two field variables. This form occurs for photonic design with real scalar fields, diffusion-type systems, and others. We show that such problems can be reduced to a convex optimization problem, and therefore efficiently solved globally, given the sign of an optimal field at every point. This observation suggests a heuristic, in which the signs of the field are iteratively updated. This heuristic appears to have good practical performance on diffusion-type problems (including thermal design and resistive circuit design) and some control problems, while exhibiting moderate performance on photonic design problems. We also show in many practical cases there exist globally optimal designs whose design parameters are maximized or minimized at each point in the domain, i.e., that there is a discrete globally optimal structure.","authors":["Guillermo Angeris","Jelena Vuckovic","Stephen Boyd"],"meta":["June 2021Scientific Reports 11(1):12976","DOI:10.1038/s41598-021-92451-1"],"references":["341447172_Design_of_Thermal_Systems_Using_Topology_Optimization","331598945_Fundamental_Limits_to_Near-Field_Optical_Response_over_Any_Bandwidth","322652559_Outlook_for_inverse_design_in_nanophotonics","293804008_Fundamental_limits_to_optical_response_in_absorptive_systems","338086635_T_Operator_Bounds_on_Angle-Integrated_Absorption_and_Thermal_Radiation_for_Arbitrary_Objects","336061631_Introduction_to_Applied_Linear_Algebra_Vectors_Matrices_and_Least_Squares","332584837_Computational_Bounds_For_Photonic_Design","316023180_A_general_system_for_heuristic_minimization_of_convex_functions_over_non-convex_sets","309382073_A_review_about_the_engineering_design_of_optimal_heat_transfer_systems_using_topology_optimization","280912188_JuMP_A_Modeling_Language_for_Mathematical_Optimization"]}