{"id":"352501874_Efficient_Skyline_Computation_Over_an_Incomplete_Database_With_Changing_States_and_Structures","abstract":"Skyline query has been studied extensively and a significant number of skyline algorithms have been proposed, mostly attempt to resolve the optimisation problem that is mainly associated with reduction in the processing time of skyline computations. While databases change their states and/or structures throughout their lifetime to reflect the current and latest information of the applications, the skyline set derived before changes are made towards the initial state of a database is no longer valid in the new state/structure of the database. The domination relationships between objects identified in the initial state might no longer hold in the new state. Nonetheless, computing the skylines over the entire new state/structure of the database is inefficient, as not all pairwise comparisons between the objects are necessary to be performed. In tackling the above issue, this paper proposes a solution, named ΔSkyline, which aims at avoiding unnecessary skyline computations when a database changes its state and structure due to a data definition operation(s) (add or remove a dimension(s)). This is achieved by identifying and retaining the prominent dominance relationships when pairwise comparisons are performed; which are then utilised in the process of computing a new skyline set. ΔSkyline consists of two optimisation components, namely: Δ+Skyline which derives a new skyline set when a new dimension(s) is added to a database and Δ-Skyline which derives a new skyline set when an existing dimension(s) is removed from a database. To make our solution more useful, it is applied on a database with incomplete data. Extensive experiments have been conducted to evaluate the performance and prove the efficiency of our proposed solution.","authors":["Ghazaleh Babanejad","Hamidah Ibrahim","Ali Amer Alwan","Fatimah Sidi"],"meta":["June 2021IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2021.3090171"],"references":["343201211_Efficient_Computation_of_Skyline_Queries_Over_a_Dynamic_and_Incomplete_Database","341653972_An_Indexed_Non-probability_Skyline_Query_Processing_Framework_for_Uncertain_Data","337997355_Optimizing_Skyline_Query_Processing_in_Incomplete_Data","330238993_D-SKY_A_Framework_for_Processing_Skyline_Queries_in_a_Dynamic_and_Incomplete_Database","327383992_Ranking_the_big_sky_efficient_top-k_skyline_computation_on_massive_data","339219103_A_framework_for_multidimensional_skyline_queries_over_streaming_data","330239543_Efficient_Skyline_Processing_Algorithm_over_Dynamic_and_Incomplete_Database","328155730_An_efficient_algorithm_for_skyline_queries_in_cloud_computing_environments","326502521_Secure_and_Efficient_Skyline_Queries_on_Encrypted_Data","320883685_Probabilistic_Skyline_on_Incomplete_Data"]}