{"id":"352693279_Optimization_of_Automatic_PCG_Analysis_and_CVD_Diagnostic_System","abstract":"Looking into the severity of morbidity and mortality due to disorder in the functioning of the cardiovascular system, it is indeed highly required to develop an integrated system that can automatically examine the condition of the heart vis-à-vis cardiovascular system by analyzing heart sound signal to make it low cost, less inter-observer variability and fast with higher accuracy to assist the physicians in diagnosis. The heart, the major component in the cardiovascular system, generates different types of sounds with varying duration, pitch, and intensity due to mechanical operations like closing and opening of the heart valves, contraction and expansion of the heart chambers, and flow of blood through the vessels like arteries and veins. The heart sound signals, if captured electronically, can be analyzed using various signal processing tools available leading to its classification towards a decision-making process stating the status of the cardiovascular system. Many researchers have already reported various techniques used at the stages of the analysis process. However, the performances of such analysis have not been optimized to know the combination of suitable techniques that can provide the highest classification accuracy. The present work aims at optimization of the performance of such an integrated analysis system by developing nine different models with a combination of various standard techniques at different stages reported in the literature. The classification accuracy has been measured for each model for a dataset available online. The whole program has been coded in a MATLAB environment. It is observed that Model I provides the optimum performance in terms of classification accuracy measured as 97.17%. In Model I, Segmentation of the signal is done using the energy envelogram technique based on entropy, DWT is employed for the extraction of features, PCA is utilized for the reduction of feature vectors or dimension, and classification is accomplished by SVM with Bayesian optimization.","authors":["Ravindra Manohar Potdar","Dr M R Meshram","Dr Ramesh Kumar"],"meta":["May 2021Turkish Journal of Computer and Mathematics Education (TURCOMAT) 12(11):3738-3751"],"references":["352693213_Optimal_Parameter_Selection_for_DWT_based_PCG_Denoising","336673488_Machine_learning-based_classification_of_cardiac_diseases_from_PCG_recorded_heart_sounds","319233549_Automatic_heart_activity_diagnosis_based_on_Gram_polynomials_and_probabilistic_neural_networks","316230997_Effective_Heart_Sound_Segmentation_and_Murmur_Classification_Using_Empirical_Wavelet_Transform_and_Instantaneous_Phase_for_Electronic_Stethoscope","311694967_Comparison_of_MFCC_and_DWT_features_extractors_applied_to_PCG_classification","277905778_Survey_of_Different_Methodologies_Used_in_Phonocardiogram_Signal_Analysis","275412582_Performance_Analysis_of_Support_Vector_Machine_and_Neural_Networks_in_Detection_of_Myocardial_Infarction","310499915_MFCC_based_noise_reduction_in_ASR_using_Kalman_filtering","297661698_Principal_component_analysis_A_review_and_recent_developments","251318885_Adaptive_neuro-fuzzy_inference_system_for_diagnosis_of_the_heart_valve_diseases_using_wavelet_transform_with_entropy"]}