{"id":"352645131_Neural_network_technique_with_deep_structure_for_improving_author_homonym_and_synonym_classification_in_digital_libraries","abstract":"Author name disambiguation (AND), also recognized as name-identification, has long been seen as a challenging issue in bibliographic data. In other words, the same author may appear under separate names, synonyms, or distinct authors may have similar to those referred to as homonyms. Some previous research has proposed AND problem. To the best of our knowledge, no study discussed specifically synonym and homonym, whereas such cases are the core in AND topic. This paper presents the classification of non-homonym- synonym, homonym-synonym, synonym, and homonym cases by using the DBLP computer science bibliography dataset. Based on the DBLP raw data, the classification process is proposed by using deep neural networks (DNNs). In the classification process, the DBLP raw data divided into five features, including name, author, title, venue, and year. Twelve scenarios are designed with a different structure to validate and select the best model of DNNs. Furthermore, this paper is also compared DNNs with other classifiers, such as support vector machine (SVM) and decision tree. The results show DNNs outperform SVM and decision tree methods in all performance metrics. The DNNs performances with three hidden layers as the best model, achieve accuracy, sensitivity, specificity, precision, and F1-score are 98.85%, 95.95%, 99.26%, 94.80%, and 95.36%, respectively. In the future, DNNs are more performing with the automated feature representation in AND processing.","authors":["Firdaus Masdung","Siti Nurmaini","Varindo Ockta Keneddi Putra","Annisa Darmawahyuni"],"meta":["June 2021TELKOMNIKA (Telecommunication Computing Electronics and Control) 19(4):1208-1217"],"references":["315663175_Data_sets_for_author_name_disambiguation_an_empirical_analysis_and_a_new_resource","262840177_Author_Name_Disambiguation_by_Using_Deep_Neural_Network","326007159_Evaluating_author_name_disambiguation_for_digital_libraries_A_case_of_DBLP","312432980_A_survey_of_deep_neural_network_architectures_and_their_applications","305881344_Evaluating_Co-Authorship_Networks_in_Author_Name_Disambiguation_for_Common_Names","303901957_Using_Co-authorship_Networks_for_Author_Name_Disambiguation","287077798_Are_registered_authors_more_productive","282508169_On_the_combination_of_domain-specific_heuristics_for_author_name_disambiguation_the_nearest_cluster_method","272751895_Distortive_Effects_of_Initial-Based_Name_Disambiguation_on_Measurements_of_Large-Scale_Coauthorship_Networks","262256065_Effective_String_Processing_and_Matching_for_Author_Disambiguation"]}