{"id":"352623916_The_Impact_of_Stationarity_Regularity_and_Context_on_the_Predictability_of_Individual_Human_Mobility","abstract":"Predicting mobility-related behavior is an important yet challenging task. On the one hand, factors such as one’s routine or preferences for a few favorite locations may help in predicting their mobility. On the other hand, several contextual factors, such as variations in individual preferences, weather, traffic, or even a person’s social contacts, can affect mobility patterns and make its modeling significantly more challenging. A fundamental approach to study mobility-related behavior is to assess how predictable such behavior is, deriving theoretical limits on the accuracy that a prediction model can achieve given a specific dataset. This approach focuses on the inherent nature and fundamental patterns of human behavior captured in that dataset, filtering out factors that depend on the specificities of the prediction method adopted. However, the current state-of-the-art method to estimate predictability in human mobility suffers from two major limitations: low interpretability and hardness to incorporate external factors that are known to help mobility prediction (i.e., contextual information). In this article, we revisit this state-of-the-art method, aiming at tackling these limitations. Specifically, we conduct a thorough analysis of how this widely used method works by looking into two different metrics that are easier to understand and, at the same time, capture reasonably well the effects of the original technique. We evaluate these metrics in the context of two different mobility prediction tasks, notably, next cell and next distinct cell prediction, which have different degrees of difficulty. Additionally, we propose alternative strategies to incorporate different types of contextual information into the existing technique. Our evaluation of these strategies offer quantitative measures of the impact of adding context to the predictability estimate, revealing the challenges associated with doing so in practical scenarios.","authors":["Douglas Do Couto Teixeira","Aline Carneiro Viana","Jussara M. Almeida","Mrio S. Alvim"],"meta":["June 2021ACM Transactions on Spatial Algorithms and Systems 7(4):1-24","DOI:10.1145/3459625"],"references":["336473051_Complete_Trajectory_Reconstruction_from_Sparse_Mobile_Phone_Data","319135404_Information_flow_reveals_prediction_limits_in_online_social_activity","280243677_On_the_Limits_of_Predictability_in_Real-World_Radio_Spectrum_State_Dynamics_From_Entropy_Theory_to_5G_Spectrum_Sharing","220682364_Universal_Prediction_of_Individual_Sequences","3079410_Nonparametric_Entropy_Estimation_for_Stationary_Processesand_Random_Fields_with_Applications_to_English_Text","331002788_On_predictability_of_time_series","232583312_On_the_Bias_of_Information_Estimates","232479723_Studies_in_individual_differences_The_search_for_intelligence","220363786_Bayesian_Inference_for_Categorical_Data_Analysis","3082680_On_the_Complexity_of_Finite_Sequences"]}