{"id":"352684624_Correlator_convolutional_neural_networks_as_an_interpretable_architecture_for_image-like_quantum_matter_data","abstract":"Image-like data from quantum systems promises to offer greater insight into the physics of correlated quantum matter. However, the traditional framework of condensed matter physics lacks principled approaches for analyzing such data. Machine learning models are a powerful theoretical tool for analyzing image-like data including many-body snapshots from quantum simulators. Recently, they have successfully distinguished between simulated snapshots that are indistinguishable from one and two point correlation functions. Thus far, the complexity of these models has inhibited new physical insights from such approaches. Here, we develop a set of nonlinearities for use in a neural network architecture that discovers features in the data which are directly interpretable in terms of physical observables. Applied to simulated snapshots produced by two candidate theories approximating the doped Fermi-Hubbard model, we uncover that the key distinguishing features are fourth-order spin-charge correlators. Our approach lends itself well to the construction of simple, versatile, end-to-end interpretable architectures, thus paving the way for new physical insights from machine learning studies of experimental and numerical data. Physical principles underlying machine learning analysis of quantum gas microscopy data are not well understood. Here the authors develop a neural network based approach to classify image data in terms of multi-site correlation functions and reveal the role of fourth-order correlations in the Fermi-Hubbard model.","authors":["Cole Miles","Annabelle Bohrdt","Ruihan Wu","Christie Chiu"],"meta":["June 2021Nature Communications 12(1):3905","DOI:10.1038/s41467-021-23952-w"],"references":["342645887_Robust_Bilayer_Charge_Pumping_for_Spin-_and_Density-Resolved_Quantum_Gas_Microscopy","341530171_Towards_novel_insights_in_lattice_field_theory_with_explainable_machine_learning","339773442_One-component_order_parameter_in_URu_2_Si_2_uncovered_by_resonant_ultrasound_spectroscopy_and_machine_learning","335174482_Imaging_magnetic_polarons_in_the_doped_Fermi-Hubbard_model","354997576_Microscopic_evolution_of_doped_Mott_insulators_from_polaronic_metal_to_Fermi_liquid","348612131_Quantum_many-body_simulations_of_the_two-dimensional_Fermi-Hubbard_model_in_ultracold_optical_lattices","345016005_Visualizing_strange_metallic_correlations_in_the_two-dimensional_Fermi-Hubbard_model_with_artificial_intelligence","344395044_Doublon-Hole_Correlations_and_Fluctuation_Thermometry_in_a_Fermi-Hubbard_Gas","342727067_Single-Exposure_Absorption_Imaging_of_Ultracold_Atoms_Using_Deep_Learning","342546393_Conquering_the_CNN_Over-Parameterization_Dilemma_A_Volterra_Filtering_Approach_for_Action_Recognition"]}