{"id":"352711392_On_the_Definition_of_Quantum_Programming_Modules","abstract":"There are no doubts that quantum programming and, in general, quantum computing, is one of the most promising areas within computer science and one of the areas where most expectations are being placed in recent years. Although the days when reliable and affordable quantum computers will be available is still a long way off, the explosion of programming languages for quantum programming has grown exponentially in recent years. The software engineering community has been quick to react to the need to adopt and adapt well-known tools and methods for software development, and for the design of new ones tailored to this new programming paradigm. However, many key aspects for its success depend on the establishment of an appropriate conceptual framework for the conception and design of quantum programs. This article discusses the concept of module, key in the software engineering discipline, and establishes initial criteria for determining the cohesion and coupling levels of a module in the field of quantum programming as a first step towards a sound quantum software engineering. As detailed in the article, the conceptual differences between classical and quantum computing are so pronounced that the translation of classical concepts to the new programming approach is not straightforward.","authors":["Pedro Sánchez","Diego Alonso"],"meta":["June 2021Applied Sciences 11(13):5843","DOI:10.3390/app11135843"],"references":["340233663_The_Talavera_Manifesto_for_Quantum_Software_Engineering_and_Programming","339780973_The_Talavera_Manifesto_for_Quantum_Software_Engineering_and_Programming","353203409_Modelling_Quantum_Circuits_with_UML","350547529_Toward_a_Quantum_Software_Engineering","347455308_Towards_a_Quantum_Software_Modeling_Language","346997092_Quantum_programming_languages","346875805_Property-based_Testing_of_Quantum_Programs_in_Q","342826466_Quantum_Computing_A_New_Software_Engineering_Golden_Age","342189984_Quantum_Computer_Architecture_Towards_Full-Stack_Quantum_Accelerators","331184722_Towards_a_Pattern_Language_for_Quantum_Algorithms_First_International_Workshop_QTOP_2019_Munich_Germany_March_18_2019_Proceedings","320993585_Quantum_plug_n'_play_Modular_computation_in_the_quantum_regime","277560557_Advances_in_Quantum_Teleportation","257201722_Quantum_circuits_cannot_control_unknown_operations","318652477_Twelve_years_before_the_quantum_no-cloning_theorem","306186585_A_Practical_Quantum_Instruction_Set_Architecture"]}