{"id":"352731286_Towards_Position-Independent_Sensing_for_Gesture_Recognition_with_Wi-Fi","abstract":"Past decades have witnessed the extension of the Wi-Fi signals as a useful tool sensing human activities. One common assumption behind it is that there is a one-to-one mapping between human activities and Wi-Fi received signal patterns. However, this assumption does not hold when the user conducts activities in different locations and orientations. Actually, the received signal patterns of the same activity would become inconsistent when the relative location and orientation of the user with respect to transceivers change, leading to unstable sensing performance. This problem is known as the position-dependent problem, hindering the actual deployment of Wi-Fi-based sensing applications. In this paper, to tackle this fundamental problem, we develop a new position-independent sensing strategy and use gesture recognition as an application example to demonstrate its effectiveness. The key idea is to shift our observation from the traditional transceiver view to the hand-oriented view, and extract features that are irrespective of position-specific factors. Following the strategy, we design a position-independent feature, denoted as Motion Navigation Primitive(MNP). MNP captures the pattern of moving direction changes of the hand, which shares consistent patterns when the user performs the same gesture with different position-specific factors. By analyzing the pattern of MNP, we convert gestures into sequences of strokes (e.g, line, arc and corner) which makes them easy to be recognized. We build a prototype WiFi gesture recognition system, i.e., WiGesture to validate the effectiveness of the proposed strategy. Experiments show that our system can outperform the start-of-arts significantly in different settings. Given its novelty and superiority, we believe the proposed method symbolizes a major step towards gesture recognition and would inspire other solutions to position-independent activity recognition in the future.","authors":["Ruiyang Gao","Mi Zhang","Jie Zhang","Yang Li"],"meta":["June 2021Proceedings of the ACM on Interactive Mobile Wearable and Ubiquitous Technologies 5(2):1-28","DOI:10.1145/3463504"],"references":["338546784_FingerDraw_Sub-wavelength_Level_Finger_Motion_Tracking_with_WiFi_Signals","335736659_FarSense_Pushing_the_Range_Limit_of_WiFi-based_Respiration_Sensing_with_CSI_Ratio_of_Two_Antennas","335156760_WiMorse_A_Contactless_Morse_Code_Text_Input_System_using_Ambient_WiFi_Signals","334361077_FarSense_Pushing_the_Range_Limit_of_WiFi-based_Respiration_Sensing_with_CSI_Ratio_of_Two_Antennas","329256952_Boosting_fine-grained_activity_sensing_by_embracing_wireless_multipath_effects","328549400_E-Eye_Hidden_Electronics_Recognition_through_mmWave_Nonlinear_Effects","349739522_Understanding_WiFi_Signal_Frequency_Features_for_Position-Independent_Gesture_Sensing","338161840_WiTrace_Centimeter-Level_Passive_Gesture_Tracking_Using_OFDM_signals","333834065_Zero-Effort_Cross-Domain_Gesture_Recognition_with_Wi-Fi","328375756_Multi_-_Touch_in_the_Air_Device-Free_Finger_Tracking_and_Gesture_Recognition_via_COTS_RFID","328049475_Through-Wall_Human_Pose_Estimation_Using_Radio_Signals","327758396_FullBreathe_Full_Human_Respiration_Detection_Exploiting_Complementarity_of_CSI_Phase_and_Amplitude_of_WiFi_Signals","326238521_Multi-User_Gesture_Recognition_Using_WiFi","327760729_Augmenting_User_Identification_with_WiFi_Based_Gesture_Recognition","326905845_RF-based_3D_skeletons"]}