{"id":"352721775_Analysing_Twitter_semantic_networks_the_case_of_2018_Italian_elections","abstract":"Social media play a key role in shaping citizens’ political opinion. According to the Eurobarometer, the percentage of EU citizens employing online social networks on a daily basis has increased from 18% in 2010 to 48% in 2019. The entwinement between social media and the unfolding of political dynamics has motivated the interest of researchers for the analysis of users online behavior—with particular emphasis on group polarization during debates and echo-chambers formation. In this context, semantic aspects have remained largely under-explored. In this paper, we aim at filling this gap by adopting a two-steps approach. First, we identify the discursive communities animating the political debate in the run up of the 2018 Italian Elections as groups of users with a significantly-similar retweeting behavior. Second, we study the mechanisms that shape their internal discussions by monitoring, on a daily basis, the structural evolution of the semantic networks they induce. Above and beyond specifying the semantic peculiarities of the Italian electoral competition, our approach innovates studies of online political discussions in two main ways. On the one hand, it grounds semantic analysis within users’ behaviors by implementing a method, rooted in statistical theory, that guarantees that our inference of socio-semantic structures is not biased by any unsupported assumption about missing information; on the other, it is completely automated as it does not rest upon any manual labelling (either based on the users’ features or on their sharing patterns). These elements make our method applicable to any Twitter discussion regardless of the language or the topic addressed.","authors":["Tommaso Radicioni","Fabio Saracco","Elena Pavan","Tiziano Squartini"],"meta":["June 2021Scientific Reports 11(1):13207","DOI:10.1038/s41598-021-92337-2"],"references":["354170503_Networked_partisanship_and_framing_A_socio-semantic_network_analysis_of_the_Italian_debate_on_migration","341292592_The_role_of_bot_squads_in_the_political_propaganda_on_Twitter","341149078_Interplay_between_k-core_and_community_structure_in_complex_networks","335171985_News_Media_Coverage_of_Climate_Change_in_India_1997-2016_Using_Automated_Content_Analysis_to_Assess_Themes_and_Topics","335153717_Extracting_significant_signal_of_news_consumption_from_social_networks_the_case_of_Twitter_in_Italian_political_elections","345531087_Compulsory_Voting_Encouraged_Tweeting","337078773_k_-core_Theories_and_applications","332591933_Detecting_core-periphery_structures_by_surprise","331930605_Mapping_Social_Dynamics_on_Facebook_The_Brexit_Debate","330056483_On_the_capability_of_evolved_spambots_to_evade_detection_via_genetic_engineering"]}