{"id":"352738367_EFFECT_OF_CISCO-PACKET-TRACER_SIMULATOR_ON_SENIOR_SCHOOL_STUDENTS'_COMPREHENSION_AND_SKILL_ACQUISITION_IN_COMPUTER_NETWORK_TOPOLOGY_IN_NIGERIA","abstract":"Excellent performance in network topology cannot be achieved without adequate comprehension of the concept and experimenting with a real-life or simulated environment. Cisco packet tracer simulator as a tool for teaching and learning computer science concepts, provides simulation, visualization, authoring, collaboration capabilities, and assessment experiences for both teachers and students. Thus, this study determined the effect of using CISCO-packet-tracer on senior school students’ skill acquisition and comprehension of network topology designing, configuration, and troubleshooting skills when taught using CISCO-packet-tracer simulator. A quasi-experimental research design was adopted with a purposively sampled intact class of 26 computer studies students’ in a senior secondary school in Ilorin. Three research questions were answered with the use of validated research instruments (an adopted software (CISCO-packet-tracer simulator; a network topology skill acquisition observation checklist; and an adopted standardized network topology comprehension test (NTCT). It was found that there is a significantly positive effect of CISCO-packet-tracer simulator on students’ skill acquisition (95.2%) and comprehension (61.5%) of network topology, (95.2%) of the students acquired a substantial level of skills (software initiation skill - 98.5%; configuration skill - 93.1%; redirection skill - 92.3%; simulation skill - 98.7%; and connection skill 94.2- %) and students’ comprehension of network topology concept was averagely high (61.5%). The study concluded that the CISCO-packet-tracer simulator is an effective tool for fostering students’ skills acquisition and comprehension of computer science concepts, while also recommending that educators should use the Cisco packet tracer to allow students gain practical and cognitive skills in computer science concepts.","authors":["Adedokun-Shittu Nafisat Afolake","A H Ajani","Abdulkareem, O.I","Rafiat Oyekunle"],"meta":["June 2021"],"references":["292147903_Promoting_Intrinsic_and_Extrinsic_Motivation_among_Chemistry_Students_using_Computer-Assisted_Instruction","259497466_ICT_Impact_Assessment_Model_An_Extension_of_the_CIPP_and_Kirkpatrick_Models","249313265_Simulation_for_Computer_Sciences_Education","322168739_Effectiveness_of_Using_Cisco_Packet_Tracer_as_a_Learning_Tool_A_Case_Study_of_Routing_Protocol","307853553_Innovative_methodology_and_implementation_of_simulation_exercises_to_the_Computer_networks_courses"]}