{"id":"352892703_Industrial_Perspectives_of_3D_scanning_Features_Roles_and_it's_Analytical_Applications","abstract":"3D scanning is one of the lesser talked about technologies used for designing, inspection, and quality control. This non-contact measuring technology converts a physical model into digital 3D Computer-Aided Design (CAD) with the help of various scanning software’s. It is becoming an essential tool for producers who need an accurate dimensional inspection, virtual image, analysis, and even physical prototype manufacturing. This paper aims to discuss the potential of 3D scanning for the Industrial Sphere. It will take up 3D Scanners for practical industrial support and develop the Work-Flow Process of 3D Scanners for Industrial requirements. Further, the paper identifies and discusses sixteen major applications of 3D scanning from an Industrial perspective. 3D scanners use sensors to sense the data of any product. This technology can easily capture the virtual image of a physical part, and the same can be analysed, modified, printed, and stored. It allows for careful preparation of production systems involving machinery placement, facilities, repair and human ergonomic interplay. It is a vital performance measure to ensure the initial vision has been realised as intended. The automobile sector ensures that the produced product fits as per the manufacturer's requirement and for quality control. 3D scanning is helpful for reverse engineering, analysis, designing and measuring complex curved surfaces, education, architecture, survey, healthcare, quality monitoring, prototyping, development of industrial tools and many more. This technology uses advanced software for accurate measurement, storage, analysis, which helps increase the process's flexibility and reliability.","authors":["Mohd Javaid","Abid Haleem","Ravi Pratap Singh","Rajiv Suman"],"meta":["June 2021Sensors International 2(1):100114","DOI:10.1016/j.sintl.2021.100114"],"references":["352484722_Significance_of_Sensors_for_Industry_40_Roles_Capabilities_and_Applications","351553174_Biosensors_applications_in_medical_field_A_brief_review","350828169_Haptic_Manipulation_of_3D_Scans_for_Geometric_Feature_Enhancement","350729997_Comparison_of_iPad_ProR's_LiDAR_and_TrueDepth_Capabilities_with_an_Industrial_3D_Scanning_Solution","348768541_A_Portable_Electromagnetic_System_Based_on_mm-Wave_Radars_and_GNSS-RTK_Solutions_for_3D_Scanning_of_Large_Material_Piles","356457717_Mannequin_fabrication_methodology_using_3D-scanning_modeling_and_printing","348468289_Survey_on_3D_Technologies_Case_Study_on_3D_Scanning_Processing_and_Printing_with_a_Model","348065767_Optimizing_3D_Irregular_Object_Packing_from_3D_Scans_Using_Metaheuristics","347543300_A_Compact_and_Infrastructure-free_Confined_Space_Sensor_for_3D_Scanning_and_SLAM","347284202_Analysis_of_the_external_acoustic_meatus_for_ergonomic_design_Part_I_-_Measurement_of_the_external_acoustic_meatus_using_casting_scanning_and_rapid_estimation_approaches"]}