{"id":"352807325_Characteristics_of_student_engagement_in_high-school_robotics_courses","abstract":"Student engagement has been described as active involvement in a learning activity that significantly affects learning achievement. This study investigated student engagement in robotics education, considering it as an instant emotional reaction on interaction with the teacher, the peers, and the robotic environment. The objective was to characterize engagement in high school robotics courses through the lenses of preparation for academic and technical careers. Students who participated in this study (N = 41), all of whom were in the eleventh grade, belonged to either School A (n1 = 20) or School B (n2 = 21). School A students studied only one subject at an advanced level—mechatronics, while each student in School B studied engineering systems as well as one of the following three subjects at an advanced level: computer science, a natural science subject, or mathematics. Data were collected via structured classroom observations, interviews, and a questionnaire. From the analysis of the collected data, we identified 23 engagement structures in total, 12 of which were already known in the literature, and 11 of which were novel. The two groups of students shared nine known structures, and no novel structures. Unlike previous studies of engagement structures, this study was based on an entire year of observations. Additionally, it is one of the first studies of high school student engagement in robotics education. Our findings and conclusions contribute to understanding of student engagement in robotic education, allowing robotics teachers to tailor their instruction more effectively.","authors":["Igor M. Verner","Huberth Perez","Rea Lavi"],"meta":["June 2021International Journal of Technology and Design Education","DOI:10.1007/s10798-021-09688-0"],"references":["346482550_How_Does_Prior_Knowledge_Influence_Learning_Engagement_The_Mediating_Roles_of_Cognitive_Load_and_Help-Seeking","340658570_Assessing_evaluation_Why_student_engages_or_resists_to_active_learning","334324787_A_Systematic_Review_of_Studies_on_Educational_Robotics","333596678_Teachers'_Classroom_Engagement_Structures_A_Comparative_Study_of_a_Novice_US_and_an_Experienced_UK_Mathematics_Teacher","330808763_The_Role_of_Prior_Achievement_as_an_Antecedent_to_Student_Homework_Engagement","357492723_Social_Robots_for_Pedagogical_Rehabilitation_Trends_and_Novel_Modeling_Principles","342784190_Pandemic_designs_for_the_future_perspectives_of_technology_education_teachers_during_COVID-19","339979607_Engagement_in_Learning_Through_Design_and_Experimentation_with_Robots","336149901_Engagement_in_learning_through_design_and_experimentation_with_robots","331579193_Social_Robots_for_Pedagogical_Rehabilitation","324183400_Relationships_between_student_engagement_and_academic_achievement_A_meta-analysis","322342119_Student_Engagement_Literature_Review","311999399_Robotics_in_School_Chemistry_Laboratories","321755504_Discrete_Mathematics_and_the_Affective_Dimension_of_Mathematical_Learning_and_Engagement","316817813_Robotics_applications_grounded_in_learning_theories_on_tertiary_education_A_systematic_review"]}