{"id":"352902154_A_New_Multiobjective_Time-Cost_Trade-Off_for_Scheduling_Maintenance_Problem_in_a_Series-Parallel_System","abstract":"In this paper, a modified model of Nondominated Sorting Genetic Algorithm 2 (NSGA-II), which is one of the Multiobjective Evolutionary Algorithms, is proposed. This algorithm is a new model designed to make a trade-off between minimizing the cost of preventive maintenance (PM) and minimizing the time taken to perform this maintenance for a series-parallel system. In this model, the limitations of labor and equipment of the maintenance team and the effects of maintenance issues on manufacturing problems are also considered. In the mathematical model, finding the appropriate objective functions for the maintenance scheduling problem requires all maintenance costs and failure rates to be integrated. Additionally, the effects of production interruption during preventive maintenance are added to objective functions. Furthermore, to make a better performance compared with a regular NSGA-II algorithm, we proposed a modified algorithm with a repository to keep more unacceptable solutions. These solutions can be modified and changed with the proposed mutation algorithm to acceptable solutions. In this algorithm, modified operators, such as simulated binary crossover and polynomial mutation, will improve the algorithm to generate convergence and uniformly distributed solutions with more diverse solutions. Finally, by comparing the experimental solutions with the solutions of two Strength Pareto Evolutionary Algorithm 2 (SPEA2) and regular NSGA-II, MNSGA-II generates more efficient and uniform solutions than the other two algorithms.","authors":["Leyla Sadat Tavassoli","Reza Massah","Arsalan Montazeri","Mirpouya Mirmozaffari"],"meta":["July 2021Mathematical Problems in Engineering 2021(1)","DOI:10.1155/2021/5583125"],"references":["351374809_A_Modified_Adaptive_Genetic_Algorithm_for_Multi-product_Multi-period_Inventory_Routing_Problem","351027126_A_Green_Multi-period_Inventory_Routing_Problem_with_Pickup_and_Split_Delivery_A_Case_Study_in_Flour_Industry","350857570_Predictive_Multi-Microgrid_Generation_Maintenance_Formulation_and_Impact_on_Operations_Resilience","350218064_VCS_and_CVS_New_Combined_Parametric_and_Non-parametric_Operation_Research_Models","348177588_SGOA_annealing-behaved_grasshopper_optimizer_for_global_tasks","348160936_An_improved_lasso_regression_model_for_evaluating_the_efficiency_of_intervention_actions_in_a_system_reliability_analysis","348111244_Double_adaptive_weights_for_stabilization_of_moth_flame_optimizer_Balance_analysis_engineering_cases_and_medical_diagnosis_Knowledge-Based_Systems_Impact_Factor_8038","353541400_Green_Supply_Chain_Network_Design_with_Emphasis_on_Inventory_Decisions","348419766_Acquiring_and_sharing_tacit_knowledge_in_failure_diagnosis_analysis_using_intuitionistic_and_pythagorean_assessments","347913053_Robust_Feature_Learning_for_Adversarial_Defense_via_Hierarchical_Feature_Alignment"]}