{"id":"352955118_Throw_Them_All_in_One_Pot_Differences_in_Stereotypes_About_Subgroups_of_Pre-Service_Teachers","abstract":"According to the stereotype content model, stereotypes can be described by using the dimensions competence and warmth. Compared to other professions, teaching is associated with a paternalistic stereotype consisting of high warmth and low competence. In four studies, stereotypes about different subgroups of pre-service teachers were compared. The aim was to understand sub-stereotypes better that could lead to different levels of stereotype threat and adverse behavioral tendencies. In Study 1 (N = 335), we compared stereotypes about elementary school pre-service teachers, grammar school pre-service teachers, computer science students, law students, and psychology students reported by pre-service teachers and psychology students. In contrast to nonteaching students, both groups of pre-service teachers corresponded to the paternalistic stereotype. In Study 2 (N = 243), pre-service teachers reported stereotypes about pre-service teachers for elementary schools, special education schools, comprehensive schools, vocational schools, and grammar schools. Elementary school pre-service teachers were stereotyped most paternalistically, while grammar school pre-service teachers matched the paternalistic stereotype the least. The ratings of other school types mostly fell between these extremes. In Studies 3a (N = 133, open-ended questions) and 3b (N = 308, closed-ended questions), students of various study programs compared pre-service teachers majoring in German and history (representing a non-STEM major combination) to pre-service teachers with the majors mathematics and physics (representing a STEM major combination). Pre-service teachers studying German and history were rated warmer but less competent than pre-service teachers with the majors mathematics and physics, confirmed by both methods of measuring stereotypes. In Studies 1, 3a, and 3b, ingroup favoritism in the ratings by pre-service teacher participants was tested and only found for competence in Study 1. The importance of our results and their implications for stereotype threat effects and possible interventions are discussed.","authors":["Martin O. Stuckert","Toni A. Ihme","Anna Südkamp","Jens Möller"],"meta":["July 2021Frontiers in Education 6:679410","DOI:10.3389/feduc.2021.679410"],"references":["347559202_The_Dimensional_Compensation_Model","340388743_Do_teacher_stereotypes_about_school_tracks_function_as_expectations_on_the_collective_dimension_and_relate_to_perception_of_obstacles_in_the_classroom_and_teachers'_self-efficacy_beliefs","325670955_A_model_of_often_mixed_stereotype_content_Competence_and_warmth_respectively_follow_from_perceived_status_and_competition","323464058_Stereotype_Content_Warmth_and_Competence_Endure","323424582_Statistical_power_analysis_for_the_behavioral_sciences","276939158_Implicit_Stereotype_Content","273499457_Intergroup_Biases_A_Focus_on_Stereotype_Content","270940287_He_Who_Can_Does_He_Who_Cannot_Teaches_Stereotype_Threat_and_Preservice_Teachers","270585193_Visible_Learning_A_Synthesis_of_Over_800_Meta-Analyses_Relating_to_Achievement","269723971_Who_becomes_a_teacher_Challenging_the_negative_selection_hypothesis","264085315_Communal_and_Agentic_Content_in_Social_Cognition_A_Dual_Perspective_Model","263041125_Warm_but_Maybe_Not_So_Competent_-Contemporary_Implicit_Stereotypes_of_Women_and_Men_in_Germany","266326864_Individuelle_Voraussetzungen_von_Studierenden_zu_Studienbeginn_Sind_Lehramtsstudierende_so_schlecht_wie_ihr_Ruf","263558824_Grundschule_oder_Gymnasium_Zur_Motivation_ein_Lehramt_zu_studieren","259703298_GPower_3_A_flexible_statistical_power_analysis_program_for_the_social_behavior_and_biomedical_sciences"]}