{"id":"352991312_On_Initials_and_the_Fundamental_Theorem_of_Tropical_Partial_Differential_Geometry","abstract":"Tropical Differential Algebraic Geometry considers difficult or even intractable problems in Differential Equations and tries to extract information on their solutions from a restricted structure of the input. \nThe fundamental theorem of Tropical Differential Algebraic Geometry and its extensions state that the support of power series solutions of systems of ordinary differential equations (with formal power series coefficients over an uncountable algebraically closed field of characteristic zero) can be obtained either, by solving a so-called tropicalized differential system, or by testing monomial-freeness of the associated initial ideals. Tropicalized differential equations work on a completely different algebraic structure which may help in theoretical and computational questions, particularly on the existence of solutions. \n\nWe show here that both of these methods can be generalized to the case of systems of partial differential equations, this is, one can go either with the solution of tropicalized systems, or test monomial-freeness of the ideal generated by the initials when looking for supports of power series solutions of systems of differential equations, regardless the (finite) number of derivatives. The key are the vertex sets of Newton polytopes, upon which relies the definition of both tropical vanishing condition and the initial of a differential polynomial.","authors":["Sebastian Falkensteiner","Cristhian Garay","Mercedes Haiech","Marc Paul Noordman"],"meta":["January 2021"],"references":["253953906_Equations_of_tropical_varieties","343246789_The_fundamental_theorem_of_tropical_partial_differential_algebraic_geometry","243765157_Grobner_Bases_and_Convex_Polytopes","227144285_Ultraproducts_and_approximation_in_local_rings_I","226099633_Power_series_solutions_of_algebraic_differential_equations","220693306_Ideals_varieties_and_algorithms_An_introduction_to_computational_algebraic_geometry_and_commutative_algebra_2nd_ed"]}