{"id":"352955544_Convergence_of_proximal_solutions_for_evolution_inclusions_with_time-dependent_maximal_monotone_operators","abstract":"This article studies the solutions of time-dependent differential inclusions which is motivated by their utility in optimization algorithms and the modeling of physical systems. The differential inclusion is described by a time-dependent set-valued mapping having the property that, for a given time instant, the set-valued mapping describes a maximal monotone operator. By successive application of a proximal operator, we construct a sequence of functions parameterized by the sampling time that corresponds to the discretization of the continuous-time system. Under certain mild assumptions on the regularity with respect to the time argument, and using appropriate tools from functional and variational analysis, this sequence is then shown to converge to the unique solution of the original differential inclusion. The result is applied to develop conditions for well-posedness of differential equations interconnected with nonsmooth time-dependent complementarity relations, using passivity of underlying dynamics (equivalently expressed in terms of linear matrix inequalities).","authors":["Kanat Camlibel","Luigi Iannelli","Aneel Tanwani"],"meta":["July 2021Mathematical Programming","DOI:10.1007/s10107-021-01666-7"],"references":["328661466_State-Dependent_Implicit_Sweeping_Process_in_the_Framework_of_Quasistatic_Evolution_Quasi-Variational_Inequalities","323401068_A_Variational_Approach_toNonsmooth_Dynamics_Applications_in_Unilateral_Mechanics_and_Electronics","316989240_Convergence_of_inertial_dynamics_and_proximal_algorithms_governed_by_maximally_monotone_operators","346368826_Convex_Analysis","328469097_A_differential_equation_approach_to_implicit_sweeping_processes","323026790_Monotone_Operator_Theory_in_Convex_Optimization","321744203_Evolution_problem_associated_with_a_moving_convex_set_in_a_Hilbert_space","321595821_From_Hahn-Banach_to_Monotonicity","316323138_Nonlinear_Functional_Analysis_and_its_Applications","315573860_Convex_Analysis_and_Monotone_Operator_Theory_in_Hilbert_Spaces"]}