{"id":"352927748_INFORMAL_EDUCATION_AS_AN_EFFECTIVE_FORM_OF_DEVELOPMENT_OF_PROFESSIONAL_COMPETENCE_OF_MODERN_COMPUTER_SCIENCE_TEACHER","abstract":"In modern conditions formal education is unable to meet the various educational needs of teachers, especially when it comes to ICTs and computer science (CS), so informal adult education is becoming an increasingly urgent personal need of modern educators. Taking into consideration the challenges of today and the demands to the teachers, the state has provided for the possibility of continuous teacher training in the new Law on Education. Despite the fact that the issue of professional development of educators was given considerable attention in the researches of community, the problem of professional competence of modern CS teachers in the field of informal education remained insufficiently covered and was not the subject of a dedicated special research. The aim of the article is to outline the optimal ways to develop the professional competence of computer science teachers in the system of informal education. Theoretical research methods were used during research, namely: study and analysis of psychological-pedagogical, normative and special literature on the above-mentioned issue(s); analysis of state educational standards, programs, textbooks and teaching materials. Some its aspects are defined and the ways of organizing the process of development of professional competence of teachers in the conditions of informal education are described. It is determined that further research is aimed at processing and testing the research-based materials in real conditions. The analysis of the legal framework in the field of education showed that the state is currently taking a number of measures to ensure the continuous development of professional competence of modern CS teachers as well as the development of professional competence of modern educators in general, which should include such areas that will allow teachers to exploit new approaches and educational technology that can improve and amplify the learning process of students.","authors":["O. Tokarska"],"meta":["June 2021Zhytomyr Ivan Franko State University Journal Рedagogical Sciences","DOI:10.35433/pedagogy.1(104).2021.40-49"],"references":[]}