{"id":"352933554_The_Rhetorical_Structure_of_Preface_Sections_in_Textbooks_Variations_across_Disciplines","abstract":"The present study investigated disciplinary similarities and differences in the rhetorical structure of 120 preface sections drawn from three soft disciplines, namely applied linguistics, business administration, and law, as well as from hard disciplines, namely computer sciences, chemistry, and biology. While the overall results showed a five-move structure, some disciplines emphasized the use of particular moves. The Announcing objectives and Outlining organization moves were obligatory in all disciplines, while the Establishing the needs of the readership move was more predominant in business administration, law, and biology prefaces. The Identifying audience move was more common in computer science prefaces, and finally the Acknowledging contributions move was more frequent in computer sciences and law prefaces. The study also investigated other features used in the prefaces and the frequency with which they occurred in different fields. The study concluded with a recommendation to conduct similar genre-based studies to help clarify the disciplinary variations in the preface sections.","authors":["Hmoud S. Alotaibi"],"meta":["July 2021","DOI:10.33806/ijaes2000.21.2.9"],"references":["344458547_Taking_Authorial_Stance_in_Arabic_Research_Articles_Introductions","325145738_Preface_Sections_in_English_and_Arabic_Linguistics_Books_A_Rhetorico-Cultural_Analysis","299486829_Metadiscourse_in_book_prefaces_of_Filipino_and_English_authors_A_contrastive_rhetoric_study","280574182_The_Self-Promotion_of_Academic_Textbooks_in_the_Preface_Section_A_Genre_Analysis","271105045_Rhetorical_Move_Structure_of_Literature_Book_Prefaces_in_English_and_Persian","235342149_Research_Genres_Explorations_and_Applications","287253227_Book_prefaces_in_basic_applied_and_social_sciences_A_genre-based_study","250146854_An_Interactive_Genre_Within_the_University_Textbook_The_Preface","238750475_Analysing_genre_Language_use_in_professional_settings","235342143_Genre_analysis_English_in_academic_and_research_Settings"]}