{"id":"353076793_Fuzzy_rank-based_fusion_of_CNN_models_using_Gompertz_function_for_screening_COVID-19_CT-scans","abstract":"COVID-19 has crippled the world’s healthcare systems, setting back the economy and taking the lives of several people. Although potential vaccines are being tested and supplied around the world, it will take a long time to reach every human being, more so with new variants of the virus emerging, enforcing a lockdown-like situation on parts of the world. Thus, there is a dire need for early and accurate detection of COVID-19 to prevent the spread of the disease, even more. The current gold-standard RT-PCR test is only 71% sensitive and is a laborious test to perform, leading to the incapability of conducting the population-wide screening. To this end, in this paper, we propose an automated COVID-19 detection system that uses CT-scan images of the lungs for classifying the same into COVID and Non-COVID cases. The proposed method applies an ensemble strategy that generates fuzzy ranks of the base classification models using the Gompertz function and fuses the decision scores of the base models adaptively to make the final predictions on the test cases. Three transfer learning-based convolutional neural network models are used, namely VGG-11, Wide ResNet-50-2, and Inception v3, to generate the decision scores to be fused by the proposed ensemble model. The framework has been evaluated on two publicly available chest CT scan datasets achieving state-of-the-art performance, justifying the reliability of the model. The relevant source codes related to the present work is available in: GitHub.","authors":["Rohit Kundu","Hritam Basak","Pawan Kumar Singh","Ali Ahmadian"],"meta":["July 2021Scientific Reports 11(1):14133","DOI:10.1038/s41598-021-93658-y"],"references":["351673967_Generation_of_Synthetic_Chest_X-ray_Images_and_Detection_of_COVID-19_A_Deep_Learning_Based_Approach","351076053_Systematic_investigation_into_generalization_of_COVID-19_CT_deep_learning_models_with_Gabor_ensemble_for_lung_involvement_scoring_PREPRINT","350969123_A_bi-stage_feature_selection_approach_for_COVID-19_prediction_using_chest_CT_images","350921862_Detection_of_COVID-19_from_CT_scan_images_A_spiking_neural_network-based_approach","349822125_Metaheuristic-based_Deep_COVID-19_Screening_Model_from_Chest_X-Ray_Images","349174929_Single_Image_Super-Resolution_using_Residual_Channel_Attention_Network","349153449_Comparative_Study_of_Maturation_Profiles_of_Neural_Cells_in_Different_Species_with_the_Help_of_Computer_Vision_and_Deep_Learning","351241801_Bi-Level_Prediction_Model_for_Screening_COVID-19_Patients_Using_Chest_X-Ray_Images","350392243_COVID-19_Detection_from_Lung_CT-Scan_Images_using_Transfer_Learning_Approach","350391170_F-UNet_A_Modified_U-Net_Architecture_for_Segmentation_of_Stroke_Lesion"]}