{"id":"353092058_Random_Valued_Impulse_Noise_Detection_Using_Fuzzy_c-Means_Clustering_Technique","abstract":"Noise detection is critical facet in eliminating impulse noise from digital images. Faulty detection can have deeper consequences in the ultimate outcome of the image filtering procedure. Established detection methods while distinguishing corrupted and non-corrupted pixels, have a tendency to upsurge errors while judging the edge points. In this paper, a detection technique, based on fuzzy c-means clustering algorithm is proposed to deal with above-mentioned issues. Fuzzy c-means clustering is used here to group similar non-corrupted pixels intensities by partitioning them into separate fuzzy clusters. Here, a pixel intensity value belongs to each cluster with certain membership strength. Depending on the maximum membership strength of a pixel element in a certain cluster among all the clusters, the most suitable belongingness of that pixel to that cluster is determined. After this operation, maximum element holding cluster is selected to be the cluster having the detected non-corrupted pixel elements, since there is a plausible tendency of similar non-corrupted pixel elements to group together. Standard measures like “miss” and “false-hit” have been used to compare the proposed method against the prevailing state-of-art methods to determine the noise detection accuracy of the proposed method. Being evaluated upon the aforesaid standard measures, the proposed detector is found superior to all the others in terms of its detection performance.","authors":["Aritra Bandyopadhyay","Kaustuv Deb","Atanu Das","Rajib Bag"],"meta":["July 2021","DOI:10.1007/978-981-16-0878-0_39","In book: Smart Computing Techniques and Applications, Proceedings of the Fourth International Conference on Smart Computing and Informatics, Volume 1 (pp.397-405)"],"references":["321885590_Random_Valued_Impulse_Noise_Removal_Using_Region_Based_Detection_Approach","293479917_Sparse_regularization_method_for_the_detection_and_removal_of_random-valued_impulse_noise","7489454_A_universal_noise_removal_algorithm_with_an_impulse_detector","3342616_Wu_HR_Adaptive_Impulse_Detection_Using_Center-Weighted_Median_Filters_IEEE_Signal_Processing_Letters_8_1-3","3326491_A_new_efficient_approach_for_the_removal_of_impulse_noise_from_highly_corrupted_images","3325759_Space_variant_median_filters_for_the_restoration_of_impulse_noise_corrupted_images","299536488_Sequentially_combined_mean-median_filter_for_high_density_salt_and_pepper_noise_removal","271555333_Detection_and_removal_of_random-valued_impulse_noise_from_images_using_sparse_representations","31011988_A_New_Efficient_Impulse_Detection_Algorithm_for_the_Removal_of_Impulse_Noise","3343613_A_New_Directional_Weighted_Median_Filter_for_Removal_of_Random-Valued_Impulse_Noise","3343150_An_Iterative_Procedure_for_Removing_Random-Valued_Impulse_Noise","3343070_Advanced_Impulse_Detection_Based_on_Pixel-Wise_MAD","3328492_A_New_Detection_Statistic_for_Random-Valued_Impulse_Noise_Removal","3327084_Tri-state_median_filter_for_image_denoising","3325237_Progressive_switching_median_filter_for_the_removal_of_impulse_noise_from_highly_corrupted_images"]}