{"id":"353045633_Machine_learning_liver-injuring_drug_interactions_with_non-steroidal_anti-inflammatory_drugs_NSAIDs_from_a_retrospective_electronic_health_record_EHR_cohort","abstract":"Drug-drug interactions account for up to 30% of adverse drug reactions. Increasing prevalence of electronic health records (EHRs) offers a unique opportunity to build machine learning algorithms to identify drug-drug interactions that drive adverse events. In this study, we investigated hospitalizations' data to study drug interactions with non-steroidal anti-inflammatory drugs (NSAIDS) that result in drug-induced liver injury (DILI). We propose a logistic regression based machine learning algorithm that unearths several known interactions from an EHR dataset of about 400,000 hospitalization. Our proposed modeling framework is successful in detecting 87.5% of the positive controls, which are defined by drugs known to interact with diclofenac causing an increased risk of DILI, and correctly ranks aggregate risk of DILI for eight commonly prescribed NSAIDs. We found that our modeling framework is particularly successful in inferring associations of drug-drug interactions from relatively small EHR datasets. Furthermore, we have identified a novel and potentially hepatotoxic interaction that might occur during concomitant use of meloxicam and esomeprazole, which are commonly prescribed together to allay NSAID-induced gastrointestinal (GI) bleeding. Empirically, we validate our approach against prior methods for signal detection on EHR datasets, in which our proposed approach outperforms all the compared methods across most metrics, such as area under the receiver operating characteristic curve (AUROC) and area under the precision-recall curve (AUPRC).","authors":["Arghya Datta","Noah Flynn","Dustyn Barnette","Keith F Woeltje"],"meta":["July 2021PLoS Computational Biology 17(7):e1009053","DOI:10.1371/journal.pcbi.1009053"],"references":["332102162_Mathematical_rules_for_synergistic_additive_and_antagonistic_effects_of_multi-drug_combinations_and_their_application_in_research_and_development_of_combinatorial_drugs_and_special_medical_food_combin","331099983_Synergistic_drug_combinations_prediction_by_integrating_pharmacological_data","329228165_Columbia_Open_Health_Data_clinical_concept_prevalence_and_co-occurrence_from_electronic_health_records","325294594_Searching_Synergistic_Dose_Combinations_for_Anticancer_Drugs","323916952_CISNE_An_accurate_description_of_dose-effect_and_synergism_in_combination_therapies","347839876_Meloxicam_methyl_group_determines_enzyme_specificity_for_thiazole_bioactivation_compared_to_sudoxicam","345629230_Black_Box_to_Conversational_Machine_Learning_Ondansetron_Reduces_Risk_of_Hospital-Acquired_Venous_Thromboembolism","344226383_Extended_multi-item_gamma_Poisson_shrinker_methods_based_on_the_zero-inflated_Poisson_model_for_postmarket_drug_safety_surveillance","340816698_Characterizing_the_Utilization_of_the_Problem_List_for_Pediatric_Trauma_Care","324577983_Deep_learning_improves_prediction_of_drug-drug_and_drug-food_interactions"]}