{"id":"353029068_Efficient_Skyline_Computation_on_Uncertain_Dimensions","abstract":"The database community has observed in the past two decades, the growth of research interest in preference queries, each of which has its unique techniques, benefits, and drawbacks. One of them is skyline queries. Skyline queries aim to report to users interesting objects based on their preferences. Yet, they are not without their limitations. Hence, this paper focuses on efficiently extending skyline query processing to support the uncertainty in dimensions, which in this paper is defined as uncertain dimension. To process skyline queries on data with uncertain dimensions, we propose SkyQUD algorithm, where it provides a mechanism that will partition the dataset according to the characteristics of each object before skyline dominance tests are performed. In the pruning process, we utilise a probability threshold value τ to accommodate the large skyline size reported by SkyQUD due to the computed probabilities. The algorithm has been validated through extensive experiments. Its results exhibit that skyline queries can be performed effectively on uncertain dimensions, and the proposed algorithm is efficient in query answering and capable of handling large datasets.","authors":["Nurul Husna Mohd Saad","Hamidah Ibrahim","Fatimah Sidi","Razali Yaakob"],"meta":["July 2021IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2021.3094547"],"references":["315532303_Efficient_Geometric_Pruning_Strategies_for_Continuous_Skyline_Queries","311639807_Reporting_skyline_on_uncertain_dimension_with_query_interval","305421730_Parallel_skyline_computation_for_frequent_queries_in_distributed_environment","303373632_Continuous_skyline_queries_on_multicore_architectures","300020922_Computing_Skyline_from_Evidential_Data","328784565_Parallelizing_uncertain_skyline_computation_against_n-of-N_data_streaming_model","327324961_M-Skyline_Taking_sunk_cost_and_alternative_recommendation_in_consideration_for_skyline_query_on_uncertain_data","316902435_Continuous_de-Skyline_Queries_for_Objects_with_Time-Varying_Attribute_in_Road_Networks","315988008_Selecting_Skyline_Stars_over_Uncertain_Databases_Semantics_and_Refining_Methods_in_the_Evidence_Theory_Setting","314819465_An_optimal_and_progressive_algorithm_for_skyline_queries"]}