{"id":"353004235_Accurate_long-range_forecasting_of_COVID-19_mortality_in_the_USA","abstract":"The need for improved models that can accurately predict COVID-19 dynamics is vital to managing the pandemic and its consequences. We use machine learning techniques to design an adaptive learner that, based on epidemiological data available at any given time, produces a model that accurately forecasts the number of reported COVID-19 deaths and cases in the United States, up to 10 weeks into the future with a mean absolute percentage error of 9%. In addition to being the most accurate long-range COVID predictor so far developed, it captures the observed periodicity in daily reported numbers. Its effectiveness is based on three design features: (1) producing different model parameters to predict the number of COVID deaths (and cases) from each time and for a given number of weeks into the future, (2) systematically searching over the available covariates and their historical values to find an effective combination, and (3) training the model using “last-fold partitioning”, where each proposed model is validated on only the last instance of the training dataset, rather than being cross-validated. Assessments against many other published COVID predictors show that this predictor is 19–48% more accurate.","authors":["Pouria Ramazi","Arezoo Haratian","Maryam Meghdadi","Arash Mari Oriyad"],"meta":["July 2021Scientific Reports 11(1):13822","DOI:10.1038/s41598-021-91365-2","Project: Forecasting of COVID-19 Mortality in the USA"],"references":["346283959_Dataset_of_COVID-19_outbreak_and_potential_predictive_features_in_the_USA","344637504_Exploiting_the_full_potential_of_Bayesian_networks_in_predictive_ecology","343820239_Ensemble_forecasts_of_Coronavirus_Disease_2019_COVID-19_in_the_US","335329380_A_novel_sub-epidemic_modeling_framework_for_short-term_forecasting_epidemic_waves","310324002_Epidemic_Forecasting_is_Messier_Than_Weather_Forecasting_The_Role_of_Human_Behavior_and_Internet_Data_Streams_in_Epidemic_Forecast_Downloaded_from","339516973_World_Health_Organization_declares_Global_Emergency_A_review_of_the_2019_Novel_Coronavirus_COVID-19"]}