{"id":"353199482_Modeling_Tankers'_Optimal_Speed_and_Emissions","abstract":"With the increased quest for greener shipping, reducing the speed of ships has obtained an important role as one of the measures to be applied toward that end. Already speed has been important for economic reasons, as it is a key determinant of fuel cost, a significant component of the operating cost of ships. However, as emissions are directly proportional to fuel consumed, speed is also very much connected with the environmental dimension of shipping. So when shipping markets are in a depressed state and “slow- steaming” is the prevalent practice for economic reasons, an important side benefit is reduced emissions.\nEmissions estimation models typically assume fixed ship speeds. However, ships do not trade at predetermined speeds. Those who pay for the fuel may choose an operating speed as a function of the freight rate and bunker price, among others. Assuming a fixed speed may thus seriously miscalculate emissions. This paper incorporates ship speed into the analysis, and goes one step further by investigating the impact of optimizing speed on ship emissions. The study of the paper focuses on Very Large Crude Carriers (VLCCs), but some analysis for the Suezmax, and Aframax crude tanker segments is also presented, and some results for Panamax/Product, LPG, and LNG tankers are also reported.\nThe paper’s modeling approach has two goals: (a) the determination of the optimal operational speeds (laden and ballast) of a tanker as a function of fuel price, freight rate and other parameters, and (b) the estimation, among other outputs, of the emissions of the global fleet of a specific tanker segment. The modeling task comprises two steps. The first one optimizes the laden and ballast leg sailing speeds over reference trade routes for a specific (single) tanker. In a second step, we estimate annual emissions, and other operational attributes (e.g. fuel consumption) for the tanker fleet segment, based on the output of the previous optimization. Other outputs such as CO2 , SO2, NOx and PM emissions are also produced. The policy implications of our work are finally discussed.","authors":["Konstantinos G Gkonis","Harilaos N Psaraftis"],"meta":["October 2012","DOI:10.5957/SMC-2012-A08","Conference: SNAME Maritime Convention"],"references":[]}