{"id":"353197069_A_rigorous_and_robust_quantum_speed-up_in_supervised_machine_learning","abstract":"Recently, several quantum machine learning algorithms have been proposed that may offer quantum speed-ups over their classical counterparts. Most of these algorithms are either heuristic or assume that data can be accessed quantum-mechanically, making it unclear whether a quantum advantage can be proven without resorting to strong assumptions. Here we construct a classification problem with which we can rigorously show that heuristic quantum kernel methods can provide an end-to-end quantum speed-up with only classical access to data. To prove the quantum speed-up, we construct a family of datasets and show that no classical learner can classify the data inverse-polynomially better than random guessing, assuming the widely believed hardness of the discrete logarithm problem. Furthermore, we construct a family of parameterized unitary circuits, which can be efficiently implemented on a fault-tolerant quantum computer, and use them to map the data samples to a quantum feature space and estimate the kernel entries. The resulting quantum classifier achieves high accuracy and is robust against additive errors in the kernel entries that arise from finite sampling statistics. Many quantum machine learning algorithms have been proposed, but it is typically unknown whether they would outperform classical methods on practical devices. A specially constructed algorithm shows that a formal quantum advantage is possible.","authors":["Yunchao Liu","Srinivasan Arunachalam","Kristan Temme"],"meta":["September 2021Nature Physics 17(9):1-5","DOI:10.1038/s41567-021-01287-z"],"references":["352221253_Experimental_quantum_kernel_trick_with_nuclear_spins_in_a_solid","350326587_On_the_Quantum_versus_Classical_Learnability_of_Discrete_Distributions","343157224_Experimental_kernel-based_quantum_machine_learning_in_finite_feature_space","332051551_Error_mitigation_extends_the_computational_reach_of_a_noisy_quantum_processor","331719791_Supervised_learning_with_quantum-enhanced_feature_spaces","352299204_Quantum-Inspired_Support_Vector_Machine","349642268_Sampling-based_sublinear_low-rank_matrix_arithmetic_framework_for_dequantizing_Quantum_machine_learning","337803345_Machine_learning_and_the_physical_sciences","334854437_Quantum_SDP_Solvers_Large_Speed-ups_Optimality_and_Applications_to_Quantum_Learning","333914977_A_quantum-inspired_classical_algorithm_for_recommendation_systems","329511339_A_quantum_machine_learning_algorithm_based_on_generative_models","329651018_An_Introduction_to_Computational_Learning_Theory","324744952_Quantum_generative_adversarial_networks","324744809_Quantum_Generative_Adversarial_Learning","324492525_Differentiable_Learning_of_Quantum_Circuit_Born_Machine"]}