{"id":"353178784_An_interpretable_multiple-instance_approach_for_the_detection_of_referable_diabetic_retinopathy_in_fundus_images","abstract":"Diabetic retinopathy (DR) is one of the leading causes of vision loss across the world. Yet despite its wide prevalence, the majority of affected people lack access to the specialized ophthalmologists and equipment required for monitoring their condition. This can lead to delays in the start of treatment, thereby lowering their chances for a successful outcome. Machine learning systems that automatically detect the disease in eye fundus images have been proposed as a means of facilitating access to retinopathy severity estimates for patients in remote regions or even for complementing the human expert's diagnosis. Here we propose a machine learning system for the detection of referable diabetic retinopathy in fundus images, which is based on the paradigm of multiple-instance learning. Our method extracts local information independently from multiple rectangular image patches and combines it efficiently through an attention mechanism that focuses on the abnormal regions of the eye (i.e. those that contain DR-induced lesions), thus resulting in a final image representation that is suitable for classification. Furthermore, by leveraging the attention mechanism our algorithm can seamlessly produce informative heatmaps that highlight the regions where the lesions are located. We evaluate our approach on the publicly available Kaggle, Messidor-2 and IDRiD retinal image datasets, in which it exhibits near state-of-the-art classification performance (AUC of 0.961 in Kaggle and 0.976 in Messidor-2), while also producing valid lesion heatmaps (AUPRC of 0.869 in the 81 images of IDRiD that contain pixel-level lesion annotations). Our results suggest that the proposed approach provides an efficient and interpretable solution against the problem of automated diabetic retinopathy grading.","authors":["Alexandros Papadopoulos","Fotis Topouzis","Anastasios Delopoulos"],"meta":["July 2021Scientific Reports 11(1)","DOI:10.1038/s41598-021-93632-8"],"references":["349534303_Diabetic_Retinopathy_Detection","345020319_Diabetic_Retinopathy_detection_through_integration_of_Deep_Learning_classification_framework","336906206_Grad-CAM_Visual_Explanations_from_Deep_Networks_via_Gradient-Based_Localization","329617268_Using_a_Deep_Learning_Algorithm_and_Integrated_Gradients_Explanation_to_Assist_Grading_for_Diabetic_Retinopathy","326312114_Indian_Diabetic_Retinopathy_Image_Dataset_IDRiD_A_Database_for_Diabetic_Retinopathy_Screening_Research","323722849_Replication_study_Development_and_validation_of_deep_learning_algorithm_for_detection_of_diabetic_retinopathy_in_retinal_fundus_photographs","323165042_Attention-based_Deep_Multiple_Instance_Learning","341758150_A_Survey_on_Medical_Image_Analysis_in_Diabetic_Retinopathy","338512827_Collaborative_Learning_of_Semi-Supervised_Segmentation_and_Classification_for_Medical_Images","332054102_A_Data-driven_Approach_to_Referable_Diabetic_Retinopathy_Detection","321788243_Leveraging_uncertainty_information_from_deep_neural_networks_for_disease_detection","322058942_Grad-CAM_Visual_Explanations_from_Deep_Networks_via_Gradient-Based_Localization","321220144_Deep_multiple_instance_learning_for_automatic_detection_of_diabetic_retinopathy_in_retinal_images","320223300_Grader_Variability_and_the_Importance_of_Reference_Standards_for_Evaluating_Machine_Learning_Models_for_Diabetic_Retinopathy","319770291_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition"]}