{"id":"353247542_Progress_and_prospects_of_hyperspectral_remote_sensing_technology_for_crop_diseases_and_pests","abstract":"The changes in global climate and the accelerated development of trade have continuously expanded the distributions, host ranges, and impacts of crop diseases and pests. They have become one of the most important threatening factors of crop quality, yield, and food safety in the whole process of agricultural production. The monitoring and identification of crop diseases and pests are always based on visual inspection. However, the artificial-based method is time and labor consuming, and the survey results cannot satisfy the requirements of large area and exact analysis. Biological and chemical-related professional bacteria detection method is also costly and unsuitable for promotion in farmers. Remote sensing, which is a typical non-invasive method, provides reliable and precise technical support for real-time and large-scale monitoring of crop diseases and pests in recent decades. Each remote sensing system, such as visible and near-infrared spectral sensors, fluorescence and thermal sensors, and synthetic aperture radar and light detection and ranging system, has its own characteristics and maturity in detecting and monitoring plant diseases and pests. Hyperspectral remote sensing technology can easily, quickly, non-destructively, and accurately assess information of diseases and pests, including type identification, detection, mapping, and severity and loss assessment, because of its continuous narrow waveband characteristics. The occurrence of crop diseases and pests is a dynamic and complex process. On the one hand, crop diseases and pests are often caused by more than one causal agent, and each has different symptoms. On the other hand, host plant pathogen and pest interaction is a complex dynamic process with changes in various physiological and biochemical parameters. The two main aspects make the application of hyperspectral technology in the monitoring of diseases and pests particularly prominent because it can cover a spectral range of up to 350-2500 nm and can yield a narrow spectral resolution of less than 10 nm. These characteristics are suitable not only for disease differentiation based on slight differences but also for monitoring and analysis of dynamic disease processes. This extra information will provide additional benefits for plant disease detection, especially for detection during the latency period when symptoms are invisible to the human eye. This review first describes the basic principles of hyperspectral remote sensing and introduces the investigating mechanism of crop diseases and pests. On the basis of bibliometric analysis on the hyperspectral remote sensing-based monitoring of crop diseases and pests and detection literature from WOS and CNKI, four main research directions are summarized: identification of diseases and pest and healthy crops, classification of different diseases and pests, quantitative analysis of severity, and early asymptomatic detection. Then, we review the main development of related technologies and research status in detail. Finally, three major challenges are put forward on the basis of the abovementioned summary on technologies, developments, advantages, and disadvantages of monitoring of crop diseases and pests. This review proves that the establishment of standard spectral library of crop diseases and pests on different scales, the improvement of satellite hyperspectral sensors, and the construction of the integrated monitoring platform will be the key points to applying hyperspectral remote sensing technology.","authors":["N. Zhang","G. Yang","C. Zhao","J. Zhang"],"meta":["January 2021","DOI:10.11834/jrs.20210196"],"references":[]}