{"id":"353259272_VISUALIZATION_TECHNOLOGIES_FOR_MATERIAL_DEVELOPMENT_IN_PROFESSIONAL_TRAINING_OF_FUTURE_SPECIALISTS","abstract":"The ar cle presents the experience of using visualiza on technology in the professional training of future engineers-teachers of computer profile, in par cular video lectures on the example of training IT specialists. It is emphasized that it is necessary to change the paradigm of teaching computer disciplines in the context of visualiza on of didac c materials as a basis for the abstrac on of material. Prac cal aspects of the development of didac c and methodical materials of technology of students training for computer science' school course with the video materials used are considered. It is proved that a large number of different methods and tools of teaching is an effec ve mechanism that can solve both educa onal and methodological problems for the modern educa onal innova ons' applica on in higher educa on, op-mize the educa onal process and implement new approaches to lifelong learning. It is established that the use of e-learning systems with the implementa on of visualiza on contributes to a more successful percep on and memoriza on of educa onal material. This is due to the work intensifica on at the same me both hemispheres: the le hemisphere usually works in tradi onal learning, the right hemisphere, the responsibility for the image-emo onal percep on of the proposed informa on, is ac vated by visual-iza on. As a result, there is a crea ve and professional development of personality. The classical methods of teaching the discipline \"School course of informa cs\" with lecture-prac cal forms of teaching with text didac c materials that have a low level of abstrac on compared to the use of video materials are analysed. It is proved that, due to the technical advantages of the use of video materials, the quality and efficiency of the educa onal process is improved. That is, visualiza on technologies have significant poten al, which guarantees high-quality professional training of students.","authors":["Hanna Alieksieieva","Olga Novak","Miziuk Viktoriia","Yuliia Saienko"],"meta":["July 2021","DOI:10.26565/2074-8167-2021-48-11","Project: Higher Education"],"references":["325759563_Practical_education_on_a_higher_level_in_Poland_example_of_katowice_school_of_technology","265966036_Development_of_the_CAD_system_for_designing_non-standard_constructions_from_elastomers","49614475_Media_Education_Practices_in_Teacher_Training","303481908_Research_on_the_Curriculum_System_Construction_Plan_for_Animation_Design_and_Production_of_Specialty_in_High_Vocational_Colleges","290977532_Reviewing_Educational_Methodology_in_the_Domain_of_Animation_at_the_Smart_Media_Era"]}