{"id":"353325452_The_Structure_and_Discourse_Analysis_of_Acknowledgments","abstract":"An M.A. M.S. or Ph.D. thesis is a written report of an organized research conducted by a postgraduate university student to receive an academic degree. In spite of the variation in structure and tone of theses, some sections of these reports are well-established and somehow fixed. One initial section of theses is the acknowledgement page, a usually short section where the student thanks his or her supervisor(s), advisor(s), family, friends, colleagues as well as institutions such as libraries, faculties , departments, and/or companies and non-academic centers. This section enjoys a double opposite nature. While it is included in an academic and thereby formal text, it usually violates the essential patterns of such texts as writers tend to be personal and emotional in rendering their gratitude. Academic disciplines are usually divided into hard and soft sciences. The differences between these two scientific endeavors are discussed by scholars of philosophy , sociology as well as linguistics. Discourse analysts have paid attention to these two paradigms through similarities and differences of texts written in hard and soft sciences. The acknowledgement section of theses in both hard and soft sciences has been investigated by scholars and Hyland's (2004) model is regarded as the most cited theoretical framework. Following Hyland's model, the present study addresses the following questions; (1) Do acknowledgement patterns in Iranian M.A., M.S. and Ph.D. theses support those reported in Hyland (2004)? (2) Are acknowledgement patterns in Iranian M.A. and M.S. theses different from those in Ph.D. theses? (3) Are acknowledgement patterns in Iranian postgraduate theses different in hard and soft sciences? To answer these questions, 240 acknowledgements have been collected from 120 M.A. dissertations and 120 Ph.D. theses from six hard sciences (computer science,","authors":["Ali Famian","Yaghoub Naebi"],"meta":["January 2018","DOI:10.22051/jlr.2018.17482.1427","Project: Syntactic Frameworks and Discourse Functions of Lexical Antonymy"],"references":["303880756_The_Generic_Structure_of_Acknowledgments_in_Persian_Dissertations","273370374_Occluded_Genres_in_the_Academy_The_Case_of_the_Submission_Letter","273145974_A_genre_analysis_of_PhD_dissertation_acknowledgements_across_disciplinary_variations","282583498_A_corpus-based_study_of_the_expression_of_stance_in_dissertation_acknowledgements","276247758_Politeness_in_Persian_and_English_Dissertation_Acknowledgments","249238034_Worlds_of_Gratitude_A_Contrastive_Study_of_Acknowledgement_Texts_in_English_and_Italian_Research_Articles","229799911_On_acknowledgement_and_Cavell's_unacknowledged_theological_voice","223112479_An_Exploratory_Analysis_of_History_Students'_Dissertation_Acknowledgments","222650448_Graduates'_gratitude_The_generic_structure_of_dissertation_acknowledgements"]}