{"id":"353370389_Categorising_Vaccine_Confidence_with_Transformer-Based_Machine_Learning_Model_The_Nuances_of_Vaccine_Sentiment_within_Twitter_Discourse_Preprint","abstract":"Background: With growing conversations online and less than desired maternal vaccination uptake rates, these conversations\ncould provide useful insight to inform future interventions. Automated processes for this type of analysis, such as natural\nlanguage processing (NLP), have faced challenges extracting complex stances, like attitudes toward vaccines, from large text.\nObjective: In this study, we aimed to build upon recent advances in Transformer-based machine learning methods, and test if\nthis could be used as a tool to assess the stance of social media posts towards vaccination during pregnancy.\nMethods: A total of 16,604 Tweets posted between 1 November 2018 and 30 April 2019 were selected by boolean searches\nrelated to maternal vaccination. Tweets were coded by three individual researchers into the categories “Promotional”,\n“Discouraging”, “Ambiguous” and “Neutral” After creating a final dataset of 2,722 unique tweets, multiple machine learning\nmethods were trained on the dataset and then tested and compared to the human annotators.\nResults: We received an accuracy of 81.8% (F-score= 0.78) compared to the agreed score between the three annotators. For\ncomparison, the accuracies of the individual annotators compared to the final score were 83.3%, 77.9% and 77.5%.\nConclusions: This study demonstrates the ability to achieve close to the same accuracy in categorising tweets using our machine\nlearning models as could be expected by a single human annotator. The potential to use this reliable and accurate automated\nprocess could free up valuable time and resource constraints of conducting this analysis, in addition to inform potentially\neffective and necessary interventions.","authors":["Per E Kummervold","Sam Martin","Sara Dada","Eliz Kilich"],"meta":["April 2021JMIR Medical Informatics 9(10)","DOI:10.2196/29584"],"references":["328726302_Influenza_and_pertussis_vaccination_in_pregnancy_Portrayal_in_online_media_articles_and_perceptions_of_pregnant_women_and_healthcare_professionals","327713704_Emergence_of_Tuberculosis_in_Pakistan_A_Clear_Problem_in_Near_Future","327209378_Weaponized_Health_Communication_Twitter_Bots_and_Russian_Trolls_Amplify_the_Vaccine_Debate","347643671_Tradition_and_Innovation_in_Sulgi's_Concept_of_Divine_Kingship","346807873_Introduction_Near_Abroads","343542953_Vaccines_for_pregnant_women_Absurd_-_Mapping_maternal_vaccination_discourse_and_stance_on_social_media_over_six_months","336049960_httpseuroasia-sciencerupdf-arxivthe-controllability-function-of-polynomial-for-descriptor-systems-23-31","335783773_Multi-Task_Deep_Neural_Networks_for_Natural_Language_Understanding","326705456_Multimodal_Sentiment_Analysis_using_Hierarchical_Fusion_with_Context_Modeling","317252758_Semantic_network_analysis_of_vaccine_sentiment_in_online_social_media"]}