{"id":"353335631_Efficient-CapsNet_capsule_network_with_self-attention_routing","abstract":"Deep convolutional neural networks, assisted by architectural design strategies, make extensive use of data augmentation techniques and layers with a high number of feature maps to embed object transformations. That is highly inefficient and for large datasets implies a massive redundancy of features detectors. Even though capsules networks are still in their infancy, they constitute a promising solution to extend current convolutional networks and endow artificial visual perception with a process to encode more efficiently all feature affine transformations. Indeed, a properly working capsule network should theoretically achieve higher results with a considerably lower number of parameters count due to intrinsic capability to generalize to novel viewpoints. Nevertheless, little attention has been given to this relevant aspect. In this paper, we investigate the efficiency of capsule networks and, pushing their capacity to the limits with an extreme architecture with barely 160 K parameters, we prove that the proposed architecture is still able to achieve state-of-the-art results on three different datasets with only 2% of the original CapsNet parameters. Moreover, we replace dynamic routing with a novel non-iterative, highly parallelizable routing algorithm that can easily cope with a reduced number of capsules. Extensive experimentation with other capsule implementations has proved the effectiveness of our methodology and the capability of capsule networks to efficiently embed visual representations more prone to generalization.","authors":["Vittorio Mazzia","Francesco Salvetti","Marcello Chiaberge"],"meta":["July 2021Scientific Reports 11(14634)","DOI:10.1038/s41598-021-93977-0","Project: Capsule-based Networks"],"references":["342845919_Multi-Image_Super_Resolution_of_Remotely_Sensed_Images_Using_Residual_Attention_Deep_Neural_Networks","342536612_Capsule_Routing_via_Variational_Bayes","338440436_Real-Time_Apple_Detection_System_Using_Embedded_Systems_With_Hardware_Accelerators_An_Edge_AI_Application","335322387_CBIR_system_using_Capsule_Networks_and_3D_CNN_for_Alzheimer's_disease_diagnosis","343469185_Improving_the_Robustness_of_Capsule_Networks_to_Image_Affine_Transformations","339751174_Attention_Routing_Between_Capsules","339635006_BG-SAC_Entity_relationship_classification_model_based_on_Self-Attention_supported_Capsule_Networks","337627035_Scale_Specified_Single_Shot_MultiBox_Detector","333298143_Automated_Classification_of_Apoptosis_in_Phase_Contrast_Microscopy_Using_Capsule_Network","332790927_Capsule-forensics_Using_Capsule_Networks_to_Detect_Forged_Images_and_Videos"]}