{"id":"353326483_Flat_morphological_operators_from_non-increasing_set_operators_I_general_theory","abstract":"Flat morphology is a general method for obtaining increasing operators on grey-level or multivalued images from increasing operators on binary images (or sets). It relies on threshold stacking and superposition; equivalently, Boolean max and min operations are replaced by lattice-theoretical sup and inf operations.\nIn this paper we consider the construction a flat operator on grey-level or colour images from an operator on binary images that is not increasing. Here grey-level and colour images are functions from a space to an interval in ℝ m or ℤ m ( m ≥ 1). Two approaches are proposed. First, we can replace threshold superposition by threshold summation. Next, we can decompose the non-increasing operator on binary images into a linear combination of increasing operators, then apply this linear combination to their flat extensions. Both methods require the operator to have bounded variation, and then both give the same result, which conforms to intuition. Our approach is very general, it can be applied to linear combinations of flat operators, or to linear convolution filters.\nOur work is based on a mathematical theory of summation of real-valued functions of one variable ranging in a poset.\nIn a second paper, we will study some particular properties of non-increasing flat operators.","authors":["Christian Ronse"],"meta":["July 2021","DOI:10.1515/mathm-2020-0109"],"references":["281504117_Connected_Filtering_on_Tree-Based_Shape-Spaces","251465113_LULU_Theory_Idempotent_Stack_Filters_and_the_Mathematics_of_Vision_of_Marr","291083250_Closure","271828097_Image_Analysis_and_Mathematical_Morphology_Vol_1","266599741_Bounded_variation_in_posets_with_applications_in_morphological_image_processing","250677517_Syntonicity_of_functions_and_the_variation_functional","234286123_Morphological_Image_Operators","227080343_Functions_of_restricted_variation","225454859_Flat_Morphological_Operators_on_Arbitrary_Power_Lattices","222742274_Order-configuration_functions_Mathematical_characterizations_and_applications_to_digital_signal_and_image_processing","6630519_Connected_Shape-Size_Pattern_Spectra_for_Rotation_and_Scale-Invariant_Classification_of_Gray-Scale_Images","5576304_Antiextensive_connected_operators_for_image_and_sequence_processing","220599812_Grey-level_hit-or-miss_transforms-Part_I_Unified_theory","220146503_Partial_Partitions_Partial_Connections_and_Connective_Segmentation","220146184_Flat_Morphology_on_Power_Lattices"]}