{"id":"353358128_Revised_Model_of_Abrasive_Water_Jet_Cutting_for_Industrial_Use","abstract":"Research performed by the author in the last decade led him to a revision of his older analytical models used for a description and evaluation of abrasive water jet (AWJ) cutting. The review has shown that the power of 1.5 selected for the traverse speed thirty years ago was influenced by the precision of measuring devices. Therefore, the correlation of results calculated from a theoretical model with the results of experiments performed then led to an increasing of the traverse speed exponent above the value derived from the theoretical base. Contemporary measurements, with more precise devices, show that the power suitable for the traverse speed is essentially the same as the value derived in the theoretical description, i.e., it is equal to “one”. Simultaneously, the replacement of the diameter of the water nozzle (orifice) by the focusing (abrasive) tube diameter in the respective equations has been discussed, because this factor is very important for the AWJ machining. Some applications of the revised model are presented and discussed, particularly the reduced forms for a quick recalculation of the changed conditions. The correlation seems to be very good for the results calculated from the present model and those determined from experiments. The improved model shows potential to be a significant tool for preparation of the control software with higher precision in determination of results and higher calculation speed.","authors":["Libor M. Hlaváč"],"meta":["July 2021Materials 14(14):4032","DOI:10.3390/ma14144032"],"references":["331992459_Correcting_shape_error_on_external_corners_caused_by_the_cut-incut-out_process_in_abrasive_water_jet_cutting","323272568_Deformation_of_products_cut_on_AWJ_x-y_tables_and_its_suppression","308336754_Abrasives_for_water-jet_cutting_of_high-strength_and_thick_hard_materials","281102437_Thermal_aspects_of_ice_abrasive_water_jet_technology","334342526_Surface_quality_and_kerf_width_prediction_in_abrasive_water_jet_machining_of_metal-composite_stacks","324301657_Shape_distortion_reduction_method_for_abrasive_water_jet_AWJ_cutting","317155292_Prediction_of_surface_roughness_in_abrasive_waterjet_trimming_of_fiber_reinforced_polymer_composites","316657387_Precision_comparison_of_analytical_and_statistical-regression_models_for_AWJ_cutting","298807010_Inverse_methods_to_gradient_etch_three-dimensional_features_with_prescribed_topographies_using_abrasive_jet_micro-machining_Part_I_-_Modeling","292950358_Particles_Impact_Characteristics_on_Cutting_Surface_During_the_Abrasive_Water_Jet_Machining_Numerical_Study"]}