{"id":"353490623_Forest_Fire_Recognition_Based_on_Feature_Extraction_from_Multi-View_Images","abstract":"Forest fire recognition is important to the protection of forest resources. To effectively monitor forest fires, it is necessary to deploy multiple monitors from different angles. However, most of the traditional recognition models can only recognize single-source images. The neglection of multi-view images leads to a high false positive/negative rate. To improve the accuracy of forest fire recognition, this paper proposes a graph neural network (GNN) model based on the feature similarity of multi-view images. Specifically, the correlations (nodes) between multi-view images and library images were established to convert the input features of graph nodes into the correlation features between different images. Based on feature relationships, the image features in the library were updated to estimate the node similarity in the GNN model, improving the image recognition rate of our model. Furthermore, a fire area feature extraction method was designed based on image segmentation, aiming to simplify the complex preprocessing of images, and effectively extract the key features from images. By setting the threshold in the hue-saturation-value (HSV) color space, the fire area was extracted from the images, and the dynamic features were extracted from the continuous frames of the fire area. Experimental results show that our method recognized forest fires more effectively than the baselines, improving the recognition accuracy by 4%. In addition, the multi-source forest fire data experiment also confirms that our method could adapt to different forest fire scenes, and boast a strong generalization ability and anti-interference ability.","authors":["Di Wu","Zhang Chunjiong","Li Ji","Rong Ran"],"meta":["June 2021Traitement du Signal 38(3):775-783","DOI:10.18280/ts.380324"],"references":["348208318_Geographic_routing_with_hybrid_firefly_algorithm_and_galactic_swarm_optimization_for_efficient_'void'_handling_in_mobile_ad_hoc_networks","347887080_A_review_on_status_implications_and_recent_trends_of_forest_fire_management","347615156_Pyramid_Pooling_Module-Based_Semi-Siamese_Network_A_Benchmark_Model_for_Assessing_Building_Damage_from_xBD_Satellite_Imagery_Datasets","345768985_A_Review_on_Early_Forest_Fire_Detection_Systems_Using_Optical_Remote_Sensing","344457693_Early_Fire_Detection_Based_on_Aerial_360-Degree_Sensors_Deep_Convolution_Neural_Networks_and_Exploitation_of_Fire_Dynamic_Textures","342853362_Target_Positioning_Based_on_Particle_Centroid_Drift_in_Large-Scale_WSNs","346169466_Forest_fire_smoke_recognition_based_on_convolutional_neural_network","344710811_i-FireNet_A_Lightweight_CNN_to_Increase_Generalization_Performance_for_Real-Time_Detection_of_Forest_Fire_in_Edge_AI_Environments","343900072_Early_Forest-Fire_Detection_using_ScanningPolarization_Lidar","343277059_Choosing_the_Structure_of_Satellite_Systems_for_Meteorology_and_Forest_Fire_Detection_on_the_Basis_of_a_Vector_Model_of_Surveying_the_Earth"]}