{"id":"353467624_Automatic_Selection_of_Relevant_Attributes_for_Multi-Sensor_Remote_Sensing_Analysis_A_Case_Study_on_Sea_Ice_Classification","abstract":"It is of considerable benefit to combine information obtained from different satellite sensors to achieve advanced and improved characterization of sea ice conditions. However, it is also true that not all the information is relevant. It may be redundant, corrupted, or unnecessary for the given task, hence decreasing the performance of the algorithms. Therefore, it is crucial to select an optimal set of image attributes that provides the relevant information content to enhance the efficiency and accuracy of the image interpretation and retrieval of geophysical parameters. Comprehensive studies have been focused on the analysis of relevant features for sea ice analysis obtained from different sensors, especially synthetic aperture radar. However, the outcomes of these studies are mostly data and application-dependent, and can therefore rarely be generalized. In this article, we employ a feature selection method based on Graph Laplacians, which is fully automatic and easy to implement. The proposed approach assesses relevant information on a global and local level using two metrics and selects relevant features for different regions of an image according to their physical characteristics and observation conditions. In the recent study we investigate the effectiveness of this approach for sea ice classification, using different multi-sensor data combinations. Experiments show the advantage of applying multi-sensor data sets and demonstrate that the attributes selected by our method result in high classification accuracies. We demonstrate that our approach automatically considers varying technical, sensor-specific, environmental, and sea ice conditions by employing flexible and adaptive feature selection method as a pre-processing step.","authors":["Eduard Khachatrian","Saloua Chlaily","Torbjorn Eltoft","Wolfgang Dierking"],"meta":["July 2021IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing PP(14):9025 - 9037","DOI:10.1109/JSTARS.2021.3099398"],"references":["355864006_A_Multimodal_Feature_Selection_Method_for_Remote_Sensing_Data_Analysis_Based_on_Double_Graph_Laplacian_Diagonalization","343333117_Robust_Arctic_warming_caused_by_projected_Antarctic_sea_ice_loss","334212099_An_Optimal_Decision-Tree_Design_Strategy_and_Its_Application_to_Sea_Ice_Classification_from_SAR_Imagery","333712277_Classification_of_Sea_Ice_Types_in_Sentinel-1_SAR_images","330724873_A_review_of_unsupervised_feature_selection_methods","324496876_Open-source_algorithm_for_detecting_sea_ice_surface_features_in_high-resolution_optical_imagery","323558767_Method_for_detection_of_leads_from_Sentinel-1_SAR_images","338409470_Copernicus_L-band_SAR_Mission_Requirements_Document","313487833_A_tutorial_on_spectral_clustering","286680079_Compact_Watershed_and_Preemptive_SLIC_On_Improving_Trade-offs_of_Superpixel_Segmentation_Algorithms"]}