{"id":"353407595_Classification_of_ECG_signals_using_multi-cumulants_based_evolutionary_hybrid_classifier","abstract":"Every human being has a different electro-cardio-graphy (ECG) waveform that provides information about the well being of a human heart. Therefore, ECG waveform can be used as an effective identification measure in biometrics and many such applications of human identification. To achieve fast and accurate identification of human beings using ECG signals, a novel robust approach has been introduced here. The databases of ECG utilized during the experimentation are MLII, UCI repository arrhythmia and PTBDB databases. All these databases are imbalanced; hence, resampling techniques are helpful in making the databases balanced. Noise removal is performed with discrete wavelet transform (DWT) and features are obtained with multi-cumulants. This approach is mainly based on features extracted from the ECG data in terms of multi-cumulants. The multi-cumulants feature based ECG data is classified using kernel extreme learning machine (KELM). The parameters of multi-cumulants and KELM are optimized using genetic algorithm (GA). Excellent classification rate is achieved with 100% accuracy on MLII and UCI repository arrhythmia databases, and 99.57% on PTBDB database. Comparison with existing state-of-art approaches has also been performed to prove the efficacy of the proposed approach. Here, the process of classification in the proposed approach is named as evolutionary hybrid classifier.","authors":["Sahil Dalal","Virendra P. Vishwakarma"],"meta":["July 2021Scientific Reports 11(1):15092","DOI:10.1038/s41598-021-94363-6"],"references":["341339340_A_Novel_Approach_of_Face_Recognition_Using_Optimized_Adaptive_Illumination-Normalization_and_KELM","340700135_Patient_Specific_Machine_Learning_Models_for_ECG_Signal_Classification","340683703_GA_based_KELM_Optimization_for_ECG_Classification","339821413_Neuro-Fuzzy_Hybridization_using_Modified_S_Membership_Function_and_Kernel_Extreme_Learning_Machine_for_Robust_Face_Recognition_under_Varying_Illuminations","339020698_PHT_and_KELM_Based_Face_Recognition","338413762_A_novel_non-linear_modifier_for_adaptive_illumination_normalization_for_robust_face_recognition","342232632_Extreme_Learning_Machine_Theory_and_Applications","341082730_Cardiac_arrhythmia_classification_using_tunable_Q-wavelet_transform_based_features_and_support_vector_machine_classifier","340811489_Hybrid_SVM-LR_Classifier_for_Powdery_Mildew_Disease_Prediction_in_Tomato_Plant","340361764_Cloud-based_ECG_monitoring_using_event-driven_ECG_acquisition_and_machine_learning_techniques"]}