{"id":"353418160_RELATIONSHIPS_BETWEEN_FINANCIAL_DEVELOPMENT_AND_ECONOMIC_GROWTH_A_NEW_APPROACH_BY_INPUTS","abstract":"This paper will discuss a new approach to studying finance-growth nexus, based on the production inputs. We analyze, from a panel of 93 countries (developed countries and least developed countries) over the period 1972-2012, the standard regress of economic growth as well as a new proxy for financial activity and interaction effects of the latter with catching up, education, and physical capital accumulation. The results of the Least Squares Dummy Variable estimator show that, from a global perspective, financial activity was beneficial for growth and development. The interaction between financial development and the standard explanation of growth is an appropriate characterization of the relationship finance-growth. Secondly, there are signs of a positive relationship between financial development of countries and its potential for catching up. Third, financial activity has led to additional benefits in countries with higher levels of adult literacy. Fourth, regardless of a possible volume effect of financial development on saving and investment, there is a positive relationship between financial activity and the rate of capital accumulation, with respect to growth.","authors":["Khalil Mhadhbi"],"meta":["January 2014","Project: financial development and economic growth"],"references":["333083131_Leading_Indicators_of_Currency_Crises","332694056_Truth_and_Robustness_in_Cross-country_Growth_Regressions","324319180_Premodern_Financial_Systems_A_Historical_Comparative_Study","324290289_Institutions_Institutional_Change_and_Economic_Performance","320182037_General_Theory_of_Employment_Interest_and_Money","313554320_On_the_mechanics_of_economic_development","313198023_International_measures_of_schooling_years_and_schooling_quality","284061601_Bank-based_and_market-based_financial_systems_Cross-country_comparisons","274939368_Financial_Structure_and_Development","274650549_The_Economic_Institutions_of_Capitalism"]}