{"id":"353483077_Country_transition_index_based_on_hierarchical_clustering_to_predict_next_COVID-19_waves","abstract":"COVID-19 has widely spread around the world, impacting the health systems of several countries in addition to the collateral damage that societies will face in the next years. Although the comparison between countries is essential for controlling this disease, the main challenge is the fact of countries are not simultaneously affected by the virus. Therefore, from the COVID-19 dataset by the Johns Hopkins University Center for Systems Science and Engineering, we present a temporal analysis on the number of new cases and deaths among countries using artificial intelligence. Our approach incrementally models the cases using a hierarchical clustering that emphasizes country transitions between infection groups over time. Then, one can compare the current situation of a country against others that have already faced previous waves. By using our approach, we designed a transition index to estimate the most probable countries’ movements between infectious groups to predict next wave trends. We draw two important conclusions: (1) we show the historical infection path taken by specific countries and emphasize changing points that occur when countries move between clusters with small, medium, or large number of cases; (2) we estimate new waves for specific countries using the transition index.","authors":["Ricardo A. Rios","Tatiane Nogueira","Danilo B. Coimbra","Tiago JS Lopes"],"meta":["July 2021Scientific Reports 11(1):15271","DOI:10.1038/s41598-021-94661-z"],"references":["348520023_The_COVID-19_pandemic_and_the_2020_US_presidential_election","350115197_COVID-19_second_wave_mortality_in_Europe_and_the_United_States","348096076_Association_between_COVID-19_cases_and_international_equity_indices","347869138_Asymptomatic_transmission_of_covid-19","347760355_A_Differential_Evolution_Algorithm_With_Adaptive_Niching_and_K-Means_Operation_for_Data_Clustering","347655523_Why_is_long-lasting_birth_control_struggling_to_catch_on","347307286_What_the_data_say_about_asymptomatic_COVID_infections","346376627_COVID_and_the_US_election_will_the_rise_of_mail-in_voting_affect_the_result","346317239_Assessing_countries'_performances_against_COVID-19_via_WSIDEA_and_machine_learning_algorithms","345369905_COVID-19_in_the_United_States_Trajectories_and_second_surge_behavior"]}