{"id":"353472395_Stochastic-Deep_Learning_Parameterization_of_Ocean_Momentum_Forcing","abstract":"Coupled climate simulations that span several hundred years cannot be run at a high‐enough spatial resolution to resolve mesoscale ocean dynamics. Recently, several studies have considered Deep Learning to parameterize subgrid forcing within macroscale ocean equations using data from ocean‐only simulations with idealized geometry. We present a stochastic Deep Learning parameterization that is trained on data generated by CM2.6, a high‐resolution state‐of‐the‐art coupled climate model. We train a Convolutional Neural Network for the subgrid momentum forcing using macroscale surface velocities from a few selected subdomains with different dynamical regimes. At each location of the coarse grid, rather than predicting a single number for the subgrid momentum forcing, we predict both the mean and standard deviation of a Gaussian probability distribution. This approach requires training our neural network to minimize a negative log‐likelihood loss function rather than the Mean Square Error, which has been the standard in applications of Deep Learning to the problem of parameterizations. Each estimate of the conditional mean subgrid forcing is thus associated with an uncertainty estimate–the standard deviation—which will form the basis for a stochastic subgrid parameterization. Offline tests show that our parameterization generalizes well to the global oceans and a climate with increased CO2 levels without further training. We then implement our learned stochastic parameterization in an eddy‐permitting idealized shallow water model. The implementation is stable and improves some statistics of the flow. Our work demonstrates the potential of combining Deep Learning tools with a probabilistic approach in parameterizing unresolved ocean dynamics.","authors":["Arthur P. Guillaumin","Laure Zanna"],"meta":["September 2021Journal of Advances in Modeling Earth Systems 13(9)","DOI:10.1029/2021MS002534"],"references":["351060850_Global_changes_in_oceanic_mesoscale_currents_over_the_satellite_altimetry_record","349362187_Cloud-Native_Repositories_for_Big_Scientific_Data","346074973_Parameterizing_the_Impact_of_Unresolved_Temperature_Variability_on_the_Large_Scale_Density_Field_Part_I_Theory","343631648_The_GFDL_Earth_System_Model_version_41_GFDL-ESM_41_Overall_coupled_model_description_and_simulation_characteristics","343507914_Data-Driven_Equation_Discovery_of_Ocean_Mesoscale_Closures","342667723_Stable_machine-learning_parameterization_of_subgrid_processes_for_climate_modeling_at_a_range_of_resolutions","339348189_Machine_Learning_for_Stochastic_Parameterization_Generative_Adversarial_Networks_in_the_Lorenz'96_Model","349349395_Climbing_down_Charney's_ladder_Machine_learning_and_the_post-Dennard_era_of_computational_climate_science","346581064_DPM_A_deep_learning_PDE_augmentation_method_with_application_to_large-eddy_simulation","346117918_Interpreting_and_Stabilizing_Machine-Learning_Parametrizations_of_Convection"]}