{"id":"353413825_Joint_language_production_An_electrophysiological_investigation_of_simulated_lexical_access_on_behalf_of_a_task_partner","abstract":"This study investigates in a joint action setting a well-established effect in speech production, cumulative semantic interference, an increase in naming latencies when naming a series of semantically related pictures. In a joint action setting, two task partners take turns naming pictures. Previous work in this setting has demonstrated that naming latencies increase not only with each semantically related picture speakers named themselves, but also with each picture named by the partner (Hoedemaker et al., 2017; Kuhlen & Abdel Rahman, 2017). This suggests that speakers pursue lexical access on behalf of their partner. In 2 electrophysiological experiments (N = 30 each) we investigated the neuro-cognitive signatures of such simulated lexical access. As expected, in both experiments speakers' naming latency increased with successive naming instances within a given semantic category. Correspondingly, speakers' electroencephalographic recordings (EEG) showed an increasing posterior positivity between 250-400 ms, an event-related potential (ERP) modulation typically associated with lexical access. However, unlike previous experiments, speakers were not influenced by their partner's picture naming. Accordingly, we found no electrophysiological evidence of lexical access. To reconcile these findings we pooled behavioral data from five experiments (N = 144). Within this large sample we find empirical evidence for partner-elicited interference. Furthermore, our data suggest that speakers may be less affected by their partner's naming response in settings with remotely located task partners (as in present experiments). We conclude that speakers do not always represent their partner's naming response and that our experimental setting may have limited the participants' evaluation of the task as a joint action. (PsycInfo Database Record (c) 2021 APA, all rights reserved).","authors":["Anna Katharina Kuhlen","Rasha Abdel Rahman"],"meta":["July 2021Journal of Experimental Psychology Learning Memory and Cognition 47(8)","DOI:10.1037/xlm0001025"],"references":["326214761_The_Closer_They_Are_the_More_They_Interfere_Semantic_Similarity_of_Word_Distractors_Increases_Competition_in_Language_Production","314262073_Brains_in_dialogue_Decoding_neural_preparation_of_speaking_to_a_conversational_partner","306551385_Neural_correlates_of_verbal_joint_action_ERPs_reveal_common_perception_and_action_systems_in_a_shared-Stroop_task","297895097_Distributional_Analysis_of_Semantic_Interference_in_Picture_Naming","335132076_Thirty_years_of_Speaking_An_introduction_to_the_Special_Issue","334843387_Mental_representations_of_partner_task_cause_interference_in_picture_naming","326360387_Planning_and_Coordination_of_Utterances_in_a_Joint_Naming_Task","317232220_Having_a_task_partner_affects_lexical_retrieval_Spoken_word_production_in_shared_task_settings","311003595_Language_production_in_a_shared_task_Cumulative_Semantic_Interference_from_self-_and_other-produced_context_words","305819764_Semantic_similarity_promotes_interference_in_the_continuous_naming_paradigm_behavioural_and_electrophysiological_evidence"]}