{"id":"353408534_On_deterministic_1-limited_5'_3'_sensing_Watson-Crick_finite-state_transducers","abstract":"Finite automata and finite state transducers belong to the bases of (theoretical) computer science with many applications. On the other hand, DNA computing and related bio-inspired paradigms are relatively new fields of computing. Watson–Crick automata are in the intersection of the above fields. These finite automata have two reading heads as they read the upper and lower strands of the input DNA molecule, respectively. In 5′ → 3′ Watson–Crick automata the two reading heads move in the same biochemical direction, that is, from the 5′ end of the strand to the direction of the 3′ end. However, in the double-stranded DNA, the DNA strands are directed in opposite way to each other, therefore 5′ → 3′ Watson–Crick automata read the input from the two extremes. In sensing 5′ → 3′ automata the automata sense if the two heads are at the same position, moreover, the computing process is finished at that time. Based on this class of automata, we define WK transducers such that, at each transition, exactly one input letter is being processed, and exactly one output letter is written on a normal output tape. Some special cases are defined and analyzed, e.g. , when only one of the reading heads is being used and when the transducer has only one state. We also show that the minimal transducer is uniquely defined if the transducer is deterministic and it has marked output, i.e. , the output letter written in a step identifies the reading head that is used in that transition. We have also used the functions ‘processing order’ and ‘reading heads’ to analyze these transducers.","authors":["Benedek Nagy","Zita Kovacs"],"meta":["January 2021RAIRO - Theoretical Informatics and Applications 55:5","DOI:10.1051/ita/2021007"],"references":["338416089_On_deterministic_sensing_5'rightarrow_3'5'3'_Watson-Crick_finite_automata_a_full_hierarchy_in_2detLIN","319219620_A_New_Sensing_5'-3'_Watson-Crick_Automata_Concept","345093794_A_Class_of_2-Head_Finite_Automata_for_Linear_Languages","342350847_5_'_3_'_Watson-Crick_Pushdown_Automata","340552916_Linear_automata_with_translucent_letters_and_linear_context-free_trace_languages","330285206_Two-Head_Finite-State_Acceptors_with_Translucent_Letters_45th_International_Conference_on_Current_Trends_in_Theory_and_Practice_of_Computer_Science_Novy_Smokovec_Slovakia_January_27-30_2019_Proceeding","325459102_Deterministic_Sensing_5'rightarrow_3'5'3'_Watson-Crick_Automata_Without_Sensing_Parameter","321613068_Handbook_of_Formal_Languages_Volume_1_Word_Language_Grammar","268889816_DNA_computing_New_computing_paradigms_Corr_2nd_printing","267678120_On_a_hierarchy_of_5_'_3_'_sensing_Watson-Crick_finite_automata_languages"]}