{"id":"353485986_Recent_developments_on_the_power_graph_of_finite_groups_-_a_survey","abstract":"Algebraic graph theory is the study of the interplay between algebraic structures (both abstract as well as linear structures) and graph theory. Many concepts of abstract algebra have facilitated through the construction of graphs which are used as tools in computer science. Conversely, graph theory has also helped to characterize certain algebraic properties of abstract algebraic structures. In this survey, we highlight the rich interplay between the two topics viz groups and power graphs from groups. In the last decade, extensive contribution has been made towards the investigation of power graphs. Our main motive is to provide a complete survey on the connectedness of power graphs and proper power graphs, the Laplacian and adjacency spectrum of power graph, isomorphism, and automorphism of power graphs, characterization of power graphs in terms of groups. Apart from the survey of results, this paper also contains some new material such as the contents of Section 2 (which describes the interesting case of the power graph of the Mathieu group M11) and Section 6.1 (where conditions are discussed for the reduced power graph to be not connected). We conclude this paper by presenting a set of open problems and conjectures on power graphs.","authors":["Ajay Kumar","Lavanya Selvaganesh","Peter J. Cameron","Thirugnanam Tamizh Chelvam"],"meta":["July 2021AKCE International Journal of Graphs and Combinatorics 18(2):1-30","DOI:10.1080/09728600.2021.1953359"],"references":["355058039_The_power_graph_of_a_torsion-free_group_of_nilpotency_class_2","352904216_Forbidden_Subgraphs_of_Power_Graphs","340324705_On_the_Connectivity_and_Independence_Number_of_Power_Graphs_of_Groups","355144644_The_power_graph_of_a_torsion-free_group_determines_the_directed_power_graph","344552466_Permutation_Groups","344472942_Representations_and_Characters_of_Groups","336977241_Erratum_Vertex_connectivity_of_the_power_graph_of_a_finite_cyclic_group_II","335490147_On_the_Minimum_Degree_of_the_Power_Graph_of_a_Finite_Cyclic_Group","335436955_A_combinatorial_characterization_of_finite_groups_of_prime_exponent","334071791_Hamiltonian_cycles_of_power_graph_of_abelian_groups"]}