{"id":"353464157_Optimal_distribution-preserving_downsampling_of_large_biomedical_data_sets_opdisDownsampling","abstract":"Motivation: The size of today's biomedical data sets pushes computer equipment to its limits, even for seemingly standard analysis tasks such as data projection or clustering. Reducing large biomedical data by downsampling is therefore a common early step in data processing, often performed as random uniform class-proportional downsampling. In this report, we hypothesized that this can be optimized to obtain samples that better reflect the entire data set than those obtained using the current standard method.\nResults: By repeating the random sampling and comparing the distribution of the drawn sample with the distribution of the original data, it was possible to establish a method for obtaining subsets of data that better reflect the entire data set than taking only the first randomly selected subsample, as is the current standard. Experiments on artificial and real biomedical data sets showed that the reconstruction of the remaining data from the original data set from the downsampled data improved significantly. This was observed with both principal component analysis and autoencoding neural networks. The fidelity was dependent on both the number of cases drawn from the original and the number of samples drawn.\nConclusions: Optimal distribution-preserving class-proportional downsampling yields data subsets that reflect the structure of the entire data better than those obtained with the standard method. By using distributional similarity as the only selection criterion, the proposed method does not in any way affect the results of a later planned analysis.\n\nAvailability: The “opdisDownsampling” R package is freely available at https://cran.r-project.org/package=opdisDownsampling.","authors":["Jörn Lötsch","Sebastian Malkusch","Alfred Ultsch"],"meta":["July 2021PLoS ONE 16(8)","DOI:10.1371/journal.pone.0255838","Project: Optimal distribution-preserving downsampling of large biomedical data sets (opdisDownsampling)"],"references":["337945662_Current_Projection_Methods-Induced_Biases_at_Subgroup_Detection_for_Machine-Learning_Based_Data-Analysis_of_Biomedical_Data","332225839_Ultrafast_clustering_of_single-cell_flow_cytometry_data_using_FlowGrid","283319567_Identification_of_Molecular_Fingerprints_in_Human_Heat_Pain_Thresholds_by_Use_of_an_Interactive_Mixture_Model_R_Toolbox_AdaptGauss","281671215_On_Wasserstein_Two_Sample_Testing_and_Related_Families_of_Nonparametric_Tests","318393770_R_A_Language_and_Environment_for_Statistical_Computing","313767487_The_varimax_criterion_for_analytic_rotation_in_factor_analysis","286231229_Artificial_neural_networks_for_earthquake_anomaly_detection","281345608_Ggplot2_Elegant_Graphics_for_Data_Analysis","243778356_Tests_concerning_random_points_on_a_circle","238706673_The_Irises_of_the_Gaspe_Peninsula"]}