{"id":"353548588_Machine_Learning_in_Chemical_Engineering_Strengths_Weaknesses_Opportunities_and_Threats","abstract":"Chemical engineers rely on models for design, research, and daily decision-making, often with potentially large financial and safety implications. Previous efforts a few decades ago to combine artificial intelligence and chemical engineering for modeling were unable to fulfill the expectations. In the last five years, the increasing availability of data and computational resources has led to a resurgence in machine learning-based research. Many recent efforts have facilitated the roll-out of machine learning techniques in the research field by developing large databases, benchmarks, and representations for chemical applications and new machine learning frameworks. Machine learning has significant advantages over traditional modeling techniques, including flexibility, accuracy, and execution speed. These strengths also come with weaknesses, such as the lack of interpretability of these black-box models. The greatest opportunities involve using machine learning in time-limited applications such as real-time optimization and planning that require high accuracy and that can build on models with a self-learning ability to recognize patterns, learn from data, and become more intelligent over time. The greatest threat in artificial intelligence research today is inappropriate use because most chemical engineers have had limited training in computer science and data analysis. Nevertheless, machine learning will definitely become a trustworthy element in the modeling toolbox of chemical engineers.","authors":["Maarten R. Dobbelaere","Pieter Plehiers","Ruben Van de Vijver","Christian V Stevens"],"meta":["July 2021Engineering 7(22–23)","DOI:10.1016/j.eng.2021.03.019"],"references":["350097666_Quantitative_interpretation_explains_machine_learning_models_for_chemical_reaction_prediction_and_uncovers_bias","349967699_Transfer_learning_for_solvation_free_energies_From_quantum_chemistry_to_experiments","344805688_Molecular_representations_in_AI-driven_drug_discovery_a_review_and_practical_guide","344407760_Transfer_learning_enables_the_molecular_transformer_to_predict_regio-_and_stereoselective_reactions_on_carbohydrates","343424917_Artificial_Intelligence_for_Computer-Aided_Synthesis_In_Flow_Analysis_and_Selection_of_Reaction_Components","343243687_Self-Referencing_Embedded_Strings_SELFIES_A_100_robust_molecular_string_representation","347326643_Solvent_Selection_for_Mitsunobu_Reaction_Driven_by_an_Active_Learning_Surrogate_Model","343874194_Real-Time_Optimization_using_Reinforcement_Learning","343801798_An_integrated_framework_for_plant_data-driven_process_modeling_using_deep-learning_with_Monte-Carlo_simulations","343706969_Iterative_experimental_design_based_on_active_machine_learning_reduces_the_experimental_burden_associated_with_reaction_screening"]}