{"id":"353615168_Application_of_HPC_and_Big_Data_in_Post-Pandemic_Times","abstract":"We lay out the ramifications of the 2020 pandemic for all people in geosciences, especially the young, and argue for significant changes on training and career development. We focus primarily on its devastating impact in U.S.A. and compare with that in other countries especially China. We review the potential effect for the next four years or so on the aspirations of an academic career versus more realistic career goals. We urge people in mid-career about the need to reassess previous goals. We stress the need for students or researchers to acquire technical skills in high-performance computing (HPC), data analytics, artificial intelligence, and/or visualization along with a broad set of technical skills in applied computer science and mathematics. We give advice about hot prospects in several areas that have great potential for advancement in the coming decade, such as visualization, deep learning, quantum computing and information, and cloud computing, all of which lie within the aegis of HPC. Our forecast is that the pandemic will significantly reshape the job landscape and career paths for both young and established researchers and we discuss bluntly the dire situation facing junior people in geosciences in the aftermath of the pandemic around the world until 2024.","authors":["Henry M. Tufo","David A. Yuen","Gabriele Morra","Matthew Knepley"],"meta":["August 2021","DOI:10.1016/j.eqrea.2021.100006."],"references":["340820771_Combining_Machine_Learning_and_Simulation_to_a_Hybrid_Modelling_Approach_Current_and_Future_Directions","339144342_Training_deep_quantum_neural_networks","328767865_The_30th_Anniversary_of_the_Supercomputing_Conference_Bringing_the_Future_Closer-Supercomputing_History_and_the_Immortality_of_Now","350817873_Biden_pursues_giant_boost_for_science_spending","350695450_Biden_Congress_roll_out_big_plans_to_expand_National_Science_Foundation","346883792_The_Cold_War_A_World_History","341938383_Tenure_and_promotion_after_the_pandemic","331946100_Machine_learning_for_data-driven_discovery_in_solid_Earth_geoscience","322377832_Inverse_Problems_in_Geodynamics_Using_Machine_Learning_Algorithms","259823367_Big_Data_A_Revolution_that_Will_Transform_how_We_Live_Work_and_Think","3344345_Parallel_interactive_visualization_of_3D_mantle_convection","243015010_On_the_Role_of_Applied_Mathematics"]}