{"id":"353698793_Design_choices_Mechanism_design_and_platform_capitalism","abstract":"Mechanism design is a form of optimization developed in economic theory. It casts economists as institutional engineers, choosing an outcome and then arranging a set of market rules and conditions to achieve it. The toolkit from mechanism design is widely used in economics, policymaking, and now in building and managing online environments. Mechanism design has become one of the most pervasive yet inconspicuous influences on the digital mediation of social life. Its optimizing schemes structure online advertising markets and other multi-sided platform businesses. Whatever normative rationales mechanism design might draw on in its economic origins, as its influence has grown and its applications have become more computational, we suggest those justifications for using mechanism design to orchestrate and optimize human interaction are losing traction. In this article, we ask what ideological work mechanism design is doing in economics, computer science, and its applications to the governance of digital platforms. Observing mechanism design in action in algorithmic environments, we argue it has become a tool for producing information domination, distributing social costs in ways that benefit designers, and controlling and coordinating participants in multi-sided platforms.","authors":["Salomé Viljoen","Jake Goldenfein","Lee McGuigan"],"meta":["July 2021Big Data & Society 8(2):205395172110343","DOI:10.1177/20539517211034312"],"references":["343793621_ADVANCED_INTRODUCTION_TO_PLATFORM_ECONOMICS","339403858_Dynamic_exploits_calculative_asymmetries_in_the_on-demand_economy_Dynamic_exploits","337992841_Manipulate_to_Empower_Hyper-relevance_and_the_contradictions_of_marketing_in_the_age_of_surveillance_capitalism","330233385_When_data_is_capital_Datafication_accumulation_and_extraction","346624964_The_Black_Box_Society_The_Secret_Algorithms_That_Control_Money_and_Information","343161659_Automated_Neoliberalism_The_Digital_Organisation_of_Markets_In_Technoscientific_Capitalism","335379641_Auction_Market_Design_Recent_Innovations","332893758_Automating_the_audience_commodity_The_unacknowledged_ancestry_of_programmatic_advertising","330143015_The_Knowledge_We_Have_Lost_in_Information_The_History_of_Information_in_Modern_Economics","330018748_Globalists_The_End_of_Empire_and_the_Birth_of_Neoliberalism"]}