{"id":"353639194_The_Emerging_Role_of_Long_Non-Coding_RNAs_and_MicroRNAs_in_Neurodegenerative_Diseases_A_Perspective_of_Machine_Learning","abstract":"Neurodegenerative diseases (NDs) are characterized by progressive neuronal dysfunction and death of brain cells population. As the early manifestations of NDs are similar, their symptoms are difficult to distinguish, making the timely detection and discrimination of each neurodegenerative disorder a priority. Several investigations have revealed the importance of microRNAs and long non-coding RNAs in neurodevelopment, brain function, maturation, and neuronal activity, as well as its dysregulation involved in many types of neurological diseases. Therefore, the expression pattern of these molecules in the different NDs have gained significant attention to improve the diagnostic and treatment at earlier stages. In this sense, we gather the different microRNAs and long non-coding RNAs that have been reported as dysregulated in each disorder. Since there are a vast number of non-coding RNAs altered in NDs, some sort of synthesis, filtering and organization method should be applied to extract the most relevant information. Hence, machine learning is considered as an important tool for this purpose since it can classify expression profiles of non-coding RNAs between healthy and sick people. Therefore, we deepen in this branch of computer science, its different methods, and its meaningful application in the diagnosis of NDs from the dysregulated non-coding RNAs. In addition, we demonstrate the relevance of machine learning in NDs from the description of different investigations that showed an accuracy between 85% to 95% in the detection of the disease with this tool. All of these denote that artificial intelligence could be an excellent alternative to help the clinical diagnosis and facilitate the identification diseases in early stages based on non-coding RNAs.","authors":["Ángela García-Fonseca","Cynthia Martin","George E. Barreto","Andrés Felipe Aristizábal-Pachón"],"meta":["July 2021Biomolecules 11(8):1132","DOI:10.3390/biom11081132"],"references":["342007033_LncRNA_ANRIL_acts_as_a_modular_scaffold_of_WDR5_and_HDAC3_complexes_and_promotes_alteration_of_the_vascular_smooth_muscle_cell_phenotype","339379629_The_process_of_Lewy_body_formation_rather_than_simply_a-synuclein_fibrillization_is_one_of_the_major_drivers_of_neurodegeneration","337737103_Machine_Learning_to_Detect_Alzheimer's_Disease_from_Circulating_Non-coding_RNAs","337242492_LncTarD_a_manually-curated_database_of_experimentally-supported_functional_lncRNA-target_regulations_in_human_diseases","336413932_An_application_of_machine_learning_with_feature_selection_to_improve_diagnosis_and_classification_of_neurodegenerative_disorders","344083251_Computational_Toxicology_Volume_II_Volume_II","339187852_Diagnosis_and_Treatment_of_Parkinson_Disease_A_Review","337930262_Dysregulated_Long_Non-coding_RNAs_in_Parkinson's_Disease_Contribute_to_the_Apoptosis_of_Human_Neuroblastoma_Cells","336496742_Identification_of_age-_and_gender-associated_long_noncoding_RNAs_in_the_human_brain_with_Alzheimer's_disease","335774764_What_Is_Machine_Learning_a_Primer_for_the_Epidemiologist"]}