{"id":"353640207_Data-science_driven_autonomous_process_optimization","abstract":"Autonomous process optimization involves the human intervention-free exploration of a range process parameters to improve responses such as product yield and selectivity. Utilizing off-the-shelf components, we develop a closed-loop system for carrying out parallel autonomous process optimization experiments in batch. Upon implementation of our system in the optimization of a stereoselective Suzuki-Miyaura coupling, we find that the definition of a set of meaningful, broad, and unbiased process parameters is the most critical aspect of successful optimization. Importantly, we discern that phosphine ligand, a categorical parameter, is vital to determination of the reaction outcome. To date, categorical parameter selection has relied on chemical intuition, potentially introducing bias into the experimental design. In seeking a systematic method for selecting a diverse set of phosphine ligands, we develop a strategy that leverages computed molecular feature clustering. The resulting optimization uncovers conditions to selectively access the desired product isomer in high yield. An automated closed-loop system optimizes a stereoselective Suzuki-Miyaura reaction using a machine learning algorithm that incorporates unbiased and categorical process parameters.","authors":["Melodie Christensen","Lars P E Yunker","Folarin Adedeji","Florian Häse"],"meta":["August 2021Communications Chemistry 4(1):112","DOI:10.1038/s42004-021-00550-x"],"references":["342790679_A_mobile_robotic_chemist","341361505_Self-driving_laboratory_for_accelerated_discovery_of_thin-film_materials","340786112_An_autonomous_chemical_robot_discovers_the_rules_of_supramolecular_chemistry_without_prior_knowledge","340782414_An_autonomous_chemical_robot_discovers_the_rules_of_supramolecular_chemistry_without_prior_knowledge","340701139_ChemOS_An_orchestration_software_to_democratize_autonomous_discovery","340573466_A_Bayesian_experimental_autonomous_researcher_for_mechanical_design","339219329_Beyond_Ternary_OPV_High-Throughput_Experimentation_and_Self-Driving_Laboratories_Optimize_Multicomponent_Systems","353280187_G_ryffin_An_algorithm_for_Bayesian_optimization_of_categorical_variables_informed_by_expert_knowledge","347308221_Direct_C-H_Arylation_of_Indole-3-Acetic_Acid_Derivatives_Enabled_by_an_Autonomous_Self-Optimizing_Flow_Reactor","345910239_Organische_Chemie"]}