{"id":"353639179_Experimental_Analysis_of_Kerf_Taper_Angle_in_Cutting_Process_of_Sugar_Palm_Fiber_Reinforced_Unsaturated_Polyester_Composites_with_Laser_Beam_and_Abrasive_Water_Jet_Cutting_Technologies","abstract":"In this research, the effect of processing input parameters on the kerf taper angle response of three various material thicknesses of sugar palm fiber reinforced unsaturated polyester composite was investigated as an output parameter from abrasive waterjet and laser beam cutting techniques. The main purpose of the study is to obtain data that includes the optimum input parameters in cutting the composite utilizing these two unconventional techniques to avoid some defects that arise when using traditional cutting methods for cutting the composites, and then make a comparison to determine which is the most appropriate technique regarding the kerf taper angle response that is desired to be reduced. In the laser beam cutting process, traverse speed, laser power, and assist gas pressure were selected as the variable input parameters to optimize the kerf taper angle. While the water pressure, traverse speed, and stand-off-distance were the input variable parameters in the case of waterjet cutting process, with fixing of all the other input parameters in both cutting techniques. The levels of the input parameters that provide the optimal response of the kerf taper angle were determined using Taguchi’s approach, and the significance of input parameters was determined by computing the max–min variance of the average of the signal to-noise ratio (S/N) for each parameter. The contribution of each input processing parameter to the effects on kerf taper angle was determined using analysis of variation (ANOVA). Compared with the results that were extrapolated in the previous studies, both processes achieved acceptable results in terms of the response of the kerf taper angle, noting that the average values produced from the laser cutting process are much lower than those resulting from the waterjet cutting process, which gives an advantage to the laser cutting technique.","authors":["Fathi Masoud","S. M. Sapuan","Mohd khairol anuar Mohd ariffin","Nukman Yusoff"],"meta":["July 2021Polymers 13(15):2543","DOI:10.3390/polym13152543"],"references":["349625875_Experimental_Analysis_of_Heat-Affected_Zone_HAZ_in_Laser_Cutting_of_Sugar_Palm_Fiber_Reinforced_Unsaturated_Polyester_Composites","346020913_Development_of_Laser_Drilling_Strategy_for_Thick_Carbon_Fibre_Reinforced_Polymer_Composites_CFRP","343902914_Tensile_Strength_and_Moisture_Absorption_of_Sugar_Palm-Polyvinyl_Butyral_Laminated_Composites","343218395_Challenges_on_machining_characteristics_of_natural_fiber-reinforced_composites_-_A_review","342204979_Cutting_Processes_of_Natural_Fiber-Reinforced_Polymer_Composites","346546758_Factors_affecting_hole_quality_during_drilling_of_natural_fiber-reinforced_composites_A_comprehensive_review","343564513_Recent_Advancements_of_Plant-Based_Natural_Fiber-Reinforced_Composites_and_Their_Applications","343060880_Genetic_Optimization_of_Machining_Parameters_Affecting_Thrust_Force_during_Drilling_of_Pineapple_Fiber_Composite_Plates_-_an_Experimental_Approach","342508284_Abrasive_waterjet_machining_of_fiber-reinforced_composites_a_state-of-the-art_review","341461297_Determination_of_Milling_Performance_of_Jute_and_Flax_Fiber_Reinforced_Composites"]}