{"id":"353697325_Fair_algorithms_for_selecting_citizens'_assemblies","abstract":"Globally, there has been a recent surge in ‘citizens’ assemblies’ ¹ , which are a form of civic participation in which a panel of randomly selected constituents contributes to questions of policy. The random process for selecting this panel should satisfy two properties. First, it must produce a panel that is representative of the population. Second, in the spirit of democratic equality, individuals would ideally be selected to serve on this panel with equal probability 2,3 . However, in practice these desiderata are in tension owing to differential participation rates across subpopulations 4,5 . Here we apply ideas from fair division to develop selection algorithms that satisfy the two desiderata simultaneously to the greatest possible extent: our selection algorithms choose representative panels while selecting individuals with probabilities as close to equal as mathematically possible, for many metrics of ‘closeness to equality’. Our implementation of one such algorithm has already been used to select more than 40 citizens’ assemblies around the world. As we demonstrate using data from ten citizens’ assemblies, adopting our algorithm over a benchmark representing the previous state of the art leads to substantially fairer selection probabilities. By contributing a fairer, more principled and deployable algorithm, our work puts the practice of sortition on firmer foundations. Moreover, our work establishes citizens’ assemblies as a domain in which insights from the field of fair division can lead to high-impact applications.","authors":["Bailey Flanigan","Paul Gölz","Anupam Gupta","Brett Hennig"],"meta":["August 2021Nature 596(7873)","DOI:10.1038/s41586-021-03788-6"],"references":["327353134_The_Role_and_the_Future_of_Deliberative_Mini-publics_A_Citizen_Perspective","307872626_Which_conception_of_political_equality_do_deliberative_mini-publics_promote","344906556_Fair_Division_From_Cake-Cutting_to_Dispute_Resolution","333941308_No_Stratification_Without_Representation","329668058_Practitioner's_Note","328467495_Leximin_Allocations_in_the_Real_World","327032790_Democracy_when_the_people_are_thinking_Revitalizing_our_politics_through_public_deliberation","323465754_Fair_Division_From_Cake-Cutting_to_Dispute_Resolution","312902885_Democratic_innovations_designing_institutions_for_citizen_participation","309544272_Course_Match_A_Large-Scale_Implementation_of_Approximate_Competitive_Equilibrium_from_Equal_Incomes_for_Combinatorial_Allocation"]}