{"id":"353609941_El_emprendimiento_universitario","abstract":"RESUMEN El presente trabajo tiene como objetivo caracterizar al emprendedor universitario, conocer cómo se desarrolla el emprendimiento universitario, cabe mencionar que el termino emprendimiento es la creatividad es decir actitudes y aptitudes que poseen el ser humano al crear productos o bienes con la finalidad de satisfacer una necesidad. Por ende, las universidades tienen como propósito desarrollar al máximo las capacidades y habilidades de cada uno de los estudiantes, para que se convierta en emprendedores, es decir tener el espíritu emprendedor. El estudio se centró en estudiantes universitarios. Específicamente, en los alumnos de las cuatro carreras (Contaduría Pública, Informática, Negocios Internacionales y Administración). Se analizó a aquellos alumnos próximos a culminar sus estudios universitarios, es decir, aquellos que habían completado la formación orientada al emprendimiento. Los 165 integrantes de la muestra fueron seleccionados a través del muestreo aleatorio simple. SUMMARY The present work aims to characterize the university entrepreneur, how university entrepreneurship develops, it is worth mentioning that the term entrepreneurship is creativity, that is, attitudes and skills that human beings possess when creating products or goods in order to satisfy a need. Therefore, the purpose of universities is to develop the capacities and abilities of each of the students to the maximum, so that they become entrepreneurs, that is, to have the entrepreneurial spirit. The study focused on college students. Specifically, in the students of the four careers (Public Accounting, Computer Science, International Business and Administration). Those students who were close to completing their university studies were analyzed, that is, those who completed entrepreneurship-oriented training. The 165 members of the sample were selected through simple random sampling.","authors":["Cristopher Macías"],"meta":["August 2021","Project: Emprendimiento."],"references":["290989688_Educacion_e_Intencion_Emprendedora_en_Estudiantes_Universitarios_Un_Caso_de_Estudio","354371762_La_comunicacion_como_factor_clave_en_el_espiritu_emprendedor_del_contexto_universitario"]}