{"id":"353792427_Learning_equilibria_in_symmetric_auction_games_using_artificial_neural_networks","abstract":"Auction theory is of central importance in the study of markets. Unfortunately, we do not know equilibrium bidding strategies for most auction games. For realistic markets with multiple items and value interdependencies, the Bayes Nash equilibria (BNEs) often turn out to be intractable systems of partial differential equations. Previous numerical techniques have relied either on calculating pointwise best responses in strategy space or iteratively solving restricted subgames. We present a learning method that represents strategies as neural networks and applies policy iteration on the basis of gradient dynamics in self-play to provably learn local equilibria. Our empirical results show that these approximated BNEs coincide with the global equilibria whenever available. The method follows the simultaneous gradient of the game and uses a smoothing technique to circumvent discontinuities in the ex post utility functions of auction games. Discontinuities arise at the bid value where an infinite small change would make the difference between winning and not winning. Convergence to local BNEs can be explained by the fact that bidders in most auction models are symmetric, which leads to potential games for which gradient dynamics converge. Auction games present an interesting challenge for multi-agent learning. Finding the Bayes Nash equilibria for optimum bidding strategies is intractable for numerical approaches. In a new, deep learning approach, strategies are represented as neural networks, and policy iteration based on gradient dynamics in self-play enables learning of local equilibria.","authors":["Martin Bichler","Maximilian Fichtl","Stefan Heidekrüger","Nils Kohring"],"meta":["August 2021Nature Machine Intelligence 3(8):1-9","DOI:10.1038/s42256-021-00365-4"],"references":["352017840_Evolution_Strategies_for_Approximate_Solution_of_Bayesian_Games","355339565_Computing_Bayes-Nash_Equilibria_in_Combinatorial_Auctions_with_Verification","352461594_The_complexity_of_constrained_min-max_optimization","348397376_Reflections_on_the_2020_Nobel_Memorial_Prize_Awarded_to_Paul_Milgrom_and_Robert_Wilson","342536035_Deep_Learning-Powered_Iterative_Combinatorial_Auctions","339341379_On_Gradient-Based_Learning_in_Continuous_Games","334407224_Superhuman_AI_for_multiplayer_poker","333982053_Differentiable_Game_Mechanics","331477508_A_Unified_Game-Theoretic_Approach_to_Multiagent_Reinforcement_Learning","329473176_A_general_reinforcement_learning_algorithm_that_masters_chess_shogi_and_Go_through_self-play","326326887_Handbook_of_spectrum_auction_design","325867167_Designing_Core-selecting_Payment_Rules_A_Computational_Search_Approach","325750776_Designing_Core-Selecting_Payment_Rules_A_Computational_Search_Approach","320796601_Training_GANs_with_Optimism","318830250_Computing_Bayes-Nash_Equilibria_in_Combinatorial_Auctions_with_Continuous_Value_and_Action_Spaces"]}