{"id":"353716803_Solving_Two-Person_Zero-Sum_Stochastic_Games_With_Incomplete_Information_Using_Learning_Automata_With_Artificial_Barriers","abstract":"Learning automata (LA) with artificially absorbing barriers was a completely new horizon of research in the 1980s (Oommen, 1986). These new machines yielded properties that were previously unknown. More recently, absorbing barriers have been introduced in continuous estimator algorithms so that the proofs could follow a martingale property, as opposed to monotonicity (Zhang et al., 2014), (Zhang et al., 2015). However, the applications of LA with artificial barriers are almost nonexistent. In that regard, this article is pioneering in that it provides effective and accurate solutions to an extremely complex application domain, namely that of solving two-person zero-sum stochastic games that are provided with incomplete information. LA have been previously used (Sastry et al., 1994) to design algorithms capable of converging to the game's Nash equilibrium under limited information. Those algorithms have focused on the case where the saddle point of the game exists in a pure strategy. However, the majority of the LA algorithms used for games are absorbing in the probability simplex space, and thus, they converge to an exclusive choice of a single action. These LA are thus unable to converge to other mixed Nash equilibria when the game possesses no saddle point for a pure strategy. The pioneering contribution of this article is that we propose an LA solution that is able to converge to an optimal mixed Nash equilibrium even though there may be no saddle point when a pure strategy is invoked. The scheme, being of the linear reward-inaction ( \n$L_{R-I}$ \n) paradigm, is in and of itself, absorbing. However, by incorporating artificial barriers, we prevent it from being \"stuck\" or getting absorbed in pure strategies. Unlike the linear reward-εpenalty ( \n$L_{R-ε P}$ \n) scheme proposed by Lakshmivarahan and Narendra almost four decades ago, our new scheme achieves the same goal with much less parameter tuning and in a more elegant manner. This article includes the nontrial proofs of the theoretical results characterizing our scheme and also contains experimental verification that confirms our theoretical findings.","authors":["Anis Yazidi","Daniel Silvestre","B John Oommen"],"meta":["August 2021IEEE Transactions on Neural Networks and Learning Systems PP(99)","DOI:10.1109/TNNLS.2021.3099095"],"references":["344056144_A_Rendezvous_Algorithm_for_Multi-agent_Systems_in_Disconnected_Network_Topologies","337503945_Desynchronization_for_Decentralized_Medium_Access_Control_based_on_Gauss-Seidel_Iterations","328675340_Positive_Zero-Sum_Stochastic_Games_with_Countable_State_and_Action_Spaces","327084092_A_PageRank_Algorithm_based_on_Asynchronous_Gauss-Seidel_Iterations","325276264_Broadcast_and_Gossip_Stochastic_Average_Consensus_Algorithms_in_Directed_Topologies","347207716_Continuous-time_zero-sum_stochastic_game_with_stopping_and_control","333937325_Performance_Recovery_of_Dynamic_Feedback-Linearization_Methods_for_Multivariable_Nonlinear_Systems","320293032_Output_Synchronization_and_L-Gain_Analysis_for_Network_Systems","304415918_Jamming_in_Underwater_Sensor_Networks_as_a_Bayesian_Zero-Sum_Game_with_Position_Uncertainty","300945605_Applications_of_Learning_Automata","291951798_The_design_of_absorbing_Bayesian_pursuit_algorithms_and_the_formal_analyses_of_their_e-optimality","281058761_A_Potential_Reduction_Algorithm_for_Two-Person_Zero-Sum_Mean_Payoff_Stochastic_Games","280015375_ABSORBING_AND_ERGODIC_DISCRETIZED_TWO-ACTION_LEARNING_AUTOMATA","271658234_A_formal_proof_of_the_e-optimality_of_absorbing_continuous_pursuit_algorithms_using_the_theory_of_regular_functions","271447605_A_Tauberian_Theorem_for_Nonexpansive_Operators_and_Applications_to_Zero-Sum_Stochastic_Games"]}