{"id":"353845360_Increasing_Genomic_Literacy_Through_National_Genomic_Projects","abstract":"Genomics is an advancing field of medicine, science, ethics, and legislation. Keeping up to date with this challenging discipline requires continuous education and exchange of knowledge between many target groups. Specific challenges in genomic education include tailoring complex topics to diverse audiences ranging from the general public and patients to highly educated professionals. National genomic projects face many of the same challenges and thus offer many opportunities to highlight common educational strategies for improving genomic literacy. We have reviewed 41 current national genomic projects and have identified 16 projects specifically describing their approach to genomic education. The following target groups were included in the educational efforts: the general public (nine projects), patients (six projects), and genomic professionals (16 projects), reflecting the general overall aims of the projects such as determining normal and pathological genomic variation, improving infrastructure, and facilitating personalized medicine. The national genomic projects aim to increase genomic literacy through supplementing existing national education in genomics as well as independent measures specifically tailored to each target group, such as training events, research collaboration, and online resources for healthcare professionals, patients, and patient organizations. This review provides the current state of educational activities within national genomic projects for different target groups and identifies good practices that could contribute to patient empowerment, public engagement, proficient healthcare professionals, and lend support to personalized medicine.","authors":["Ana Nyasha Zimani","Borut Peterlin","Anja Kovanda"],"meta":["August 2021Frontiers in Genetics 12:693253","DOI:10.3389/fgene.2021.693253"],"references":["350372780_How_to_design_a_national_genomic_project-a_systematic_review_of_active_projects","338809235_Genomics_Education_in_the_Era_of_Personal_Genomics_Academic_Professional_and_Public_Considerations","338663293_Education_and_information_needs_for_physicians_about_rare_diseases_in_Spain","337364083_Benefits_and_challenges_of_Big_Data_in_healthcare_an_overview_of_the_European_initiatives","334268644_Introduction_to_Genome_Biology_and_Diversity","333398014_Role_of_genomics_literacy_in_reducing_the_burden_of_common_genetic_diseases_in_Africa","347117366_Genetics-Related_Activities_in_Everyday_Practice_of_Family_Physicians_in_Slovenia","340975014_Introduction_The_Crucial_Role_of_Law_in_Supporting_Successful_Translation_of_Genomics_into_Clinical_Care","335941156_Ethical_legal_and_social_issues_ELSI_in_rare_diseases_a_landscape_analysis_from_funders","331849641_The_burden_of_rare_diseases"]}