{"id":"353807239_Visually_guided_preprocessing_of_bioanalytical_laboratory_data_using_an_interactive_R_notebook_pguIMP","abstract":"The evaluation of pharmacological data using machine learning requires high data quality. Therefore, preprocessing of data, i.e., cleaning of analytical laboratory errors, replacement of missing values or outliers, and adequate data transformations before actual data analysis are crucial. Since current tools available for this purpose often require programming skills, preprocessing tools with graphical user interfaces that can be used interactively are needed. In collaboration between data scientists and experts in bioanalytical diagnostics, a graphical software package for data preprocessing called pguIMP is proposed, which contains a fixed sequence of preprocessing steps to enable reproducible interactive data preprocessing. As an R-based package, it also allows direct integration into this data science environment without requiring any programming knowledge. The implementation of contemporary data processing methods, including machine learning-based imputation techniques, ensures the generation of corrected and cleaned bioanalytical data sets that preserve data structures such as clusters better than is possible with classical methods. This was evaluated on bioanalytical data sets from lipidomics and drug research, using k-nearest-neighbors based imputation followed by k-means and DBSCAN clustering. The R package provides a Shiny-based web interface designed to be easy to use for non-data analysis experts. It is demonstrated that the spectrum of methods provided is suitable as a standard pipeline for preprocessing bioanalytical data in biomedical research domains. The R package pguIMP is freely available at the comprehensive R archive network (https://cran.r-project.org/web/packages/pguIMP/index.html).","authors":["Sebastian Malkusch","Lisa Hahnefeld","Robert Gurke","Jörn Lötsch"],"meta":["August 2021CPT: Pharmacometrics and Systems Pharmacology 10(6)","DOI:10.1002/psp4.12704","Project: Reproducible cleaning of biomedical laboratory data using methods of visualization, error correction and transformation implemented as interactive R-notebooks"],"references":["353082406_A_Benchmark_for_Data_Imputation_Methods","350055841_Approaches_to_handling_missing_or_problematic_pharmacology_data_Pharmacokinetics","343922558_Ten_simple_rules_to_power_drug_discovery_with_data_science","342173696_Discovery_and_validation_of_biomarkers_to_aid_the_development_of_safe_and_effective_pain_therapeutics_challenges_and_opportunities","339680577_An_Introduction_to_Machine_Learning","337435367_Welcome_to_the_Tidyverse","336920948_dbscan_Fast_Density-Based_Clustering_with_R","330535382_A_Data_Science-Based_Analysis_Points_at_Distinct_Patterns_of_Lipid_Mediator_Plasma_Concentrations_in_Patients_With_Dementia","320306814_Data_visualizations_to_detect_systematic_errors_in_laboratory_assay_results","318408975_Implementation_of_Good_Laboratory_Practices_GLP_in_basic_scientific_research_Translating_the_concept_beyond_regulatory_compliance"]}