{"id":"353819036_A_Preliminary_Study_of_Difficulties_in_Learning_Java_Programming_for_Secondary_School","abstract":"Coding is being part of the curriculum study for Malaysian primary and secondary school since 2017. The introduction of Computer Science subject was to expose the young to digital technology and groom them to become digital makers. The programming field is very challenging especially to those who still triggering what programming is all about. One of the problems is students have difficulty in certain subtopics of programming. Coding to a specific task by using much complex algorithm is not an easy task as student needs to understand and know how to use it to solve a problem. For a beginner who does not have a background in a programming language, some might experience it hard to grasp the concept at the beginning of the learning process. This paper is to identify secondary school student's problems in the subject. Based on the study conducted using an online survey with 37 respondents, results indicated that they faced difficulties in various subtopics of programming from an easy to complex concept based on the scope of learning content they have learned. From the process of computational thinking techniques, algorithm concepts, declaring constant and variable, control structures, search and sorting approach, and several more, these subtopics of programming were hard for some of the respondents. The results showed the subtopic of function and procedure was difficult for most of the respondents, regardless kind of programming languages they learned.","authors":["Aslina Baharum","Ervin Moung","Ismassabah Ismail","Rozita Ismail"],"meta":["August 2020International Journal of Advanced Trends in Computer Science and Engineering 9(1.4):302 - 306","DOI:10.30534/ijatcse/2020/4591.42020"],"references":["338485655_Learn_Programming_Framework_for_Malaysian_Preschoolers","335190397_Information_Visualization_for_Food_Mobile_Application_Hangri_20","330853319_The_Impact_of_an_Augmented_Reality_Application_on_Learning_Motivation_of_Students","326479477_AUGMENTED_REALITY_FOR_TEACHING_AND_LEARNING-A_LITERATURE_REVIEW_ON_THEORETICAL_AND_EMPIRICAL_FOUNDATIONS","320800938_Learning_programming_from_Scratch","290018947_Decreasing_Failure_in_Programming_Subject_with_Augmented_Reality_Tool","259167615_An_Augmented_Reality_based_Mobile_Software_to_Support_Learning_Experiences_in_Computer_Science_Courses","325640179_Augmenting_Coding_Augmented_Reality_for_Learning_Programming","264724859_Validation_of_the_Instructional_Materials_Motivation_Survey_IMMS_in_a_self-directed_instructional_setting_aimed_at_working_with_technology"]}