{"id":"353888018_How_Artificial_Intelligence_Is_Changing_Cyber_Security_Landscape_and_Preventing_Cyber_Attacks_A_systematic_review","abstract":"The primary objective of this study is to assess the effect of artificial intelligence on the cybersecurity environment, particularly in the area of cyber-attack mitigation. The world is changing at a breakneck speed, and businesses that embrace technology have a bright future ahead of them [1]. Digitization has accelerated the pace of change in a variety of areas, including entertainment, new goods, and business [1]. The client receives what they want immediately since the service provider is armed with everything necessary to provide goods or services [1,2]. While the digital age offers many benefits and conveniences, it also has a few drawbacks. The danger of losing your private information is one of the most serious and damaging risks associated with it. Over the past decade, there have been many instances of identity theft, data breaches, and financial loss. Cyberattacks are often widespread, affecting people, government entities, and companies. Cybercriminals may now reach their targets from anywhere in the globe and at any time. The assault surface in contemporary business settings is enormous, and it is growing at a breakneck pace. This implies that evaluating and enhancing a business's cybersecurity posture requires more than human involvement [2,3]. Artificial intelligence is increasingly critical to information security since these technologies are capable of rapidly evaluating millions of data sets and identifying a broad range of cyber risks, ranging from malware attacks to suspicious behavior that may result in a phishing assault. This system is always evolving and improving, relying on previous and current events to identify new types of attacks that may occur today or tomorrow. In this paper, I will discuss the employment of artificial intelligence (AI) in cybersecurity (both positive and negative) in the business world.","authors":["Ishaq Azhar Mohammed"],"meta":["June 2016SSRN Electronic Journal 4(2):659-663"],"references":["237344283_Information_Security_and_Ethics_Concepts_Methodologies_Tools_and_Applications","316697879_Computer_and_Information_Security_Handbook","300766365_Artificial_Intelligence_and_Data_Mining","292641705_Countermeasures_against_DPA_attacks_on_FPGA_implementation_of_AES","282484390_Canada's_cyber_security_and_the_changing_threat_landscape","276255929_A_Cyber_Chase_in_Cyber_Space_How_International_Law_Must_Address_the_Threat_of_Cyber_Attacks_or_Suffer_the_Consequences","269488392_Model_of_preventing_URL_attacks_based_on_artificial_immunity","226793939_Artificial_intelligence_and_personal_identity","220547352_Semantic_linking_through_spaces_for_cyber-physical-socio_intelligence_A_methodology","200446668_Handbook_of_Information_Security"]}