{"id":"353887659_SYSTEMATIC_REVIEW_OF_IDENTITY_ACCESS_MANAGEMENT_IN_INFORMATION_SECURITY","abstract":"This paper is a systematic review of Identity Access Management (IAM) in information security. Identity and Access Administration (IAM) involves tools, procedures, and policies for the management of user identities and user access in an organization [1]. These users may be staff or consumers, but the objective of an IAM system is to establish a unique digital identity that can then be controlled, updated, and monitored throughout the 'access lifetime' of each user. While a person only has one digital identity, numerous accounts may be included in the identity and various access restrictions may be established by each account per resource and context. IAM needs to offer access to the appropriate resources (applications, databases, networks, etc.) in the proper context for each particular identity [1]. It showed that the IAM solution was not effectively implemented, it is an innovative field, and has attracted broader organizational interests. Data security, compliance, owing to the security breach, data loss incidents, has been investigated most. With your own (BOYD) security inside personal mobile technology, you have identified vulnerabilities and risks, vulnerability management, policies, and good practices that contribute to information security failures. It is the technology, people, and processes that should function consistently to create a safe information system. Keywords: Identity and access management, information technology, information security, identity management systems INTRODUCTION Identity and access management (IAM) security is an integral component of the overall IT security system that handles digital identities and user access inside an organization. IAM security comprises policies, procedures, and technology that minimize the risk of identity-related access in a company [2]. The ICT environment has developed a mixed approach for sector-specific access control. Web-based, remote access combined with applications distributed and hosted on the cloud on different networks. Companies are confronted with different administrative difficulties, data protection, increased operational burdens, monitoring problems, and regulatory compliance. For a company to maintain its competitive advantage, it must have effective internal controls in place. This is only feasible in organizations that have simplified their internal business procedures [2]. In the field of information security, identity management is generally seen as a potential for improving the operational process while also lowering costs, improving reporting capabilities, and ensuring regulatory compliance. However, in recent years, it has been shown that this is a notion that is misunderstood, complicated, and expensive [2]. An increase in the number of people engaging in threatening behavior in the online realm, especially those connected with identity theft, has also been seen. When it comes to economic decisions, identity theft has a major impact on people's choices. It also presents a substantial security concern to both businesses and individuals. Solution providers for identity management (IdM) help effectively improve the identity problems that result from the use of numerous different applications. They also support a methodology that encourages growth and security while lowering the costs related to managing clients, their identities, credentials, and attributes, among other things [3]. Identity theft is one of the most serious risks to data security across sectors, accounting for about 90% of all data breaches in the United States. Identity and access management (IAM) is expected to expand in the future in terms of the number of experts, identity access management technologies and software, as well as training and certification programs [3]. Listed below is all you need to know about this increasingly essential element of data security: The problem of having control over how individuals portray themselves on the internet is a technologically difficult one to solve. The maintenance of numerous and distinct copies of internet activities, login credentials, and profile information for each website is a need for web users.","authors":["Ishaq Azhar Mohammed"],"meta":["July 2017SSRN Electronic Journal 4(7):1-7"],"references":["306132141_Adaptive_identity_and_access_management-contextual_data_based_policies","335591703_Information_governance_information_security_and_access_within_a_UK_context","283173234_Systematic_Review_of_Identity_Access_Management_in_Information_Security","259542689_Efficient_identity-based_hierarchical_access_authentication_protocol_for_mobile_network","257546965_Security_review_The_past_year","257523532_Why_the_traditional_approach_to_information_security_is_no_longer_working","257523497_The_state_of_information_security","257523484_Security_at_the_data_level","251670236_Identity_and_Access_Management_The_second_wave","250690102_Business_and_technical_motivation_for_identity_management"]}