{"id":"353889380_Identity-based_Encryption_From_Identity_and_Access_Management_to_Enterprise_Privacy_Management","abstract":"The main purpose of this paper is to explore the concept of identity-based encryption which will focus on identity and access management to enterprise privacy. In today's society, data privacy is a very sensitive subject. Data may be stored or sent, encryption is a strong key component for the anonymity and protection of information [1]. It has two larger ranges: symmetric and asymmetric. Two keys for encrypting and decrypting are needed for asymmetric systems, whereas a single key for encryption and decryption is used in asymmetric systems. Identity-Based Encryption is a kind of asymmetric cryptography that is used to protect sensitive information. To simplify the certificate handling, the message is encrypted by arbitrary strings. The bulk of our communications are carried out online with the aid of amazing technological progress. This is why encryption is more essential than ever before. In today's world, we rely heavily on technological communications. For commercial and communication reasons, we transmit data, movies, images [1]. We communicate through internet services such as social networks and messaging applications. We're sending millions of emails, downloading lots of information. As a consequence, we place ourselves in a position of extreme vulnerability. If they take over our digital communications, hackers, malicious hackers or assailants may damage us. That is why we use a variety of cryptographic techniques to guarantee the security and integrity of our interactions [2]. Identity-Based Encryption is one of the most common types of encryption and provides comprehensive security for people and organizations. This article will examine in depth what identification-based encryption is and why many companies need it for security purposes.","authors":["Ishaq Azhar Mohammed"],"meta":["September 2017SSRN Electronic Journal 4(9):719-722"],"references":["293195967_Efficient_identity-based_signature_over_NTRU_lattice","278798303_Efficient_Identity-Based_Encryption_over_NTRU_Lattices","221631818_Improved_Anonymous_Timed-Release_Encryption","307632417_Identity_Based_Cryptosystems_and_Signature_Scheme_In_G_R_Blakley_and_David_Chaum_Eds","307087594_An_algorithm_for_NTRU_problems_and_cryptanalysis_of_the_GGH_multilinear_map_without_a_low-level_encoding_of_zero","306157719_Hierarchical_identity_based_encryption_with_constant_size_ciphertext","305472502_A_Subfield_Lattice_Attack_on_Overstretched_NTRU_Assumptions","225671744_Identity-Based_Encryption_from_the_Weil_Pairing","225129158_Multipurpose_Identity-Based_Signcryption","221591873_Trapdoors_for_hard_lattices_and_new_cryptographic_constructions"]}