{"id":"353969426_Dependency_Smells_in_JavaScript_Projects","abstract":"Dependency management in modern software development poses many challenges for developers who wish to stay up to date with the latest features and fixes whilst ensuring backwards compatibility. Project maintainers have opted for varied, and sometimes conflicting, approaches for maintaining their dependencies. Opting for unsuitable approaches can introduce bugs and vulnerabilities into the project, introduce breaking changes, cause extraneous installations, and reduce dependency understandability, making it harder for others to contribute effectively. In this paper, we empirically examine evidence of recurring dependency management issues (dependency smells). We look at the commit data for a dataset of 1,146 active JavaScript repositories to catalog, quantify and understand dependency smells. Through a series of surveys with practitioners, we identify and quantify seven dependency smells with varying degrees of popularity and investigate why they are introduced throughout project history. Our findings indicate that dependency smells are prevalent in JavaScript projects with two or more distinct smells appearing in 80% of the projects, but they generally infect a minority of a project's dependencies. Our observations show that the number of dependency smells tends to increase over time. Practitioners agree that dependency smells bring about many problems including security threats, bugs, dependency breakage, runtime errors, and other maintenance issues. These smells are generally introduced as developers react to dependency misbehaviour and the shortcomings of the npm ecosystem.","authors":["Abbas Javan","Diego Elias Costa","Rabe Abdalkareem","Emad Shihab"],"meta":["August 2021IEEE Transactions on Software Engineering PP(99)","DOI:10.1109/TSE.2021.3106247"],"references":["350399065_A_comprehensive_study_of_bloated_dependencies_in_the_Maven_ecosystem","331975857_Dependency_Versioning_in_the_Wild","320413333_An_Empirical_Comparison_of_Dependency_Network_Evolution_in_Seven_Software_Packaging_Ecosystems","318868791_Why_do_developers_use_trivial_packages_an_empirical_case_study_on_npm","346887646_Does_Infrastructure_as_Code_Adhere_to_Semantic_Versioning_An_Analysis_of_Ansible_Role_Evolution","335428832_The_Seven_Sins_Security_Smells_in_Infrastructure_as_Code_Scripts","333333382_What_Do_Package_Dependencies_Tell_Us_About_Semantic_Versioning","328910894_On_the_Evolution_of_Technical_Lag_in_the_npm_Package_Dependency_Network","324149429_On_the_impact_of_security_vulnerabilities_in_the_npm_package_dependency_network","320678894_Keep_me_Updated_An_Empirical_Study_of_Third-Party_Library_Updatability_on_Android"]}