{"id":"353925733_MPhil_Programs_in_IT_and_Computing_into_New_Heights_A_Case_Study_of_Srinivas_University_Karnataka","abstract":"Computing programs are internationally available at different levels and nomenclatures. The popular levels in this regard are Bachelors and Master’s Degree. Internationally the Bachelors programs are commonly available as BS and MS program. Though UK and its follower countries the level and nomenclature are also called and popular as BSc and MSc programs. Worldwide Computing and IT programs are available only in science platform (except few countries that offers Master of Engineering/ Technology program). As far as Research levels are concerned most common are PhD and M.Phil. Though, among these, PhD is most common. However, it is worthy to note that M.Phil. Program is not offered and not so much popular in some countries. M.Tech by Research is considered as another program of research level offered to the B.Tech. / BE degree holders and in some cases MSc degree holders. In India, M.Phil. and PhD are available in IT and Computing fields for the science candidates, though engineering post graduate in related fields may also join the program. M.Phil. program in India is offered only at universities. In recent past, the number of private universities has been significantly increased and thus many of them are offer M.Phil. And many of those private universities offer M.Phil.in the field of IT and Computing. The traditional M.Phil. Programs are concentrated on broad areas viz. Computer Science/ Applications. Though, a significant move was undertaken by the Srinivas University, Karnataka for offering M.Phil.in subfields of IT. The paper discusses in detail of M.Phil. Program available in India with a special focus on specialized M.Phil.in Cloud Computing, Big Data Analytics etc. Paper also tries to move into healthy educational policy related work for future potentialities.","authors":["P.K. Paul","Sreeramana Aithal","K. S. Shivraj"],"meta":["May 2018","DOI:10.51983/ajcst-2018.7.1.1839"],"references":["322138395_Computing_Allied_Engineering_Domain_in_India_with_reference_to_Private_Universities_A_Case_Study_of_Bachelors_Programs","249360041_India_in_the_knowledge_economy_-_An_electronic_paradigm","235287465_MPhil_and_PhD_library_and_information_science_research_in_Pakistan_An_evaluation","330162859_MCA_Information_Science_and_Management_The_Next_Generation_Interdisciplinary_specialization_for_Social_Business_Health_and_Mathematical_SciencesA_Step_for_promoting_Digital_Humanities","318727085_Globalisation_and_the_university_Myths_and_realities_in_an_unequal_world","284866579_Balanced_scorecards_in_managing_higher_education_institutions_An_Indian_perspective","272390085_Information_Science_A_Potential_interdisciplinary_field_with_Historical_Perspectives_and_Future_Potentials","267369946_Higher_Education_in_India_Structure_Statistics_and_Challenges","240542929_Transition_from_higher_education_as_a_public_good_to_higher_education_as_a_private_good_the_saga_of_Indian_experience","228294594_Getting_the_Numbers_Right_International_Engineering_Education_in_the_United_States_China_and_India","226085821_Financing_higher_education_in_India","225972339_The_dilemma_of_change_in_Indian_higher_education","44807123_Pharmacy_Education_in_India","43920243_Internationalization_of_Education_in_India_Emerging_Trends_and_Strategies","5238250_Changing_Educational_Inequalities_in_India_in_the_Context_of_Affirmative_Action"]}