{"id":"353964324_A_Kernel-Based_Indicator_for_MultiMany-Objective_Optimization","abstract":"How to evaluate Pareto front approximations generated by multi/many-objective optimizers is a critical issue in the field of multiobjective optimization. Currently, there exist two types of comprehensive quality indicators (i.e., volume-based and distance-based indicators). Distance-based indicators, such as Inverted Generational Distance (IGD), are usually computed by summing up the distance of each reference point to its nearest solution. Their high computational efficiency leads to their prevalence in many-objective optimization. However, in the existing distance-based indicators, the distributions of the solution sets are usually neglected, leading to their lacks of ability to well distinguish between different solution sets. This phenomenon may become even more severe in high-dimensional space. To address such an issue, a kernel-based indicator (KBI) is proposed as a comprehensive indicator. Different from other distance-based indicators, a kernel-based maximum mean discrepancy is adopted in KBI for directly measuring the difference that can characterize the convergence, spread and uniformity of two sets, i.e., the solution set and reference set, by embedding them in Reproducing Kernel Hilbert Space (RKHS). As a result, KBI not only reflects the distance between the solution set and the reference set, but also can reflect the distribution of the solution set itself. In addition, to maintain the desirable weak Pareto compliance property of KBI, a nondominated set reconstruction approach is also proposed to shift the original solution set. The detailed theoretical and experimental analysis of KBI is provided in this paper. The properties of KBI have also been analyzed by the optimal μ-distribution.","authors":["Xinye Cai","Yushun Xiao","Zhenhua Li","Qi Sun"],"meta":["August 2021IEEE transactions on neural networks / a publication of the IEEE Neural Networks Council PP(99):1-1","DOI:10.1109/TEVC.2021.3105565"],"references":["337371610_An_Analysis_of_the_Hypervolume_Sharpe-Ratio_Indicator","334388164_On_the_construction_of_pareto-compliant_quality_indicators","331853549_Quality_Evaluation_of_Solution_Sets_in_Multiobjective_Optimisation_A_Survey","327737049_A_pq-averaged_Hausdorff_distance_for_arbitrary_measurable_sets","319297360_A_Decomposition-Based_Many-Objective_Evolutionary_Algorithm_With_Two_Types_of_Adjustments_for_Direction_Vectors","303380956_Diversity_Assessment_in_Many-Objective_Optimization","338588294_An_Analysis_of_Quality_Indicators_Using_Approximated_Optimal_Distributions_in_a_Three-dimensional_Objective_Space","325304814_How_to_Specify_a_Reference_Point_in_Hypervolume_Calculation_for_Fair_Performance_Comparison","321634504_A_Diversity_Indicator_Based_on_Reference_Vectors_for_Many-Objective_Optimization","305685499_A_Correlation_Analysis_of_Set_Quality_Indicator_Values_in_Multiobjective_Optimization","302384745_A_Hilbert_Space_Embedding_for_Distributions","301986897_GD-MOEA_A_New_Multi-Objective_Evolutionary_Algorithm_Based_on_the_Generational_Distance_Indicator","300227930_A_Study_on_Performance_Evaluation_Ability_of_a_Modified_Inverted_Generational_Distance_Indicator","297911005_On_the_fast_hypervolume_calculation_method","290852708_Difficulties_in_specifying_reference_points_to_calculate_the_inverted_generational_distance_for_many-objective_optimization_problems"]}