{"id":"353976083_Robots_facilitate_human_language_production","abstract":"Despite recent developments in integrating autonomous and human-like robots into many aspects of everyday life, social interactions with robots are still a challenge. Here, we focus on a central tool for social interaction: verbal communication. We assess the extent to which humans co-represent (simulate and predict) a robot’s verbal actions. During a joint picture naming task, participants took turns in naming objects together with a social robot (Pepper, Softbank Robotics). Previous findings using this task with human partners revealed internal simulations on behalf of the partner down to the level of selecting words from the mental lexicon, reflected in partner-elicited inhibitory effects on subsequent naming. Here, with the robot, the partner-elicited inhibitory effects were not observed. Instead, naming was facilitated, as revealed by faster naming of word categories co-named with the robot. This facilitation suggests that robots, unlike humans, are not simulated down to the level of lexical selection. Instead, a robot’s speaking appears to be simulated at the initial level of language production where the meaning of the verbal message is generated, resulting in facilitated language production due to conceptual priming. We conclude that robots facilitate core conceptualization processes when humans transform thoughts to language during speaking.","authors":["Olga A. Wudarczyk","Murat Kirtay","Doris Pischedda","Verena Vanessa Hafner"],"meta":["August 2021Scientific Reports 11(1)","DOI:10.1038/s41598-021-95645-9","Project: Multimodal Interaction and Communication"],"references":["353413825_Joint_language_production_An_electrophysiological_investigation_of_simulated_lexical_access_on_behalf_of_a_task_partner","350812964_Editorial_Language_and_Robotics","348032955_Mind_Meets_Machine_Towards_a_Cognitive_Science_of_Human-Machine_Interactions","347683077_Do_we_predict_upcoming_speech_content_in_naturalistic_environments","345431678_Assessing_the_Attitude_Towards_Artificial_Intelligence_Introduction_of_a_Short_Measure_in_German_Chinese_and_English_Language","344624095_Assessing_the_Attitude_Towards_Artificial_Intelligence_Introduction_of_a_Short_Measure_in_German_Chinese_and_English_Language","344441772_Modeling_robot_co-representation_state-of-the-art_open_issues_and_predictive_learning_as_a_possible_framework","342231845_Perception_and_Evaluation_in_Human-Robot_Interaction_The_Human-Robot_Interaction_Evaluation_Scale_HRIES-A_Multicomponent_Approach_of_Anthropomorphism","341068525_Social_Cognition_in_the_Age_of_Human-Robot_Interaction","345392779_Speaking_From_Intention_to_Articulation"]}