{"id":"354003056_Quantum_tunneling_and_quantum_walks_as_algorithmic_resources_to_solve_hard_K-SAT_instances","abstract":"We present a new quantum heuristic algorithm aimed at finding satisfying assignments for hard K-SAT instances using a continuous time quantum walk that explicitly exploits the properties of quantum tunneling. Our algorithm uses a Hamiltonian HA(F) which is specifically constructed to solve a K-SAT instance F. The heuristic algorithm aims at iteratively reducing the Hamming distance between an evolving state |ψj⟩ and a state that represents a satisfying assignment for F. Each iteration consists on the evolution of |ψj⟩ (where j is the iteration number) under e-iHAt, a measurement that collapses the superposition, a check to see if the post-measurement state satisfies F and in the case it does not, an update to HA for the next iteration. Operator HA describes a continuous time quantum walk over a hypercube graph with potential barriers that makes an evolving state to scatter and mostly follow the shortest tunneling paths with the smaller potentials that lead to a state |s⟩ that represents a satisfying assignment for F. The potential barriers in the Hamiltonian HA are constructed through a process that does not require any previous knowledge on the satisfying assignments for the instance F. Due to the topology of HA each iteration is expected to reduce the Hamming distance between each post measurement state and a state |s⟩. If the state |s⟩ is not measured after n iterations (the number n of logical variables in the instance F being solved), the algorithm is restarted. Periodic measurements and quantum tunneling also give the possibility of getting out of local minima. Our numerical simulations show a success rate of 0.66 on measuring |s⟩ on the first run of the algorithm (i.e., without restarting after n iterations) on thousands of 3-SAT instances of 4, 6, and 10 variables with unique satisfying assignments.","authors":["Ernesto Campos","Salvador E. Venegas-Andraca","Marco Lanzagorta"],"meta":["August 2021Scientific Reports 11(1):16845","DOI:10.1038/s41598-021-95801-1"],"references":["343114344_Quantum_walks_The_mean_first_detected_transition_time","319463716_Quantum_search_with_hybrid_adiabatic-quantum_walk_algorithms_and_realistic_noise","310462145_Quantum_walks_The_first_detected_passage_time_problem","304268856_Modernizing_Quantum_Annealing_using_Local_Searches","345915784_Quantum_Theory_of_Tunneling","335901831_Quantum_Annealing_with_Longitudinal_Bias_Fields","335851959_Practical_designs_for_permutation-symmetric_problem_Hamiltonians_on_hypercubes","333501633_Efficient_quantum-based_security_protocols_for_information_sharing_and_data_protection_in_5G_networks","332111102_A_novel_image_steganography_technique_based_on_quantum_substitution_boxes","329763905_Computational_Speedups_Using_Small_Quantum_Devices"]}