{"id":"354058934_Exposing_safe_correlations_in_transactional_datasets","abstract":"A particularly challenging problem for data anonymization is dealing with transactional data. Most anonymization methods assume homogeneous, independent and identically distributed (i.i.d.) data; “flattening” transactional data to satisfy this model results in wide, sparse data that does not anonymize well with traditional techniques. While there have been some approaches for generalization-based anonymization, bucketization techniques (e.g., anatomy) pose new challenges. In particular, bucketization provides the opportunity to learn correlations between data items, but also a risk of identifying individuals because of dependencies inferred from such correlations. We present a method that balances these issues, retaining the ability to discover correlations in the data, while hiding dependencies that would enable correlations to be used to link specific values to individuals. We introduce a correlation anonymization constraint that ensures correlations do not allow data to be linked to a specific individual, and an elastic safe grouping algorithm that meets this constraint while preserving data correlations. We evaluate the utility loss on a transactional rental dataset.","authors":["Elie Chicha","Bechara AL Bouna","Kay Wünsche","Richard Chbeir"],"meta":["December 2021Service Oriented Computing and Applications 15(1):1-19","DOI:10.1007/s11761-021-00325-1"],"references":["342995585_VIP_Blowfish_Privacy_in_Communication_Graphs","329551161_Cloud-based_differentially_private_image_classification","314128323_A_framework_for_utility_enhanced_incomplete_microdata_anonymization","312076851_BangA_An_Efficient_and_Flexible_Generalization-Based_Algorithm_for_Privacy_Preserving_Data_Publication","349460700_A_User-Centric_Mechanism_for_Sequentially_Releasing_Graph_Datasets_under_Blowfish_Privacy","323716474_Bottom-up_sequential_anonymization_in_the_presence_of_adversary_knowledge","321067078_Cross-Bucket_Generalization_for_Information_and_Privacy_Preservation","309444608_Deep_Learning_with_Differential_Privacy","309363679_Anonymizing_1M_Microdata_with_High_Utility","308061191_The_Algorithmic_Foundations_of_Differential_Privacy"]}