{"id":"354003658_Evolutionary_Multi_and_Many-objective_Optimization_via_Clustering_for_Environmental_Selection","abstract":"Recently, multi and many-objective evolutionary algorithms (MOEAs) embedded with clustering techniques to enhance their environmental selection show promising performance for tackling multi and many-objective optimization problems (MOPs) with irregular Pareto fronts (PFs). However, the similarity metric used for clustering cannot reflect the diversity of solutions fairly when it is measured based on the direction distances of solutions to an ideal point. Consequently, it may mislead the environmental selection when solving MOPs with convex PFs. To alleviate this issue, this paper suggests an MOEA using clustering with a flexible similarity metric to run the environmental selection. In our approach, we first use a simple yet effective method to roughly predict the concavity or convexity of the target problem. Then, a flexible reference point is set to define the direction distances of solutions, which can properly measure the similarity between solutions and fairly show their diversity for solving MOPs with various PF shapes. After that, we use a hierarchical clustering method with this flexible similarity metric to run the environmental selection on all solutions, which will properly classify them into N clusters (N is the population size). Finally, in each cluster, one solution with the best convergence value will survive to compose the new population. When compared to twenty-seven competitive MOEAs in solving nineteen benchmark MOPs and sixteen real-world engineering MOPs with various PF shapes, the experimental results demonstrate that the proposed algorithm has significant advantages.","authors":["Songbai Liu","Junhao Zheng","Qiuzhen Lin","Kay Chen Tan"],"meta":["August 2021Information Sciences 578(7)","DOI:10.1016/j.ins.2021.08.054","Project: Evolutionary Multi and Many-Objective Optimization"],"references":["341173584_An_Adaptive_Clustering-based_Evolutionary_Algorithm_for_Many-objective_Optimization_Problems","332462689_Diversity_Assessment_of_Multi-Objective_Evolutionary_Algorithms_Performance_Metric_and_Benchmark_Problems","344048329_A_Problem-Specific_Non-dominated_Sorting_Genetic_Algorithm_for_Supervised_Feature_Selection","342273653_Incorporating_a_multiobjective_knowledge-based_energy_function_into_differential_evolution_for_protein_structure_prediction","341988772_An_Improved_MOEAD_Algorithm_with_an_Adaptive_Evolutionary_Strategy","341809469_Investigating_the_Properties_of_Indicators_and_an_Evolutionary_Many-Objective_Algorithm_Using_Promising_Regions","338638606_An_easy-to-use_real-world_multi-objective_optimization_problem_suite","337356182_Multi-objective_optimization_for_location-based_and_preferences-aware_recommendation","335833848_A_Many-Objective_Evolutionary_Algorithm_With_Two_Interacting_Processes_Cascade_Clustering_and_Reference_Point_Incremental_Learning","333171277_Balancing_Exploration_and_Exploitation_in_Multiobjective_Evolutionary_Optimization"]}