{"id":"354175806_A_Tutorial_on_Applications_of_Power_Watershed_Optimization_to_Image_Processing","abstract":"This tutorial review paper consolidates the existing applications of the power watershed (PW) optimization framework in the context of image processing. In the literature, it is known that PW framework when applied to some well-known graph-based image segmentation and filtering algorithms such as random walker, isoperimetric partitioning, ratio-cut clustering, multi-cut and shortest path filters yield faster yet consistent solutions. In this paper, the intuition behind the working of PW framework, i.e. exploitation of contrast invariance on image data is explained. The intuitions are illustrated with toy images and experiments on simulated astronomical images. This article is primarily aimed at researchers working on image segmentation and filtering problems in application areas such as astronomy where images typically have huge number of pixels. Classic graph-based cost minimization methods provide good results on images with small number of pixels but do not scale well for images with large number of pixels. The ideas from the article can be adapted to a large class of graph-based cost minimization methods to obtain scalable segmentation and filtering algorithms.","authors":["Sravan Danda","Aditya Challa","B. S Daya Sagar","Laurent Najman"],"meta":["September 2021The European Physical Journal Special Topics 230(5)","DOI:10.1140/epjs/s11734-021-00264-0"],"references":["342655271_Power_Spectral_Clustering","338353916_Path-Based_Analysis_for_Structure-Preserving_Image_Filtering","335649032_Profiling_cellular_diversity_in_sponges_informs_animal_cell_type_and_nervous_system_evolution","332649063_Revisiting_the_Isoperimetric_Graph_Partitioning_Problem","329464274_Some_Theoretical_Links_Between_Shortest_Path_Filters_and_Minimum_Spanning_Tree_Filters","347628024_CGO_Multiband_Astronomical_Source_Detection_With_Component-Graphs","346878827_Optimising_and_comparing_source-extraction_tools_using_objective_segmentation_quality_criteria","346777347_The_Semantic_Mutex_Watershed_for_Efficient_Bottom-Up_Semantic_Instance_Segmentation","339975424_The_Mutex_Watershed_and_its_Objective_Efficient_Parameter-Free_Graph_Partitioning","338512608_End-To-End_Learned_Random_Walker_for_Seeded_Image_Segmentation"]}