{"id":"354170503_Networked_partisanship_and_framing_A_socio-semantic_network_analysis_of_the_Italian_debate_on_migration","abstract":"The huge amount of data made available by the massive usage of social media has opened up the unprecedented possibility to carry out a data-driven study of political processes. While particular attention has been paid to phenomena like elite and mass polarization during online debates and echo-chambers formation, the interplay between online partisanship and framing practices, jointly sustaining adversarial dynamics, still remains overlooked. With the present paper, we carry out a socio-semantic analysis of the debate about migration policies observed on the Italian Twittersphere, across the period May-November 2019. As regards the social analysis, our methodology allows us to extract relevant information about the political orientation of the communities of users-hereby called partisan communities-without resorting upon any external information. Remarkably, our community detection technique is sensitive enough to clearly highlight the dynamics characterizing the relationship among different political forces. As regards the semantic analysis, our networks of hashtags display a mesoscale structure organized in a core-periphery fashion, across the entire observation period. Taken altogether, our results point at different, yet overlapping, trajectories of conflict played out using migration issues as a backdrop. A first line opposes communities discussing substantively of migration to communities approaching this issue just to fuel hostility against political opponents; within the second line, a mechanism of distancing between partisan communities reflects shifting political alliances within the governmental coalition. Ultimately, our results contribute to shed light on the complexity of the Italian political context characterized by multiple poles of partisan alignment.","authors":["Tommaso Radicioni","Tiziano Squartini","Elena Pavan","Fabio Saracco"],"meta":["August 2021PLoS ONE 16(8):e0256705","DOI:10.1371/journal.pone.0256705"],"references":["352721775_Analysing_Twitter_semantic_networks_the_case_of_2018_Italian_elections","344775981_Immigration_as_a_Divisive_Topic_Clusters_and_Content_Diffusion_in_the_Italian_Twitter_Debate","335153717_Extracting_significant_signal_of_news_consumption_from_social_networks_the_case_of_Twitter_in_Italian_political_elections","330223326_The_statistical_physics_of_real-world_networks","328694539_Striking_marching_tweeting_Studying_how_online_networks_change_together_with_movements","323962120_Social_Media_Political_Polarization_and_Political_Disinformation_A_Review_of_the_Scientific_Literature","342940424_Political_Polarization_on_the_Digital_Sphere_A_Cross-platform_Over-time_Analysis_of_Interactional_Positional_and_Affective_Polarization_on_Social_Media","340111264_HashtagActivism_Networks_of_Race_and_Gender_Justice","336566278_Context_matters_political_polarization_on_Twitter_from_a_comparative_perspective","334154880_Elites_Tweet_Characterizing_the_Twitter_Verified_User_Network"]}