{"id":"354206253_COVID-19_Detection_in_Chest_X-ray_Images_using_Deep_Boosted_Hybrid_Learning","abstract":"The new emerging COVID-19, declared a pandemic disease, has affected millions of human lives and caused a massive burden on healthcare centers. Therefore, a quick, accurate, and low-cost computer-based tool is required to timely detect and treat COVID-19 patients. In this work, two new deep learning frameworks: Deep Hybrid Learning (DHL) and Deep Boosted Hybrid Learning (DBHL), is proposed for effective COVID-19 detection in X-ray dataset. In the proposed DHL framework, the representation learning ability of the two developed COVID-RENet-1 & 2 models is exploited individually through a machine learning (ML) classifier. In COVID-RENet models, Region and Edge-based operations are carefully applied to learn region homogeneity and extract boundaries features. While in the case of the proposed DBHL framework, COVID-RENet-1 & 2 are fine-tuned using transfer learning on the chest X-rays. Furthermore, deep feature spaces are generated from the penultimate layers of the two models and then concatenated to get a single enriched boosted feature space. A conventional ML classifier exploits the enriched feature space to achieve better COVID-19 detection performance. The proposed COVID-19 detection frameworks are evaluated on radiologist’s authenticated chest X-ray data, and their performance is compared with the well-established CNNs. It is observed through experiments that the proposed DBHL framework, which merges the two-deep CNN feature spaces, yields good performance (accuracy: 98.53%, sensitivity: 0.99, F-score: 0.98, and precision: 0.98). Furthermore, a web-based interface is developed, which takes only 5-10s to detect COVID-19 in each unseen chest X-ray image. This web-predictor is expected to help early diagnosis, save precious lives, and thus positively impact society.","authors":["Saddam Hussain","Anabia Sohail","Asifullah Khan","Mehdi Hassan"],"meta":["August 2021Computers in Biology and Medicine 137(3):104816","DOI:10.1016/j.compbiomed.2021.104816"],"references":["353699568_Coronavirus_Disease_Analysis_using_Chest_X-ray_Images_and_a_Novel_Deep_Convolutional_Neural_Network","352059299_A_recent_survey_on_the_applications_of_genetic_programming_in_image_processing","351988501_Mitotic_Nuclei_Analysis_in_Breast_Cancer_Histopathology_Images_using_Deep_Ensemble_Classifier","351854816_COVID-FACT_A_Fully-Automated_Capsule_Network-Based_Framework_for_Identification_of_COVID-19_Cases_from_Chest_CT_Scans","351445526_Automatic_detection_of_coronavirus_disease_COVID-19_using_X-ray_images_and_deep_convolutional_neural_networks","350158416_A_multi-phase_deep_CNN_based_mitosis_detection_framework_for_breast_cancer_histopathological_images","350050764_Deep_Convolutional_Neural_Network_and_Emotional_Learning_based_Breast_Cancer_Detection_using_Digital_Mammography","349577188_A_deep_learning_algorithm_using_CT_images_to_screen_for_Corona_virus_disease_COVID-19","346521704_COVID-Net_a_tailored_deep_convolutional_neural_network_design_for_detection_of_COVID-19_cases_from_chest_X-ray_images","346746910_COVID-19_Pneumonia_A_Review_of_Typical_Ct_Findings_and_Differential_Diagnosis"]}