{"id":"354290873_Deep_learning_for_distinguishing_normal_versus_abnormal_chest_radiographs_and_generalization_to_two_unseen_diseases_tuberculosis_and_COVID-19","abstract":"Chest radiography (CXR) is the most widely-used thoracic clinical imaging modality and is crucial for guiding the management of cardiothoracic conditions. The detection of specific CXR findings has been the main focus of several artificial intelligence (AI) systems. However, the wide range of possible CXR abnormalities makes it impractical to detect every possible condition by building multiple separate systems, each of which detects one or more pre-specified conditions. In this work, we developed and evaluated an AI system to classify CXRs as normal or abnormal. For training and tuning the system, we used a de-identified dataset of 248,445 patients from a multi-city hospital network in India. To assess generalizability, we evaluated our system using 6 international datasets from India, China, and the United States. Of these datasets, 4 focused on diseases that the AI was not trained to detect: 2 datasets with tuberculosis and 2 datasets with coronavirus disease 2019. Our results suggest that the AI system trained using a large dataset containing a diverse array of CXR abnormalities generalizes to new patient populations and unseen diseases. In a simulated workflow where the AI system prioritized abnormal cases, the turnaround time for abnormal cases reduced by 7–28%. These results represent an important step towards evaluating whether AI can be safely used to flag cases in a general setting where previously unseen abnormalities exist. Lastly, to facilitate the continued development of AI models for CXR, we release our collected labels for the publicly available dataset.","authors":["Zaid Nabulsi","Andrew Sellergren","Shahar Jamshy","Charles Lau"],"meta":["September 2021Scientific Reports 11(1)","DOI:10.1038/s41598-021-93967-2"],"references":["345809161_Analyzing_inter-reader_variability_affecting_deep_ensemble_learning_for_COVID-19_detection_in_chest_radiographs","342856402_Machine_learning_for_COVID-19-asking_the_right_questions","341378245_Automated_abnormality_classification_of_chest_radiographs_using_deep_convolutional_neural_networks","339581314_Clinical_Characteristics_of_Coronavirus_Disease_2019_in_China","336908692_Key_challenges_for_delivering_clinical_impact_with_artificial_intelligence","336906206_Grad-CAM_Visual_Explanations_from_Deep_Networks_via_Gradient-Based_Localization","336732207_Deep_Learning_for_Chest_Radiograph_Diagnosis_in_the_Emergency_Department","341444386_Variation_in_False-Negative_Rate_of_Reverse_Transcriptase_Polymerase_Chain_Reaction-Based_SARS-CoV-2_Tests_by_Time_Since_Exposure","338284428_Assessing_Radiology_Research_on_Artificial_Intelligence_A_Brief_Guide_for_Authors_Reviewers_and_Readers-From_the_Radiology_Editorial_Board","337725332_Chest_Radiograph_Interpretation_with_Deep_Learning_Models_Assessment_with_Radiologist-adjudicated_Reference_Standards_and_Population-adjusted_Evaluation"]}