{"id":"354222850_Patients_with_neuromyelitis_optica_spectrum_disorder_NMOSD_are_associated_with_adverse_outcome_after_total_hip_arthroplasty_a_matched_case-control_study","abstract":"Background\nNeuromyelitis Optica Spectrum Disorders (NMOSD) are rare inflammatory diseases of the central nervous system that cause transverse myelitis and optic neuritis. Steroids are commonly administered in NMOSD patients. The use of steroids may lead to osteonecrosis, which makes some of the NMOSD patients candidate for total hip arthroplasty (THA). To date, the clinical outcome of THA in NMOSD patients have not been investigated.\n\nAim\nInvestigate the patient reported outcome measures (PROM), radiographic outcome and complication in NMOSD patients after THA, compared with that of non-NMOSD patients.\n\nMethods\nPatients from Jan. 2016 to October. 2020 were identified in our database. 12 NMOSD cases which met the inclusion criteria were matched to non-NMOSD cases in a ratio of 1:2 based on age, sex, Charlson Comorbidity Index (CCI) and surgical date. Relevant outcome were analyzed and compared between the two groups.\n\nResults\nThere was a significantly increased risk of dislocation in NMOSD patients. Post-operative HOOS score was similar between the two groups even though the pre-operative HOOS score is significantly higher in the non-NMOSD group. NMOSD patients had poor performance in EQ-5D and EQ-VAS. The cups were placed more anteverted in NMOSD cases ( P = 0.01).\n\nConclusion\nThere is a significantly increased risk of dislocation after THA in NMOSD patients. However, satisfactory improvement in functional outcome of the hip was achieved. Due to the natural process of NMOSD, rehabilitation and hip precaution should be patient-specific and time-specific.","authors":["Xi Chen","Wenwei Qian","Guixing Qiu","Xisheng Weng"],"meta":["December 2021Orphanet Journal of Rare Diseases 16(1)","DOI:10.1186/s13023-021-02005-x"],"references":["347817236_Epidemiological_Study_Based_on_China_Osteonecrosis_of_the_Femoral_Head_Database","322193716_Total_hip_arthroplasty_in_patients_with_neuromuscular_imbalance","317641848_Can_a_target_zone_safer_than_Lewinnek's_safe_zone_be_defined_to_prevent_instability_of_total_hip_arthroplasties_Case-control_study_of_56_dislocated_THA_and_93_matched_controls","306925315_Clinical_Features_of_Patients_with_Multiple_Sclerosis_and_Neuromyelitis_Optica_Spectrum_Disorders","341011140_Bone_health_in_neuromyelitis_optica_Bone_mineral_density_and_fractures","328054932_Inhospital_Complications_of_Patients_With_Neuromuscular_Disorders_Undergoing_Total_Joint_Arthroplasty","323631105_Prevention_of_Dislocation_After_Total_Hip_Arthroplasty","320927960_Survivorship_and_Outcomes_in_Patients_With_Multiple_Sclerosis_Undergoing_Total_Joint_Arthroplasty","319422087_Neuromyelitis_Optica","295243213_Validation_of_the_HOOS_JR_A_Short-form_Hip_Replacement_Survey"]}