{"id":"354272922_Identifying_Influential_Nodes_in_Complex_Networks_Based_on_Node_Itself_and_Neighbor_Layer_Information","abstract":"Identifying influential nodes in complex networks is of great significance for clearly understanding network structure and maintaining network stability. Researchers have proposed many classical methods to evaluate the propagation impact of nodes, but there is still some room for improvement in the identification accuracy. Degree centrality is widely used because of its simplicity and convenience, but it has certain limitations. We divide the nodes into neighbor layers according to the distance between the surrounding nodes and the measured node. Considering that the node’s neighbor layer information directly affects the identification result, we propose a new node influence identification method by combining degree centrality information about itself and neighbor layer nodes. This method first superimposes the degree centrality of the node itself with neighbor layer nodes to quantify the effect of neighbor nodes, and then takes the nearest neighborhood several times to characterize node influence. In order to evaluate the efficiency of the proposed method, the susceptible–infected–recovered (SIR) model was used to simulate the propagation process of nodes on multiple real networks. These networks are unweighted and undirected networks, and the adjacency matrix of these networks is symmetric. Comparing the calculation results of each method with the results obtained by SIR model, the experimental results show that the proposed method is more effective in determining the node influence than seven other identification methods.","authors":["Jingcheng Zhu","Lunwen Wang"],"meta":["August 2021Symmetry 13(9):1570","DOI:10.3390/sym13091570"],"references":["352040615_A_Novel_Functional_Network_Based_on_Three-way_Decision_for_Link_Prediction_in_Signed_Social_Networks","351219031_An_objective_method_to_evaluate_exemplar-based_inpainted_images_quality_using_Jaccard_index","344688122_The_problem_and_promise_of_scale_in_animal_social_multilayer_networks","342497080_Forecasting_COVID-19_epidemic_in_India_and_high_incidence_states_using_SIR_and_logistic_growth_models","351705237_Characterization_of_delay_propagation_in_the_air_traffic_network","346239613_GraphDTA_Predicting_drug-target_binding_affinity_with_graph_neural_networks","345493864_Formalising_and_Detecting_Community_Structures_in_Real_World_Complex_Networks","341682056_Influential_nodes_identification_in_complex_networks_based_on_global_and_local_information","339389257_Identifying_influential_spreaders_in_complex_networks_based_on_entropy_weight_method_and_gravity_law","338917916_Finding_influential_nodes_in_social_networks_based_on_neighborhood_correlation_coefficient"]}