{"id":"354214711_Building_a_Chinese_pan-genome_of_486_individuals","abstract":"Pan-genome sequence analysis of human population ancestry is critical for expanding and better defining human genome sequence diversity. However, the amount of genetic variation still missing from current human reference sequences is still unknown. Here, we used 486 deep-sequenced Han Chinese genomes to identify 276 Mbp of DNA sequences that, to our knowledge, are absent in the current human reference. We classified these sequences into individual-specific and common sequences, and propose that the common sequence size is uncapped with a growing population. The 46.646 Mbp common sequences obtained from the 486 individuals improved the accuracy of variant calling and mapping rate when added to the reference genome. We also analyzed the genomic positions of these common sequences and found that they came from genomic regions characterized by high mutation rate and low pathogenicity. Our study authenticates the Chinese pan-genome as representative of DNA sequences specific to the Han Chinese population missing from the GRCh38 reference genome and establishes the newly defined common sequences as candidates to supplement the current human reference. Qiuhui Li et al. report a pan-genome sequence study in Han Chinese genomes. They find 276 Mbp of DNA sequences (absent in the current human reference), and report that 46.646 Mbp common sequences improved the accuracy of variant calling and mapping rate when added to the reference genome.","authors":["Qiuhui Li","Shilin Tian","Bin Yan","Chi Man Liu"],"meta":["August 2021Communications Biology 4(1):1016","DOI:10.1038/s42003-021-02556-6"],"references":["349219994_Sequencing_of_53831_diverse_genomes_from_the_NHLBI_TOPMed_Program","336218718_An_open_resource_for_accurately_benchmarking_small_variant_and_reference_calls","334820263_HUPAN_a_pan-genome_analysis_pipeline_for_human_genomes","329042446_Assembly_of_a_pan-genome_from_deep_sequencing_of_910_humans_of_African_descent","328612240_CADD_predicting_the_deleteriousness_of_variants_throughout_the_human_genome","352180938_Sequencing_of_53831_diverse_genomes_from_the_NHLBI_TOPMed_Program","340371950_Association_of_Rare_PTGIS_Variants_With_Susceptibility_and_Pulmonary_Vascular_Response_in_Patients_With_Idiopathic_Pulmonary_Arterial_Hypertension","339103118_Pan-genomics_in_the_human_genome_era","333702965_Identifying_centromeric_satellites_with_dna-brnn","329858216_Germline_BMP9_mutation_causes_idiopathic_pulmonary_arterial_hypertension"]}