{"id":"354347340_Models_of_using_immersive_teaching_technologies_in_the_practical_activity_of_a_teacher_of_informatics","abstract":"Problem and goal. Virtual, augmented mixed reality and augmented virtuality are becoming integral attributes of the immersive educational environment, disposed to continuous learning and comprehensive development. The relevance of the study of models of using immersive technologies in the activities of a computer science teacher is beyond doubt, because they are the real embodiment of new methodological ideas and approaches. Methodology. In the course of the research, the analysis of models of immersive learning technologies for the practical activities of a computer science teacher was carried out. On its basis, a set of computer tools and equipment has been proposed that allows introducing immersive technologies into educational practice. Results. Methodological recommendations on the use of virtual, augmented and mixed reality technologies both in informatics lessons and after school hours are presented. The key topics of the computer science program, in which it is advisable to use immersive technologies, have been identified. Methodological approaches to the transformation of informatics teaching in the context of digitalization of education have been formulated. Conclusion. The results of the study indicate that immersive learning technologies can be successfully applied both in informatics lessons and outside the classroom. They not only contribute to the immersion of students in an interactive environment, but also increase the interest, motivation and quality of their knowledge. Lessons using immersive technologies open up new opportunities for a computer science teacher for professional growth, methodological and subject self-improvement.","authors":["Alexey I. Azevich"],"meta":["September 2021RUDN Journal of Informatization in Education 18(2):152-161","DOI:10.22363/2312-8631-2021-18-2-152-161"],"references":["339062996_Virtual_reality_educational_and_methodological_aspects","280573620_The_Real_in_Augmented_Reality","285610762_Investigation_of_Visual_Features_for_Augmented_Reality_Assembly_Assistance","277581129_Effectiveness_of_the_use_of_virtual_reality_for_youth_and_adult_education","266421508_ANALIZ_PERSPEKTIV_ISPOLZOVANIA_TEHNOLOGIJ_VIRTUALNOJ_REALNOSTI_V_DISTANCIONNOM_OBUCENII"]}