{"id":"354399505_Trouble_in_programmer's_paradise_gender_biases_in_sharing_and_recognising_technical_knowledge_on_Stack_Overflow","abstract":"This paper examines gender-biases on Stack Overflow, the world’s largest question-and-answer forum of programming knowledge. Employing a non-binary gender identification built on usernames, I investigate the role of gender in shaping users’ experience in technical forums. The analysis encompasses 11-years of activity, across levels of expertise, language, and specialism, to assess if Stack Overflow is really a paradise for programmers. I first examine individual users, asking if there are gender differences in key user metrics of success, focusing on reputation points, user tenure, and level of activity. Second, I test if there are gender-biases in how technical knowledge is recognised in the question-answer format of the platform. Third, using social network analysis I investigate if interaction on Stack Overflow is organised by gender. Results show that sharing and recognising technical knowledge is dictated by users’ gender, even when it is operationalised beyond a binary. I find that feminine users receive lower scores for their answers, despite exhibiting higher effort in their contributions. I also show that interaction on Stack Overflow is organised by gender. Specifically, that feminine users preferentially interact with other feminine users. The findings emphasise the central role of gender in shaping interaction in technical spaces, a necessity for participation in the masculine-dominated forum. I conclude the study with recommendations for inclusivity in online forums.","authors":["Sian Brooke"],"meta":["August 2021Information Communication and Society 24(14)","DOI:10.1080/1369118X.2021.1962943"],"references":["340843893_Coding_together_-_coding_alone_the_role_of_trust_in_collaborative_programming","330980336_Gender_differences_in_participation_and_reward_on_Stack_Overflow","321328007_From_usernames_to_profiles_the_development_of_pseudonymity_in_Internet_communication","319244743_Someone_Like_Me_How_Does_Peer_Parity_Influence_Participation_of_Women_on_Stack_Overflow","310821393_Paradise_unplugged_identifying_barriers_for_female_participation_on_stack_overflow","336216357_There_are_no_girls_on_the_Internet_Gender_performances_in_Advice_Animal_memes","335778801_Condescending_Rude_Assholes_Framing_gender_and_hostility_on_Stack_Overflow","316613425_Gender_differences_and_bias_in_open_source_Pull_request_acceptance_of_women_versus_men","312418360_Patients'_Responsibilities_in_Medical_Ethics","303413633_Recognizing_gender_of_stack_overflow_users"]}