{"id":"354346464_Facial_expressions_can_detect_Parkinson's_disease_preliminary_evidence_from_videos_collected_online","abstract":"A prevalent symptom of Parkinson’s disease (PD) is hypomimia — reduced facial expressions. In this paper, we present a method for diagnosing PD that utilizes the study of micro-expressions. We analyzed the facial action units (AU) from 1812 videos of 604 individuals (61 with PD and 543 without PD, with a mean age 63.9 y/o, sd. 7.8) collected online through a web-based tool ( www.parktest.net ). In these videos, participants were asked to make three facial expressions (a smiling, disgusted, and surprised face) followed by a neutral face. Using techniques from computer vision and machine learning, we objectively measured the variance of the facial muscle movements and used it to distinguish between individuals with and without PD. The prediction accuracy using the facial micro-expressions was comparable to methodologies that utilize motor symptoms. Logistic regression analysis revealed that participants with PD had less variance in AU6 (cheek raiser), AU12 (lip corner puller), and AU4 (brow lowerer) than non-PD individuals. An automated classifier using Support Vector Machine was trained on the variances and achieved 95.6% accuracy. Using facial expressions as a future digital biomarker for PD could be potentially transformative for patients in need of remote diagnoses due to physical separation (e.g., due to COVID) or immobility.","authors":["Mohammad Ali","Taylor L Myers","Ellen Wagner","Harshil Ratnu"],"meta":["December 2021npj Digital Medicine 4(1)","DOI:10.1038/s41746-021-00502-8"],"references":["348746102_Hypomimia_in_Parkinson's_Disease_What_Is_It_Telling_Us","333993214_The_PARK_Framework_for_Automated_Analysis_of_Parkinson's_Disease_Characteristics","329153956_Wearable_sensors_for_Parkinson's_disease_which_data_are_worth_collecting_for_training_symptom_detection_models","327295086_Face_Recognition_Using_Modified_OpenFace","320342016_Wearable_sensors_objectively_measure_gait_parameters_in_Parkinson's_disease","352878121_Parkinson's_disease_pathogenesis_and_clinical_aspects","325637658_OpenFace_20_Facial_Behavior_Analysis_Toolkit","319770515_Facial_Action_Coding_System_FACS_A_technique_for_the_measurement_of_facial_action","318580388_An_incremental_face_recognition_system_based_on_deep_learning","304114535_Safety_and_efficacy_of_pardoprunox_for_patients_with_Parkinson's_disease_A_meta-analysis"]}