{"id":"354321998_Modelisation_et_optimisation_avec_Scilab_de_l'extraction_de_polyphenols_de_Tridax_procumbens","abstract":"L'objectif de la présente étude est d'optimiser l'extraction des polyphénols dans la plante Tridax Procumbens. Il s'agissait de déterminer les facteurs influençant de manière pertinente les rendements d'extraction solide-liquide et liquide-liquide, et la concentration en polyphénols puis de trouver la combinaison optimale de ces facteurs qui pourra maximiser le rendement. Pour cela, la méthode de plan d'expériences selon Plackett et Burman a été utilisée. Celle-ci a permis d'identifier les facteurs significatifs que sont le nombre de siphonage, le rapport volume phase organique sur volume phase aqueuse et le rapport volume éthanol sur masse de broyat. Un code informatique a été écrit à l'aide du logiciel Scilab. Cela a permis de trouver les valeurs optimales pour chacun des facteurs ainsi que le résultat maximal. Il faut noter aussi que cette optimisation a été réalisée selon la méthode de l'algorithme génétique. Une validation des modèles obtenus est à envisager ainsi qu'une modélisation en plan factoriel complet pour regarder les effets des interactions entre les facteurs significatifs. Abstract Modelling and optimization with Scilab of the polyphenol extraction of Tridax procumbens The objective of this study is to optimize the extraction of polyphenols from the Tridax Procumbens plant. It was a question of determining the factors influencing in a relevant way the yields of solid-liquid and liquid-liquid extraction, and the concentration in polyphenols then to find the optimal combination of these factors which will be able to maximize the yield. For this, the experiment plan method according to Plackett and Burman was used. This made it possible to identify the significant factors such as the number of siphoning, the volume ratio of organic phase to volume of aqueous phase and the ratio of ethanol volume to mass of ground material. Computer code has been written using Scilab software. This made it possible to find the optimal values for each of the factors as well as the maximum result. It should also be noted that this optimization was carried out according to the method of the genetic algorithm. A validation of the models obtained is to be considered as well as a modelling in full factorial plan to look at the effects of the interactions between the significant factors.","authors":["Helena Awa Ehueny","Kouwelton Patrick Koné","Jean Claude N'guessan Yao","Esaie APPIAH Kouassi"],"meta":["August 2021Afrique Science Revue Internationale des Sciences et Technologie 19(2):173-188","Project: Study of metabolites profil of medicinal plant in Côte d'Ivoire"],"references":["331197722_Antihyperuricemia_Antioxidant_and_Antibacterial_Activities_of_Tridax_procumbens_L","322752789_A_Review_of_Medicinal_Uses_and_Pharmacological_Activities_of_Tridax_Procumbens_L","281319260_Phytochemical_screening_and_in_vitro_antimicrobial_activity_of_Tridax_procumbens_L","281032172_Phytochemical_Composition_of_Tridax_procumbens_Linn_Leaves_Potential_as_a_Functional_Food","273830916_Plant_Secondary_Metabolites_Occurrence_Structure_and_Role_in_the_Human_Diet","344718894_Modeling_of_polyphenols_extraction_from_pomegranate_by-product_using_rotatable_central_composite_design_of_experiments","312434689_Natural_products_secondary_metabolites_in_Biochemistry_and_molecular_biology_of_plants_eds_B_Buchanan_W_Gruissem_and_R_Jones","272324277_Effet_du_sechage_de_la_matiere_vegetale_sur_la_composition_chimique_de_l'huile_essentielle_et_l'activite_antioxydante_d'extraits_d'Ocimum_basilicum_L","271913967_Optimization_of_microwave_assisted_extraction_MAE_and_soxhlet_extraction_of_phenolic_compound_from_licorice_root","270968182_The_new_liquid-liquid_extraction_method_for_separation_of_phenolic_compounds_from_coal_tar","266371914_Total_phenolics_and_antioxidant_activity_of_Tridax_procumbens_Linn","244793862_A_comparative_study_on_the_antioxidant_activity_of_methanolic_leaf_extracts_of_Ficus_religiosa_L_Chromolaena_odorata_L_King_Rabinson_Cynodon_dactylon_L_Pers_and_Tridax_procumbens_L","265128868_Extraction_methods_for_the_determination_of_phenolic_compounds_from_Equisetum_arvense_L_herb","237789977_CONFIRMATION_IN_VITRO_DE_L'ACTIVITE_ANTIMALARIQUE_DE_CERTAINES_PLANTES_D'ORIGINE_AFRICAINE_UTILISEES_EN_MEDECINE_TRADITIONNELLE"]}