{"id":"354428785_Learning-by-Teaching_Approach_Improves_Dengue_Knowledge_in_Children_and_Parents","abstract":"There is narrow evidence on which strategies are most effective for disseminating information on dengue prevention. This is particularly relevant because social habits have a great prevention capacity for dengue. We investigated how effective are children as health educators, and how much they learn as they teach. We recruited 142 children and 97 parents in Argentina’s tropical area for two cluster randomized parallel trials. In Study 1, we compared the dynamics of dengue knowledge of 10-year-old children who—after receiving a dengue talk—1) listened to an unrelated topic; 2) read a booklet with information about dengue, 3) taught their parents about dengue, or 4) taught their parents about dengue, using the booklet. In Study 2, we assessed whether the parents’ dengue knowledge changed after interacting with their children, in comparison with parents learning about dengue from an expert or about an unrelated topic. Children that taught their parents what they learned, using a booklet, showed 2.53 more correct responses (95% CI [0.20, 4.85]; P = 0.027) than children who listened to an unrelated topic. This style of teaching also serves to effectively propagate knowledge: parents learned from their children the same as from an expert; and significantly more than parents who learned about an unrelated topic. Parents learned from their children even if they were taught with booklets (1.49, 95% CI [0.01, 2.96]; P = 0.048) or without (1.94, 95% CI [0.44, 3.44]; P = 0.006). Specifically, after being taught by their children, parents showed on average 1.49 (if they were taught with a booklet) and 1.94 (without booklet) more correct responses than parents that learned about an unrelated topic. The simple action of prompting children to teach consolidated their own knowledge and broadcasted it effectively to their parents. This strategy is a potential low to no-cost method for sharing information about dengue prevention.","authors":["Maria Julia Hermida","Agustin Perez Santangelo","Cecilia Calero","Carolina Goizueta"],"meta":["September 2021The American journal of tropical medicine and hygiene 105(6)","DOI:10.4269/ajtmh.21-0253"],"references":["341550061_Rethinking_the_role_of_the_school_after_COVID-19","340641537_COVID-19_health_literacy_is_an_underestimated_problem","340252305_School-based_health_education_for_dengue_control_in_Kelantan_Malaysia_Impact_on_knowledge_attitude_and_practice","338727843_An_investigation_into_the_knowledge_perceptions_and_role_of_personal_protective_technologies_in_Zika_prevention_in_Colombia","335452218_Social_interaction_and_conceptual_change_pave_the_way_away_from_children's_misconceptions_about_the_Earth","332900383_Children_can_foster_climate_change_concern_among_their_parents","323182290_Improving_Knowledge_on_The_Prevention_of_Dengue_Hemorrhagic_Fever_Among_Elementary_School_Students_in_Jakarta_Indonesia_A_Quasi_Experimental_Study","318236001_Cognitive_Mechanisms_Associated_with_Children's_Selective_Teaching","344324484_Schools_as_centers_for_health_educational_initiatives_health_behavior_research_and_risk_behavior_for_dengue_infection_in_school_children_and_community_members_a_systematic_review","334062672_The_Cultural_Origins_of_Human_Cognition"]}