{"id":"354593480_Fake_Media_Detection_Based_on_Natural_Language_Processing_and_Blockchain_Approaches","abstract":"Social media network is one of the important parts of human life based on the recent technologies and developments in terms of computer science area. This environment has become a famous platform for sharing information and news on any topics and daily reports, which is the main era for collecting data and data transmission. There are various advantages of this environment, but in another point of view there are lots of fake news and information that mislead the reader and user for the information needed. Lack of trust-able information and real news of social media information is one of the huge problems of this system. To overcome this problem, we have proposed an integrated system for various aspects of blockchain and natural language processing (NLP) to apply machine learning techniques to detect fake news and better predict fake user accounts and posts. The Reinforcement Learning technique is applied for this process. To improve this platform in terms of security, the decentralized blockchain framework applied, which provides the outline of digital contents authority proof. More specifically, the concept of this system is developing a secure platform to predict and identify fake news in social media networks.","authors":["Zeinab Shahbazi","Yungcheol Byun"],"meta":["September 2021IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2021.3112607"],"references":["350911784_Fake_Detect_A_Deep_Learning_Ensemble_Model_for_Fake_News_Detection","349368042_Deep_Learning_for_Fake_News_Detection_in_a_Pairwise_Textual_Input_Schema","349068292_Application_of_combined_model_of_stepwise_regression_analysis_and_artificial_neural_network_in_data_calibration_of_miniature_air_quality_detector","348580170_Identifying_Fake_News_on_Social_Networks_Based_on_Natural_Language_Processing_Trends_and_Challenges","347176108_Unreliable_Users_Detection_in_Social_Media_Deep_Learning_Techniques_for_Automatic_Detection","346375626_Two-Path_Deep_Semisupervised_Learning_for_Timely_Fake_News_Detection","345997025_Linguistic-Based_Detection_of_Fake_News_in_Social_Media","349429671_An_Improved_Blockchain_Consensus_Algorithm_Based_on_Raft","348730625_Deep_Learning_and_Natural_Language_Processing_for_fake_news_detection_A_Survey","346661603_A_Dynamic_Approach_for_Detecting_the_Fake_News_Using_Random_Forest_Classifier_and_NLP"]}