{"id":"354519522_Deep_generative_models_for_automated_muscle_segmentation_in_computed_tomography_scanning","abstract":"Accurate gluteus medius (GMd) volume evaluation may aid in the analysis of muscular atrophy states and help gain an improved understanding of patient recovery via rehabilitation. However, the segmentation of muscle regions in GMd images for cubic muscle volume assessment is time-consuming and labor-intensive. This study automated GMd-region segmentation from the computed tomography (CT) images of patients diagnosed with hip osteoarthritis using deep learning and evaluated the segmentation accuracy. To this end, 5250 augmented pairs of training data were obtained from five participants, and a conditional generative adversarial network was used to identify the relationships between the image pairs. Using the preserved test datasets, the results of automatic segmentation with the trained deep learning model were compared to those of manual segmentation in terms of the dice similarity coefficient (DSC), volume similarity (VS), and shape similarity (MS). As observed, the average DSC values for automatic and manual segmentations were 0.748 and 0.812, respectively, with a significant difference (p < 0.0001); the average VS values were 0.247 and 0.203, respectively, with no significant difference (p = 0.069); and the average MS values were 1.394 and 1.156, respectively, with no significant difference (p = 0.308). The GMd volumes obtained by automatic and manual segmentation were 246.2 cm ³ and 282.9 cm ³ , respectively. The noninferiority of the DSC obtained by automatic segmentation was verified against that obtained by manual segmentation. Accordingly, the proposed GAN-based automatic GMd-segmentation technique is confirmed to be noninferior to manual segmentation. Therefore, the findings of this research confirm that the proposed method not only reduces time and effort but also facilitates accurate assessment of the cubic muscle volume.","authors":["Daisuke Nishiyama","Hiroshi Iwasaki","Takaya Taniguchi","Daisuke Fukui"],"meta":["September 2021PLoS ONE 16(9):e0257371","DOI:10.1371/journal.pone.0257371"],"references":["332458932_Deep_Q_Learning_Driven_CT_Pancreas_Segmentation_with_Geometry-Aware_U-Net","328639092_Generative_models_an_upcoming_innovation_in_musculoskeletal_radiology_A_preliminary_test_in_spine_imaging","320966887_Image-to-Image_Translation_with_Conditional_Adversarial_Networks","317959445_Pixel-Level_Deep_Segmentation_Artificial_Intelligence_Quantifies_Muscle_on_Computed_Tomography_for_Body_Morphometric_Analysis","316574007_Validation_of_an_active_shape_model-based_semi-automated_segmentation_algorithm_for_the_analysis_of_thigh_muscle_and_adipose_tissue_cross-sectional_areas","313415407_Automation_of_reading_of_radiological_features_from_magnetic_resonance_images_MRIs_of_the_lumbar_spine_without_human_intervention_is_comparable_with_an_expert_radiologist","348284809_Automated_Segmentation_of_Abdominal_Skeletal_Muscle_in_Pediatric_CT_Scans_Using_Deep_Learning","335742035_Automated_Muscle_Segmentation_from_Clinical_CT_Using_Bayesian_U-Net_for_Personalized_Musculoskeletal_Modeling","324269088_Automated_muscle_segmentation_from_CT_images_of_the_hip_and_thigh_using_a_hierarchical_multi-atlas_method","318603352_SpineNet_Automated_Classification_and_Evidence_Visualization_in_Spinal_MRIs"]}