{"id":"354581398_The_assessment_cycle_Insights_from_a_systematic_literature_review_on_broadening_participation_in_engineering_and_computer_science","abstract":"Background\nIn the field of engineering education, assessment and evaluation have been given insufficient attention as they relate to broadening participation. We posit that this lack of attention negatively impacts our ability to develop and implement sustainable solutions at scale.\n\nPurpose\nThe purpose of this article is to explore the presence of an assessment cycle in the literature related to broadening participation in engineering. The assessment cycle refers to the process by which assessment/evaluation is planned, enacted, and used to improve educational processes.\n\nScope/Method\nThe scope of this study was influenced by it being situated in a larger study focused on broadening participation of Black Americans in engineering and computer science. We completed a literature map that illuminated a subset of literature broadly related to assessment/evaluation, and subsequently conducted a systematic literature review of 33 publications reporting on assessment/evaluation efforts. Our analysis of these efforts was grounded in a six-stage assessment cycle.\n\nResults\nThe results of this study highlight common publishing practices related to the assessment cycle in the context of broadening participation. We find that assessment/evaluation is generally published at the program level, focused on student development or academic success as a proxy for program effectiveness, and concentrated on positive claims.\n\nConclusion\nThere is room to significantly improve how assessment/evaluation information is published. By highlighting productive and unproductive publishing practices related to assessment/evaluation, this research has important implications for the use and publishing of assessment/evaluation, particularly as it relates to broadening participation in engineering.","authors":["Teirra Holloman","Walter C. Lee","Jeremi London","Chaneé D. Hawkins Ash"],"meta":["September 2021Journal of Engineering Education 110(4)","DOI:10.1002/jee.20425"],"references":["313551785_Understanding_reliability_and_validity_in_qualitative_research","345928599_Impacting_Students'_Interest_In_Stem_Fields_An_Electronic_Communication_Course_For_K_12_Underrepresented_Students","345924281_Eoe_First_Year_Interest_Groups_A_Success_Model_For_Increasing_Retention","344794867_Direct_and_Indirect_Assessment_of_Student_Perspectives_and_Performance_in_an_Online_Distance_Education_Chemical_Engineering_Bridging_Course","344551012_Academic_Achievement_And_Retention_In_A_Minority_Engineering_Program","340544855_A_Systematic_Mapping_of_Scholarship_on_Broadening_Participation_of_African_Americans_in_Engineering_Computer_Science","336610470_Navigating_equity_work_in_engineering_contradicting_messages_encountered_by_minority_faculty","333391636_An_Inconvenient_Truth_About_Progress_An_Analysis_of_the_Promises_and_Perils_of_Research_on_Campus_Diversity_Initiatives","324362377_Investigating_the_origins_of_STEM_intervention_programs_an_isomorphic_analysis","321813759_Reflections_on_the_messiness_of_initiating_a_systematic_literature_review_on_broadening_participation_in_engineering_and_computer_science"]}