{"id":"354621010_An_Efficient_Partition-Based_Approach_to_Identify_and_Scatter_Multiple_Relevant_Spreaders_in_Complex_Networks","abstract":"One of the main problems in graph analysis is the correct identification of relevant nodes for spreading processes. Spreaders are crucial for accelerating/hindering information diffusion, increasing product exposure, controlling diseases, rumors, and more. Correct identification of spreaders in graph analysis is a relevant task to optimally use the network structure and ensure a more efficient flow of information. Additionally, network topology has proven to play a relevant role in the spreading processes. In this sense, more of the existing methods based on local, global, or hybrid centrality measures only select relevant nodes based on their ranking values, but they do not intentionally focus on their distribution on the graph. In this paper, we propose a simple yet effective method that takes advantage of the underlying graph topology to guarantee that the selected nodes are not only relevant but also well-scattered. Our proposal also suggests how to define the number of spreaders to select. The approach is composed of two phases: first, graph partitioning; and second, identification and distribution of relevant nodes. We have tested our approach by applying the SIR spreading model over nine real complex networks. The experimental results showed more influential and scattered values for the set of relevant nodes identified by our approach than several reference algorithms, including degree, closeness, Betweenness, VoteRank, HybridRank, and IKS. The results further showed an improvement in the propagation influence value when combining our distribution strategy with classical metrics, such as degree, outperforming computationally more complex strategies. Moreover, our proposal shows a good computational complexity and can be applied to large-scale networks.","authors":["Jedidiah Yanez-Sierra","Arturo Díaz-Pérez","Victor J. Sosa-Sosa"],"meta":["September 2021Entropy 23(9):1216","DOI:10.3390/e23091216"],"references":["353114603_Graph-aware_evolutionary_algorithms_for_influence_maximization","339144842_Ranking_the_invasions_of_cheaters_in_structured_populations","339111989_Identifying_influential_spreaders_in_complex_networks_based_on_improved_k-shell_method","336740742_Systematic_comparison_between_methods_for_the_detection_of_influential_spreaders_in_complex_networks","333065541_Identification_of_influential_invaders_in_evolutionary_populations","326921253_Identification_of_influential_spreaders_in_complex_networks_using_HybridRank_algorithm","322857785_Spreading_Information_in_Complex_Networks_An_Overview_and_Some_Modified_Methods","314944120_Influence_Maximization_in_Social_Networks_with_Genetic_Algorithms","331041982_Identifying_influential_spreaders_based_on_indirect_spreading_in_neighborhood","313414448_A_novel_weight_neighborhood_centrality_algorithm_for_identifying_influential_spreaders_in_complex_networks"]}