{"id":"354673560_Bilateral_Asymmetry_Guided_Counterfactual_Generating_Network_for_Mammogram_Classification","abstract":"Mammogram benign or malignant classification with only image-level labels is challenging due to the absence of lesion annotations. Motivated by the symmetric prior that the lesions on one side of breasts rarely appear in the corresponding areas on the other side, we explore to answer a counterfactual question to identify the lesion areas. This counterfactual question means: given an image with lesions, how would the features have behaved if there were no lesions in the image? To answer this question, we derive a new theoretical result based on the symmetric prior. Specifically, by building a causal model that entails such a prior for bilateral images, we identify to optimize the distances in distribution between i) the counterfactual features and the target side’s features in lesion-free areas; and ii) the counterfactual features and the reference side’s features in lesion areas. To realize these optimizations for better benign/malignant classification, we propose a counterfactual generative network, which is mainly composed of Generator Adversarial Network and a prediction feedback mechanism, they are optimized jointly and prompt each other. Specifically, the former can further improve the classification performance by generating counterfactual features to calculate lesion areas. On the other hand, the latter helps counterfactual generation by the supervision of classification loss. The utility of our method and the effectiveness of each module in our model can be verified by state-of-the-art performance on INBreast and an in-house dataset and ablation studies.","authors":["Chu-ran Wang","Jing Li","Fandong Zhang","Xinwei Sun"],"meta":["September 2021IEEE Transactions on Image Processing PP(99):1-1","DOI:10.1109/TIP.2021.3112053"],"references":["339555784_Learning_Fixed_Points_in_Generative_Adversarial_Networks_From_Image-to-Image_Translation_to_Disease_Detection_and_Localization","336339974_Deep_Neural_Networks_Improve_Radiologists'_Performance_in_Breast_Cancer_Screening","331058911_Digital_Mammography_in_Breast_Cancer_Additive_Value_of_Radiomics_of_Breast_Parenchyma","329715894_An_explainable_deep-learning_algorithm_for_the_detection_of_acute_intracranial_haemorrhage_from_small_datasets","322060135_Unpaired_Image-to-Image_Translation_Using_Cycle-Consistent_Adversarial_Networks","340104666_From_Unilateral_to_Bilateral_Learning_Detecting_Mammogram_Masses_with_Contrasted_Bilateral_Network","339558373_Mask-ShadowGAN_Learning_to_Remove_Shadows_From_Unpaired_Data","338513261_Attention_Branch_Network_Learning_of_Attention_Mechanism_for_Visual_Explanation","327575904_Conditional_Infilling_GANs_for_Data_Augmentation_in_Mammogram_Classification_Third_International_Workshop_RAMBO_2018_Fourth_International_Workshop_BIA_2018_and_First_International_Workshop_TIA_2018_He","322060368_Arbitrary_Style_Transfer_in_Real-Time_with_Adaptive_Instance_Normalization"]}