{"id":"354697188_Key_factors_affecting_people's_unwillingness_to_be_confined_during_the_COVID-19_pandemic_in_Spain_a_large-scale_population_study","abstract":"Population confinements have been one of the most widely adopted non-pharmaceutical interventions (NPIs) implemented by governments across the globe to help contain the spread of the SARS-CoV-2 virus. While confinement measures have been proven to be effective to reduce the number of infections, they entail significant economic and social costs. Thus, different policy makers and social groups have exhibited varying levels of acceptance of this type of measures. In this context, understanding the factors that determine the willingness of individuals to be confined during a pandemic is of paramount importance, particularly, to policy and decision-makers. In this paper, we study the factors that influence the unwillingness to be confined during the COVID-19 pandemic by the means of a large-scale, online population survey deployed in Spain. We perform two types of analyses (logistic regression and automatic pattern discovery) and consider socio-demographic, economic and psychological factors, together with the 14-day cumulative incidence per 100,000 inhabitants. Our analysis of 109,515 answers to the survey covers data spanning over a 5-month time period to shed light on the impact of the passage of time. We find evidence of pandemic fatigue as the percentage of those who report an unwillingness to be in confinement increases over time; we identify significant gender differences, with women being generally less likely than men to be able to sustain long-term confinement of at least 6 months; we uncover that the psychological impact was the most important factor to determine the willingness to be in confinement at the beginning of the pandemic, to be replaced by the economic impact as the most important variable towards the end of our period of study. Our results highlight the need to design gender and age specific public policies, to implement psychological and economic support programs and to address the evident pandemic fatigue as the success of potential future confinements will depend on the population’s willingness to comply with them.","authors":["Marina Martinez-Garcia","A. Rabasa","Xavier Barber","Kristina Polotskaya"],"meta":["September 2021Scientific Reports 11(1):18626","DOI:10.1038/s41598-021-97645-1"],"references":["350922161_A_Swaying_Between_Successive_Pandemic_Waves_and_Pandemic_Fatigue_Where_Does_Jordan_Stand","350380810_COVIDiSTRESS_Global_Survey_dataset_on_psychological_and_behavioural_consequences_of_the_COVID-19_outbreak","350336376_Mask_use_risk-mitigation_behaviours_and_pandemic_fatigue_during_the_COVID-19_pandemic_in_five_cities_in_Australia_the_UK_and_USA_A_cross-sectional_survey","348758128_COVID-19_pandemic_response_fatigue_in_Africa_causes_consequences_and_counter-measures","348693999_The_impact_of_quarantine_on_mental_health_status_among_general_population_in_China_during_the_COVID-19_pandemic","348585809_Pandemic_fatigue_How_adherence_to_covid-19_regulations_has_been_misrepresented_and_why_it_matters","348394815_Adaptive_behavioural_coping_strategies_as_reaction_to_COVID-19_social_distancing_in_Italy","348186371_COVIDiSTRESS_Global_Survey_dataset_on_psychological_and_behavioural_consequences_of_the_COVID-19_outbreak","349059064_A_Worldwide_Assessment_of_COVID-19_Pandemic-Policy_Fatigue","349002764_Social-distancing_fatigue_during_the_COVID-19_pandemic_a_mediation_analysis_of_cognitive_flexibility_fatigue_depression_and_adherence_to_CDC_guidelines"]}