{"id":"354660157_Gamified_Learning_Theory_The_Moderating_role_of_learners'_learning_tendencies","abstract":"The Gamified Learning Theory implies that gamification does not affect learning directly but stimulates a learning-related behavior in a mediating or moderating process. A learner-related behavior can, to some extent, be predicted based on the way learners tend to perceive, understand and utilize information. These different ways of learning are known as learning tendencies. This study investigates the moderator role of learning tendencies on gamification success concerning learners' academic participation, engagement, and experience. For this, Felder-Silverman Learning Style Model is used for the identification of learners' tendencies. In our study, 69 Computer Science students were randomly assigned to one control and two treatment groups. Students in the treatment groups were assigned two different gamified courses, while the control group attended a non-gamified course. This allowed us to analyze the individual effect of each gamification design and compare and see which gamification design was more appropriate for a learner with particular tendencies. Our results indicate that gamification design positively contributes to academic participation, affects learners' engagement in gamified environments, and that students' learning tendencies moderated students' engagement.","authors":["Nadja Zaric","René Röpke","Vlatko Lukarov","Ulrik Schroeder"],"meta":["September 2021International Journal of Serious Games 8(3):71-91","DOI:10.17083/ijsg.v8i3.438"],"references":["348136699_A_Fundamental_Study_for_Gamification_Design_Exploring_Learning_Tendencies'_Effects","347513842_ACTIVE_STUDENT_ENGAGEMENT_IN_ONLINE_STEM_CLASSES_APPROACHES_AND_RECOMMENDATIONS","344166698_Supporting_Gamification_with_an_Interactive_Gamification_Analytics_Tool_IGAT","340272407_Investigating_the_Relationship_between_Player_Types_and_Learning_Styles_in_Gamification_Design","334611687_Dynamic_Personalization_of_Gameful_Interactive_Systems","334480974_ILSA_-_AN_INTEGRATED_LEARNING_STYLES_ANALYTICS_SYSTEM","331398668_Gameful_Experience_Questionnaire_GAMEFULQUEST_an_instrument_for_measuring_the_perceived_gamefulness_of_system_use","348239279_Unexplored_Gamification_Elements_in_Learning_Environments","343883082_Towards_a_Taxonomy_of_Instruments_for_Facilitated_Design_and_Evaluation_of_Video_Games_for_Education","331824292_Adaptive_gamification_in_e-learning_based_on_students'_learning_styles"]}