{"id":"354797850_Assessing_Competencies_Using_Scenario-Based_Learning_in_Cybersecurity","abstract":"Recent years have seen a disconnect between much-needed real-world skills and knowledge imparted to cybersecurity graduates by higher education institutions. As employers are shifting their focus to skills and competencies when hiring fresh graduates, higher education institutions are facing a call to action to design curricula that impart relevant knowledge, skills, and competencies to their graduates, and to devise effective means to assess them. Some institutions have successfully engaged with industry partners in creating apprenticeship programs and work-based learning for their students. However, not all educational institutions have similar capabilities and resources. A trend in engineering, computer science, and information technology programs across the United States is to design project-based or scenario-based curricula that impart relevant knowledge, skills, and competencies. At our institution, we have taken an innovative approach in designing our cybersecurity courses using scenario-based learning and assessing knowledge, skills, and competencies using scenario-guiding questions. We have used the National Initiative for Cybersecurity Education (NICE) Cybersecurity Workforce Framework and the Office of Personnel Management (OPM) Hiring Cybersecurity Workforce report for skills, knowledge, and competency mapping. This paper highlights our approach, presenting its overall design and two example mappings.","authors":["Tirthankar Ghosh","Guillermo Francia"],"meta":["September 2021","DOI:10.3390/jcp1040027"],"references":["341869743_The_Design_Development_and_Evaluation_of_a_Novel_Computer-based_Competency_Assessment_of_Computational_Thinking","328103225_Applying_Competency-Based_Learning_Methodologies_to_Cybersecurity_Education_and_Training_Creating_a_Job-Ready_Cybersecurity_Workforce","327915370_Applying_Competency-Based_Learning_Methodologies_to_Cybersecurity_Education_and_Training_Creating_a_Job-Ready_Cybersecurity_Workforce","337723727_A_model_and_a_method_for_assessing_students'_competencies_in_e-learning_system","335672468_A_Framework_for_Competence_Development_and_Assessment_in_Hybrid_Cybersecurity_Exercises","335590640_Data_Science_Competency_in_Organisations_A_Systematic_Review_and_Unified_Model","329017534_Evaluation_model_of_student_competencies_for_discussion_forums_An_application_in_a_post-graduate_course_in_production_engineering","262330505_Competency_map_visualizing_student_learning_to_promote_student_success","229780381_Scenario-based_E-learning_design","224758019_Scalable_personalized_learning"]}