{"id":"354726859_Usage_of_Hedonic_Web_Instruments","abstract":"The World Wide Web offers unprecedented opportunities for companies to appeal to both cognitive and hedonic customers. While other media require a trade-off between informative and entertaining content, the Internet makes it possible to combine various multimedia tools in order to create a holistic online experience. Consequently, companies combine utilitarian and hedonic elements in order to improve the overall effectiveness and efficiency of their websites. In this exploratory research we present the results of a longitudinal study, analyzing the usage of four different communication instruments (wallpapers/screensavers, e-cards, sweepstakes, online games) on corporate websites. Additionally, we differentiate between sites offering high and low involvement products. In order to visualize our results and to illustrate which combinations of instruments turn out to be the most popular, we use log-linear models. Our results indicate that companies have reduced the usage of hedonic instruments over time while simultaneously particular combinations have become quite successful.","authors":["Horst Treiblmaier"],"meta":["January 2009","Conference: Annual Workshop on HCI Research in MISAt: Phoenix, Arizona","Project: Gamification"],"references":["329258632_Marketing_in_Hypermedia_Computer-Mediated_Environments_Conceptual_Foundations","325671474_Core_Affect_and_the_Psychological_Construction_of_Emotion","312984568_Perceived_usefulness_perceived_ease_and_user_acceptance_of_information_technology","287554731_The_acceptance_of_women-centric_websites","284814272_The_epistemic_and_sensory_exploratory_behaviors_of_hedonic_and_cognitive_consumers","284760517_The_human-computer_interaction_handbook_Fundamentals_evolving_technologies_and_emerging_applications_archive","283425587_Web_advertising_Gender_differences_in_beliefs_attitudes_and_behavior","279704496_Cyberspace_Advertising_vs_Other_Media_Consumer_vs_Mature_Student_Attitudes","274045134_A_General_Model_for_the_Analysis_of_Surveys","262165287_The_paradigm_of_Viral_Communication"]}