{"id":"354780744_Artificial_Corona-Inspired_Optimization_Algorithm_Theoretical_Foundations_Analysis_and_Applications_American_Journal_of_Artificial_Intelligence","abstract":"Abstract: One of the important parts of computer science is Artificial Intelligence (AI). It deals with the development of machines that can take decisions like humans on their own. Currently, AI can solve many difficult real-world problems because it works much better and faster than humans. Researchers of operations research also are turning their heads towards AI instead of traditional systems. Meanwhile, there are several AI models to solve mathematical optimization problems. They depend heavily on a random search, but many of their solutions have been efficient at finding absolute optimum. This means that it is necessary to choose another optimization model to get quite the optimum value. This paper introduces an artificially intelligent algorithm in order to find the optimal solution for a given computational problem that minimizes or maximizes a particular function. It is inspired by the corona virus that spreads throughout the world and infects healthy people. Its structure simulates the stages of virus transmission and treatment. Because the starting point is so important for converging to the global optimum, \ncorona virus approach has guided researchers to select the starting point and parameters. Actually, this point depends on three real numbers as the corona virus affects three main parts of the human body (nose, throat, respiratory). The proposed algorithm has been found to be an optimal key to different applications. It doesn't require any derivative information and it is simple in implementation with few parameters setting. Finally, some numerical examples are presented to illustrate the algorithm studied here. The computational results show that it has high performance in finding an optimal solution within reasonable time.","authors":["Alia Youssef Gebreel"],"meta":["September 2021","DOI:10.11648/j.ajai.20210502.12"],"references":["344353926_COVID-19_image_classification_using_deep_features_and_fractional-order_marine_predators_algorithm","342834705_The_Pathogenesis_of_Coronavirus_Disease_2019_COVID-19_Evaluation_and_Prevention","339900041_A_Review_of_Coronavirus_Disease-2019_COVID-19","339672627_Optimization_Method_for_Forecasting_Confirmed_Cases_of_COVID-19_in_China","317083799_Linear_and_Nonlinear_Programming","263587732_Heuristic_Search_Methods_A_Review","228667645_Examining_the_performance_of_six_heuristic_optimisation_techniques_in_different_forest_planning_problems","267430930_Convex_optimization_theory","265449930_Linear_Programming_and_Network_Flows","228716815_Tutorial_Modern_Heuristic_Optimization_Techniques_with_Applications_to_Power_Systems","220444674_An_Improved_Harmony_Search_Algorithm_with_Differential_Mutation_Operator","222507324_Applications_of_Modern_Heuristic_Search_Methods_to_Pattern_Sequencing_Problems","222326920_Novel_derivative_of_harmony_search_algorithm_for_discrete_design_variables_Environmental_Planning_and_Management_Program","222247493_Design_optimization_of_shell_and_tube_heat_exchangers_using_global_sensitivity_analysis_and_harmony_search_algorithm","221274708_Hill_Climbing_Algorithms_and_Trivium"]}