{"id":"354866279_Redefining_the_MDA_Framework-The_Pursuit_of_a_Game_Design_Ontology","abstract":"In computer science, an ontology is a way of showing the properties of a subject area and how they are related by defining a set of concepts and categories that represent the subject. There have been many attempts to create a widely accepted ontology for the universe of games. Most of these attempts are defined based on an analytical perspective: few have found frequent use outside universities, as they are not easily translated to the development of games, which is a design perspective. There are some core aspects of the domain that turn this task into a difficult goal to achieve. In addition, game designers tend to refuse a methodology or a structured way of developing a game; the main concern is that it can impair creativity in a field that could not survive without it. A defined ontology would improve and mature the growing industry of digital games, both by enhancing the understanding of the domain and by supporting a structured methodology for designing games. This paper describes the properties of digital games and shows how they make it difficult to create an ontology for that field of study, especially when it comes to a design perspective. It clarifies the closest approach to a unified ontology that there is for the game domain: the mechanics, dynamics and aesthetics framework (MDA). We propose the redefinition of MDA’s taxonomy, calling it Redefining the MDA (RMDA), providing better use for the approach from a designer’s perspective, embracing the design properties of the domain, and overcoming issues found in the literature of the game domain. The main purpose of this paper is to clarify the MDA framework by redefining its main components, mechanics, dynamics and aesthetics, as a way to make the tool more understandable and useful for game designers. Understanding aesthetics and how developers can invoke them by correctly defining mechanics and creating dynamics is the main focus of the paper. Thus, some examples are provided in order to explain the applicability of the RMDA as a methodology to produce games.","authors":["Rogério Junior","Frutuoso G. M. Silva"],"meta":["September 2021Information (Switzerland) 12(10):395","DOI:10.3390/info12100395"],"references":["350107813_Towards_an_Iterative_Design_for_Serious_Games","338152242_Practical_Methodology_for_the_Design_of_Educational_Serious_Games","333208622_An_adaptation_and_personalisation_methodology_for_Serious_Games_design","324991602_Digital_Game_Elements_User_Experience_and_Learning_A_Conceptual_Framework","321425524_Approaches_for_Serious_Game_Design_A_Systematic_Literature_Review","320251364_Designing_educational_games_Key_elements_and_methodological_approach","320166605_Gamification_of_a_Project_Management_System","315854140_Design_Dynamics_Experience_DDE_An_Advancement_of_the_MDA_Framework_for_Game_Design","308841960_A_Model-driven_Framework_for_Educational_Game_Design","276164832_An_activity_theory-based_model_for_serious_games_analysis_and_conceptual_design","275594541_A_New_Methodology_of_Design_and_Development_of_Serious_Games","275541571_Gamification_Patterns_for_Gamification_Applications","275059704_Is_it_all_a_game_Understanding_the_principles_of_gamification","262370367_The_Six_Facets_of_Serious_Game_Design_A_Methodology_Enhanced_by_Our_Design_Pattern_Library","273946596_Defining_Game_Mechanics"]}