{"id":"354838970_PLUS_-_An_Academic_Mentorship_Guide_for_Undergraduate_Studies_A_Preliminary_Study","abstract":"This paper introduces an approach to academic mentorship, named PLUS, that specifically assist students in their academic performance through personalised guidance. Through the guidance of a mentor, PLUS lets mentees evaluate their strength and weakness before setting their target to achieve for each subject. Based on this preliminary study with 23 computer science undergraduate students by measuring their academic performance using the cumulative grade point average (CGPA), students that are not introduced to PLUS tend to perform inconsistently throughout their undergraduate studies compared to those introduced to PLUS. Weaker students (CPGA <2.8) with face-to-face guidance with a mentor using the PLUS approach displayed constant improvement compared to those who did not have any mentor. Regardless of what stage of their undergraduate studies the students are introduced to PLUS, all the students that applied PLUS showed consistent improvement and agreed that the method is valid. PLUS, personalised guidance helps the mentor connect with the mentee better, a good complement to the digital education lacking in human connection. It warrants further investigation beyond this preliminary study.","authors":["Tan ping Ping"],"meta":["September 2021Journal of Cognitive Sciences and Human Development 7(2):121-130","DOI:10.33736/jcshd.3675.2021"],"references":["299508522_Mentoring_Matters_Racial_Ethnic_Minority_Undergraduates'_Cultural_Fit_Mentorship_and_College_and_Life_Satisfaction","273389730_Self-regulation_of_time_management_Mental_contrasting_with_implementation_intentions","333055748_Interventions_for_undergraduate_and_postgraduate_medical_learners_with_academic_difficulties_A_BEME_systematic_review_BEME_Guide_No_56","326792631_On_Being_a_Mentor_A_Guide_for_Higher_Education_Faculty","284988397_Moving_learners_toward_independence_The_power_of_scaffolded_instruction","269462270_A_Review_of_Undergraduate_Mentoring_Programs","261660522_The_Role_of_Dialogue_in_Providing_Scaffolded_Instruction","249797757_Mentoring_and_Undergraduate_Academic_Success_A_Literature_Review","237299519_Caring_for_the_whole_person_Guidelines_for_advancing_undergraduate_mentorship","233254473_Grade_Expectations_Informed_or_Uninformed_Optimism_or_Both","221414136_Toward_Measuring_and_Maintaining_the_Zone_of_Proximal_Development_in_Adaptive_Instructional_Systems"]}