{"id":"354869100_Who's_making_the_decisions_How_managers_can_harness_artificial_intelligence_and_remain_in_charge","abstract":"/Purpose:\nWhile it is evident that the introduction of machine learning and the availability of big data have revolutionized various organizational operations and processes, existing academic and practitioner research within decision process literature has mostly ignored the nuances of these influences on human decision-making. Building on existing research in this area, this paper aims to define these concepts from a decision-making perspective and elaborates on the influences of these emerging technologies on human analytical and intuitive decision-making processes.\n\n/Design/methodology/approach:\nThe authors first provide a holistic understanding of important drivers of digital transformation. The authors then conceptualize the impact that analytics tools built on artificial intelligence (AI) and big data have on intuitive and analytical human decision processes in organizations.\n\n/Findings:\nThe authors discuss similarities and differences between machine learning and two human decision processes, namely, analysis and intuition. While it is difficult to jump to any conclusions about the future of machine learning, human decision-makers seem to continue to monopolize the majority of intuitive decision tasks, which will help them keep the upper hand ( vis-à-vis machines), at least in the near future.\n\n/Research implications:\nThe work contributes to research on rational (analytical) and intuitive processes of decision-making at the individual, group and organization levels by theorizing about the way these processes are influenced by advanced AI algorithms such as machine learning.\n\n/Practical implications:\nDecisions are building blocks of organizational success. Therefore, a better understanding of the way human decision processes can be impacted by advanced technologies will prepare managers to better use these technologies and make better decisions. By clarifying the boundaries/overlaps among concepts such as AI, machine learning and big data, the authors contribute to their successful adoption by business practitioners.\n\n/Social implications:\nThe work suggests that human decision-makers will not be replaced by machines if they continue to invest in what they do best: critical thinking, intuitive analysis and creative problem-solving.\n\n/Originality/value:\nThe work elaborates on important drivers of digital transformation from a decision-making perspective and discusses their practical implications for managers.","authors":["Pooya Tabesh"],"meta":["September 2021Journal of Business Strategy ahead-of-print(ahead-of-print)","DOI:10.1108/JBS-05-2021-0090"],"references":["335358640_New_Ways_of_Seeing_Big_Data","331691114_Implementing_big_data_strategies_A_managerial_perspective","320812037_Artificial_Intelligence_and_the_Future_of_Work_Human-AI_Symbiosis_in_Organizational_Decision_Making","268149935_New_Games_New_Rules_Big_Data_and_the_Changing_Context_of_Strategy","322995944_Tie_me_to_the_mast_artificial_intelligence_reputation_risk_management","318595939_The_robot_in_the_window_seat","318476902_Garbage_In_Garbage_Out_Can_Statisticians_Quantify_the_Effects_of_Poor_Data","305717307_Toward_the_Development_of_a_Big_Data_Analytics_Capability","281822417_Machine_Learning_Trends_Perspectives_and_Prospects","274581211_The_Comprehensiveness_of_Strategic_Decision_Processes_Extension_Observations_Future_Directions"]}