{"id":"354830652_Habituation_effect_in_social_networks_as_a_potential_factor_silently_crushing_influence_maximisation_efforts","abstract":"Information spreading processes are a key phenomenon observed within real and digital social networks. Network members are often under pressure from incoming information with different sources, such as informative campaigns for increasing awareness, viral marketing, rumours, fake news, or the results of other activities. Messages are often repeated, and such repetition can improve performance in the form of cumulative influence. Repeated messages may also be ignored due to a limited ability to process information. Learning processes are leading to the repeated messages being ignored, as their content has already been absorbed. In such cases, responsiveness decreases with repetition, and the habituation effect can be observed. Here, we analyse spreading processes while considering the habituation effect and performance drop along with an increased number of contacts. The ability to recover when reducing the number of messages is also considered. The results show that even low habituation and a decrease in propagation probability may substantially impact network coverage. This can lead to a significant reduction in the potential for a seed set selected with an influence maximisation method. Apart from the impact of the habituation effect on spreading processes, we show how it can be reduced with the use of the sequential seeding approach. This shows that sequential seeding is less sensitive to the habituation effect than single-stage seeding, and that it can be used to limit the negative impact on users overloaded with incoming messages.","authors":["Jarosław Jankowski"],"meta":["September 2021Scientific Reports 11(1)","DOI:10.1038/s41598-021-98493-9"],"references":["352049411_How_predictability_affects_habituation_to_novelty","337638244_Mathematical_Model_of_Emotional_Habituation_to_Novelty_Modeling_with_Bayesian_Update_and_Information_Theory","332786049_Information_diffusion_backbones_in_temporal_networks","327729908_Probing_Limits_of_Information_Spread_with_Sequential_Seeding","316220619_Balancing_Speed_and_Coverage_by_Sequential_Seeding_in_Complex_Networks","330964960_Prospect_Theory_An_Analysis_of_Decision_under_Risk","327402226_Selective_attention_in_the_news_feed_An_eye-tracking_study_on_the_perception_and_selection_of_political_news_posts_on_Facebook","325627422_Sequential_seeding_for_spreading_in_complex_networks_Influence_of_the_network_topology","318720888_Non-Stationary_Bandits_with_Habituation_and_Recovery_Dynamics","315229805_Models_of_epidemics_when_contact_repetition_and_clustering_should_be_included","314942701_The_Contagion_Effects_of_Repeated_Activation_in_Social_Networks","308062589_The_Dynamics_of_Viral_Marketing","303281173_Cumulative_Activation_in_Social_Networks","305973922_A_deterministic_epidemic_model_taking_account_of_repeated_contacts_between_the_same_individuals","303815995_Habituation_and_sensitization_New_thoughts_about_old_ideas"]}