{"id":"354936581_Discussoes_sobre_politica_de_privacidade_de_dados_em_um_sistema_de_informacao_governamental","abstract":"A implementação de sistemas de informação exige esforços para\ncondução e otimização, de forma cíclica, da operacionalização do tratamento e\nda recuperação de dados e informações, o que, muitas vezes, envolve dados\npessoais. O papel das políticas de privacidade em sistemas de informação\nevidencia a exigência legal de proteção de dados pessoais. Este trabalho analisa\na política de privacidade do site do Sistema Nacional de Juventude, como\nmodelo oriundo da adaptação de um sistema de informação governamental, ao\nuso de identificação pessoal dos usuários por meio de mídias sociais. O modelo\nproposto atende ao direito de privacidade, em particular, à proteção de dados\npessoais, buscando examinar aspectos gerais dos sistemas de informação e sua\nrelação com a Ciência da Informação. Além disso, o trabalho discorre sobre\nprivacidade e proteção de dados pessoais pelo poder público e apresenta o papel\ndas políticas de privacidade nos sistemas de informação. Como metodologia, foi\nadotada uma pesquisa qualitativa alinhada a estudos da Ciência da Computação.\nAo final, foram descritos os principais aspectos utilizados na adaptação do\nsistema de informação governamental, em particular, a política de privacidade\ndo site mencionado, apresentando, como resultado, seu delineamento a fim de\natender a Lei Geral de Proteção de Dados pessoais.","authors":["Milton Shintaku","Rosilene Paiva Marinho de Sousa","Lucas Rodrigues Costa","Rebeca S. Moura"],"meta":["September 2021Em Questão 27(4):39-60","DOI:10.19132/1808-5245274.39-60"],"references":["272139815_Metodologia_de_Pesquisa_para_Ciencia_da_Computacao","252062293_Privacy_in_the_Age_of_Google_and_Facebook","343753925_Protecao_de_dados_pessoais_e_os_contornos_da_Autodeterminacao_Informativa","332821382_Acesso_a_informacao_e_ao_tratamento_de_dados_pessoais_pelo_Poder_Publico","243766322_The_Secure_HyperText_Transfer_Protocol"]}