{"id":"354951625_Modelagem_Matematica_no_Curso_Tecnico_de_Informatica_Integrado_ao_Ensino_Medio_uma_abordagem_interdisciplinar","abstract":"Resumo: Este artigo apresenta um estudo sobre a interdisciplinaridade no desenvolvimento de atividades de Modelagem Matemática em um curso técnico de Informática Integrado ao Ensino Médio, que objetivou investigar a existência de contribuições desse trabalho no que diz respeito à ressignificação de conceitos matemáticos e à aprendizagem de novos. O intuito era analisar as ações dos estudantes ao lidarem com os conceitos que emergiram no desenvolvimento das atividades e inferir acerca das influências das intervenções dos professores ao mediar essas ações. Para isso, desenvolveu-se três atividades de Modelagem, planejadas com o professor da área específica do curso. Inferiu-se, dentre outros aspectos, que o desenvolvimento de atividades de Modelagem Matemática contribuiu para a ressignificação e aprendizagem de conceitos matemáticos à medida que a investigação suscitava a presença dos mesmos, de modo que os estudantes puderam construir relações entre eles e relacioná-los com contextos extramatemáticos, mais especificamente, aqueles afins ao curso técnico correspondente, o que se alinha aos preceitos do ensino nos cursos técnicos dos institutos federais. Palavras-chave: Educação Matemática. Interdisciplinaridade. Conceitos Matemáticos. Abstract: This paper introduces a study on interdisciplinarity in the development of Mathematical Modeling activities in a Computer Sciences Program at a Vocational-Technical High School, which aimed at investigating the existence of contributions of such activities regarding the resignification of mathematical concepts and the learning of new. The aim was to analyze the actions of students when they cope with the ideas that emerged in the development of the activities and infer about the influences of teachers' interventions when moderating these actions. To this end, three Modeling activities were developed and planned with the teacher of the specific area of the program. It was noted, among other aspects, that the development of Mathematical Modeling activities contributed to the resignification and learning of mathematical concepts as the research aroused their presence so that students were able to build connections among them and relate them to extra-mathematical contexts, more specifically those related to the corresponding technical program, which is in line with the precepts of teaching in the technical courses of federal institutes.","authors":["Elenice Setti","Rodolfo Eduardo Vertuan"],"meta":["September 2021Revista de Ensino de Ciências e Matemática 10(21):487","DOI:10.26843/rencima.v12n2a14"],"references":["332974035_Modelagem_Matematica_como_Estrategia_de_Ensino_de_Topicos_de_Estatistica_na_Formacao_Basica_Tecnica_uma_Aplicacao_na_Criacao_de_Frangos_Caipiras","311215827_Praticas_de_Monitoramento_Cognitivo_em_Atividades_de_Modelagem_Matematica","282462688_Uma_analise_semiotica_de_atividades_de_modelagem_matematica_mediadas_pela_tecnologia","40440886_A_interdisciplinaridade_como_um_movimento_articulador_no_processo_ensino-aprendizagem","335073140_PENSAMENTO_ESTATISTICO_EM_UMA_ATIVIDADE_DE_MODELAGEM_MATEMATICA_RESSIGNIFICANDO_O_LANCAMENTO_DE_AVIOES_DE_PAPEL","267841746_MODELAGEM_MATEMATICA_O_QUE_E_POR_QUE_COMO"]}