{"id":"354935936_Skilful_precipitation_nowcasting_using_deep_generative_models_of_radar","abstract":"Precipitation nowcasting, the high-resolution forecasting of precipitation up to two hours ahead, supports the real-world socioeconomic needs of many sectors reliant on weather-dependent decision-making1,2. State-of-the-art operational nowcasting methods typically advect precipitation fields with radar-based wind estimates, and struggle to capture important non-linear events such as convective initiations3,4. Recently introduced deep learning methods use radar to directly predict future rain rates, free of physical constraints5,6. While they accurately predict low-intensity rainfall, their operational utility is limited because their lack of constraints produces blurry nowcasts at longer lead times, yielding poor performance on rarer medium-to-heavy rain events. Here we present a deep generative model for the probabilistic nowcasting of precipitation from radar that addresses these challenges. Using statistical, economic and cognitive measures, we show that our method provides improved forecast quality, forecast consistency and forecast value. Our model produces realistic and spatiotemporally consistent predictions over regions up to 1,536 km × 1,280 km and with lead times from 5–90 min ahead. Using a systematic evaluation by more than 50 expert meteorologists, we show that our generative model ranked first for its accuracy and usefulness in 89% of cases against two competitive methods. When verified quantitatively, these nowcasts are skillful without resorting to blurring. We show that generative nowcasting can provide probabilistic predictions that improve forecast value and support operational utility, and at resolutions and lead times where alternative methods struggle. A deep generative model using radar observations is used to create skilful precipitation predictions that are accurate and support real-world utility.","authors":["Suman Ravuri","Karel Lenc","Matthew Willson","Dmitry Kangin"],"meta":["September 2021Nature 597(7878):672-677","DOI:10.1038/s41586-021-03854-z"],"references":["349233782_SmaAt-UNet_Precipitation_Nowcasting_using_a_Small_Attention-UNet_Architecture","342522394_Spatial_and_Temporal_Evaluation_of_Radar_Rainfall_Nowcasting_Techniques_on_1533_Events","342119669_RainNet_v10_a_convolutional_neural_network_for_radar-based_precipitation_nowcasting","340838468_The_first_Met_Office_Unified_Model-JULES_Regional_Atmosphere_and_Land_configuration_RAL1","334719455_Precipitation_Nowcasting_with_Satellite_Imagery","334689876_Using_a_10-Year_Radar_Archive_for_Nowcasting_Precipitation_Growth_and_Decay_A_Probabilistic_Machine_Learning_Approach","333785172_The_first_Met_Office_Unified_ModelJULES_Regional_Atmosphere_and_Land_configuration_RAL1","333045581_Pysteps_an_open-source_Python_library_for_probabilistic_precipitation_nowcasting_v10","344951042_Randomization_Tests","337408812_Non-Gaussian_Deterministic_Assimilation_of_Radar-Derived_Precipitation_Accumulations"]}