{"id":"354939069_On_estimating_the_predictability_of_human_mobility_the_role_of_routine","abstract":"Given the difficulties in predicting human behavior, one may wish to establish bounds on our ability to accurately perform such predictions. In the case of mobility-related behavior, there exists a fundamental technique to estimate the predictability of an individual’s mobility, as expressed in a given dataset. Although useful in several scenarios, this technique focused on human mobility as a monolithic entity, which poses challenges to understanding different types of behavior that may be hard to predict. In this paper, we propose to study predictability in terms of two components of human mobility: routine and novelty, where routine is related to preferential returns, and novelty is related to exploration. Viewing one’s mobility in terms of these two components allows us to identify important patterns about the predictability of one’s mobility.\nAdditionally, we argue that mobility behavior in the novelty component is hard to predict if we rely on the history of visited locations (as the predictability technique does), and therefore we here focus on analyzing what affects the predictability of one’s routine. To that end, we propose a technique that allows us to (i) quantify the effect of novelty on predictability, and (ii) gauge how much one’s routine deviates from a reference routine that is completely predictable, therefore estimating the amount of hard-to-predict behavior in one’s routine. Finally, we rely on previously proposed metrics, as well as a newly proposed one, to understand what affects the predictability of a person’s routine. Our experiments show that our metrics are able to capture most of the variability in one’s routine (adjusted $R^{2}$ R 2 of up to 84.9% and 96.0% on a GPS and CDR datasets, respectively), and that routine behavior can be largely explained by three types of patterns: (i) stationary patterns, in which a person stays in her current location for a given time period, (ii) regular visits, in which people visit a few preferred locations with occasional visits to other places, and (iii) diversity of trajectories, in which people change the order in which they visit certain locations.","authors":["Douglas do Couto Teixeira","Jussara M. Almeida","Aline Carneiro Viana"],"meta":["December 2021EPJ Data Science 10(1)","DOI:10.1140/epjds/s13688-021-00304-8"],"references":["332637795_Examining_the_Limits_of_Predictability_of_Human_Mobility","319135404_Information_flow_reveals_prediction_limits_in_online_social_activity","318172642_An_alternative_approach_to_the_limits_of_predictability_in_human_mobility","316053754_An_Entropy-Based_Approach_for_Evaluating_Travel_Time_Predictability_Based_on_Vehicle_Trajectory_Data","313451485_Predicting_taxi_demand_at_high_spatial_resolution_Approaching_the_limit_of_predictability","352623916_The_Impact_of_Stationarity_Regularity_and_Context_on_the_Predictability_of_Individual_Human_Mobility","347150689_Understanding_individuals'_proclivity_for_novelty_seeking","337230819_Deciphering_Predictability_Limits_in_Human_Mobility","332920352_On_the_Predictability_of_a_User's_Next_Check-in_Using_Data_from_Different_Social_Networks","311314043_A_Large-Scale_Study_in_Predictability_of_Daily_Activities_and_Places"]}