{"id":"355082800_An_adiabatic_method_to_train_binarized_artificial_neural_networks","abstract":"An artificial neural network consists of neurons and synapses. Neuron gives output based on its input according to non-linear activation functions such as the Sigmoid, Hyperbolic Tangent (Tanh), or Rectified Linear Unit (ReLU) functions, etc.. Synapses connect the neuron outputs to their inputs with tunable real-valued weights. The most resource-demanding operations in realizing such neural networks are the multiplication and accumulate (MAC) operations that compute the dot product between real-valued outputs from neurons and the synapses weights. The efficiency of neural networks can be drastically enhanced if the neuron outputs and/or the weights can be trained to take binary values ±1 only, for which the MAC can be replaced by the simple XNOR operations. In this paper, we demonstrate an adiabatic training method that can binarize the fully-connected neural networks and the convolutional neural networks without modifying the network structure and size. This adiabatic training method only requires very minimal changes in training algorithms, and is tested in the following four tasks: the recognition of hand-writing numbers using a usual fully-connected network, the cat-dog recognition and the audio recognition using convolutional neural networks, the image recognition with 10 classes (CIFAR-10) using ResNet-20 and VGG-Small networks. In all tasks, the performance of the binary neural networks trained by the adiabatic method are almost identical to the networks trained using the conventional ReLU or Sigmoid activations with real-valued activations and weights. This adiabatic method can be easily applied to binarize different types of networks, and will increase the computational efficiency considerably and greatly simplify the deployment of neural networks.","authors":["Yuansheng Zhao","Jiang Xiao"],"meta":["October 2021Scientific Reports 11(1):19797","DOI:10.1038/s41598-021-99191-2"],"references":["339558627_Differentiable_Soft_Quantization_Bridging_Full-Precision_and_Low-Bit_Neural_Networks","339411073_Binary_Neural_Networks_A_Survey","336906206_Grad-CAM_Visual_Explanations_from_Deep_Networks_via_Gradient-Based_Localization","333733488_A_Review_of_Binarized_Neural_Networks","324435399_Speech_Commands_A_Dataset_for_Limited-Vocabulary_Speech_Recognition","322059721_Channel_Pruning_for_Accelerating_Very_Deep_Neural_Networks","338509978_Learning_Channel-Wise_Interactions_for_Binary_Convolutional_Neural_Networks","328129716_LQ-Nets_Learned_Quantization_for_Highly_Accurate_and_Compact_Deep_Neural_Networks_15th_European_Conference_Munich_Germany_September_8-14_2018_Proceedings_Part_VIII","328127926_Bi-Real_Net_Enhancing_the_Performance_of_1-Bit_CNNs_with_Improved_Representational_Capability_and_Advanced_Training_Algorithm_15th_European_Conference_Munich_Germany_September_8-14_2018_Proceedings_Pa","322649540_Factorized_Convolutional_Neural_Networks"]}