{"id":"355025737_A_fuzzy_approach_for_sarcasm_detection_in_social_networks","abstract":"The great success of social networks is due to their ability to offer Internet users a space of free expression where they can produce\na large amount of information which provides every day with a new challenge for data analysts. The ease of use of social media\nencourages users to increasingly express their opinions either by using simple words expressing feelings or by using irony and\nsarcasm. The new challenges are to extract and analyze this mass of information which can then be used in different applications\nsuch as sentiment analysis and sarcasm detection. Sarcasm detection is a subarea of sentiment analysis, opinion mining, and\nemotion mining which are all representing the process of automatic identification of people’s orientation or sentiment toward\nindividuals, products, services, issues, and events. Sarcasm detection, which is the fact of deciding if a text is ironic or not, could\nbe used, for example, to improve the precision of the sentiment analysis. In most of the existing approaches, sarcasm detection is a\nbinary classification; each text is classified as sarcastic or non-sarcastic; however, since tweets are generally written by humans and\nhumans are by default fuzzy in their emotions and expressions, we can’t 100% confirm that a text is sarcastic or not. In addition,\ntweets are expressed in natural language which is full of ambiguity and non-precision, which motivates us more to adopt fuzzy\nlogic, not just to detect sarcasm but to give it a score. In this manuscript, we propose a fuzzy sarcasm detection approach using\nsocial information such as replies, historical tweets and likes, etc multiplying each by a degree of importance. The evaluation\nshows that the use of fuzzy logic has led us to improve the precision metric of the classification and to improve the accuracy of our\napproach. Using degrees of importance gave us the best values for recall, precision, and accuracy measures compared to existing\napproaches.","authors":["Amina Ben Meriem","Lobna Hlaoua","Lotfi Ben Romdhane"],"meta":["January 2021Procedia Computer Science 192(2015):602-611","DOI:10.1016/j.procs.2021.08.062"],"references":["348693773_An_Effective_Sarcasm_Detection_Approach_Based_on_Sentimental_Context_and_Individual_Expression_Habits","348538338_Interpretable_Multi-Head_Self-Attention_Architecture_for_Sarcasm_Detection_in_Social_Media","337425314_A2Text-Net_A_Novel_Deep_Neural_Network_for_Sarcasm_Detection","329048184_Sarcasm_classification_A_novel_approach_by_using_Content_Based_Feature_Selection_Method","325193763_Who_cares_about_sarcastic_tweets_Investigating_the_impact_of_sarcasm_on_sentiment_analysis","347038655_Tweet_Relevance_Based_on_the_Theory_of_Possibility","342157468_Influential_nodes_detection_in_dynamic_social_networks_A_Survey","336470380_Node_Importance_based_Label_Propagation_Algorithm_for_overlapping_community_detection_in_networks","334552153_Sentiment_and_Sarcasm_Classification_With_Multitask_Learning","334116026_Deep_contextualized_word_representations_for_detecting_sarcasm_and_irony"]}