{"id":"355110025_Embodied_intelligence_via_learning_and_evolution","abstract":"The intertwined processes of learning and evolution in complex environmental niches have resulted in a remarkable diversity of morphological forms. Moreover, many aspects of animal intelligence are deeply embodied in these evolved morphologies. However, the principles governing relations between environmental complexity, evolved morphology, and the learnability of intelligent control, remain elusive, because performing large-scale in silico experiments on evolution and learning is challenging. Here, we introduce Deep Evolutionary Reinforcement Learning (DERL): a computational framework which can evolve diverse agent morphologies to learn challenging locomotion and manipulation tasks in complex environments. Leveraging DERL we demonstrate several relations between environmental complexity, morphological intelligence and the learnability of control. First, environmental complexity fosters the evolution of morphological intelligence as quantified by the ability of a morphology to facilitate the learning of novel tasks. Second, we demonstrate a morphological Baldwin effect i.e., in our simulations evolution rapidly selects morphologies that learn faster, thereby enabling behaviors learned late in the lifetime of early ancestors to be expressed early in the descendants lifetime. Third, we suggest a mechanistic basis for the above relationships through the evolution of morphologies that are more physically stable and energy efficient, and can therefore facilitate learning and control.","authors":["Agrim Gupta","Silvio Savarese","Surya Ganguli","Li Fei-Fei"],"meta":["October 2021Nature Communications 12(1)","DOI:10.1038/s41467-021-25874-z"],"references":["350394487_A_Review_of_Physics_Simulators_for_Robotic_Applications","343535496_2D-VSR-Sim_A_simulation_tool_for_the_optimization_of_2-D_voxel-based_soft_robots","341750410_Environmental_influences_on_evolvable_robots","340534950_Evolving-Controllers_Versus_Learning-Controllers_for_Morphologically_Evolvable_Robots","340126764_Discovery_of_the_oldest_bilaterian_from_the_Ediacaran_of_South_Australia","337335208_Data-efficient_Co-Adaptation_of_Morphology_and_Behaviour_with_Deep_Reinforcement_Learning","347593157_RoboGrammar_graph_grammar_for_terrain-optimized_robot_design","343456678_Momentum_Contrast_for_Unsupervised_Visual_Representation_Learning","337092274_Reinforcement_Learning_for_Improving_Agent_Design","335140207_Jointly_Learning_to_Construct_and_Control_Agents_using_Deep_Reinforcement_Learning"]}