{"id":"355195280_Does_double-blind_peer_review_reduce_bias_Evidence_from_a_top_computer_science_conference","abstract":"Peer review is essential for advancing scientific research, but there are long‐standing concerns that authors' prestige or other characteristics can bias reviewers. Double‐blind peer review has been proposed as a way to reduce reviewer bias, but the evidence for its effectiveness is limited and mixed. Here, we examine the effects of double‐blind peer review by analyzing the review files of 5,027 papers submitted to a top computer science conference that changed its reviewing format from single‐ to double‐blind in 2018. First, we find that the scores given to the most prestigious authors significantly decreased after switching to double‐blind review. However, because many of these papers were above the threshold for acceptance, the change did not affect paper acceptance significantly. Second, the inter‐reviewer disagreement increased significantly in the double‐blind format. Third, papers rejected in the single‐blind format are cited more than those rejected under double‐blind, suggesting that double‐blind review better excludes poorer quality papers. Lastly, an apparently unrelated change in the rating scale from 10 to 4 points likely reduced prestige bias significantly such that papers' acceptance was affected. These results support the effectiveness of double‐blind review in reducing biases, while opening new research directions on the impact of peer‐review formats.","authors":["Mengyi Sun","Jainabou Barry Danfa","Misha Teplitskiy"],"meta":["October 2021Journal of the Association for Information Science and Technology","DOI:10.1002/asi.24582"],"references":["322195657_Hidden_connections_Network_effects_on_editorial_decisions_in_four_computer_science_journals","321072817_Reviewer_bias_in_single-_versus_double-blind_peer_review","320675145_The_Game_Between_a_Biased_Reviewer_and_His_Editor","310060019_Does_single_blind_peer_review_hinder_newcomers","338824746_Confirmatory_bias_in_peer_review","331696944_Scaling_Down_Inequality_Rating_Scales_Gender_Bias_and_the_Architecture_of_Evaluation","321248836_Peer_Review_A_Flawed_Process_at_the_Heart_of_Science_and_Journals","319525039_Effectiveness_of_Anonymization_in_Double-Blind_Review","318564276_Bias_against_novelty_in_science_A_cautionary_tale_for_users_of_bibliometric_indicators","316524782_The_game_between_a_biased_reviewer_and_his_editor"]}