{"id":"355168279_Mobile_IoT","abstract":"With the Internet of Things (IoT) gradually evolving as the subsequent phase of the evolution of the Internet, it becomes crucial to recognize the various potential domains for application of IoT, and the research challenges that are associated with these applications. Ranging from smart cities, to health care, smart agriculture, logistics and retail, to even smart living and smart environments IoT is expected to infiltrate into virtually all aspects of daily life. Even though the current IoT enabling technologies have greatly improved in the recent years, there are still numerous problems that require attention. Since the IoT concept ensues from heterogeneous technologies, many research challenges are bound to arise. The fact that IoT is so expansive and affects practically all areas of our lives, makes it a significant research topic for studies in various related fields such as information technology and computer science. Thus, IoT is paving the way for new dimensions of research to be carried out. This paper presents the importance, benefits, of IoT technologies and discusses future applications and research challenges.","authors":["Maxwell Bandi","Esra Antibas","Julius Munulai"],"meta":["October 2021"],"references":["271658599_The_internet_of_things_A_survey","232168440_The_Internet_of_Things_--_Promise_for_the_future_An_Introduction","228338607_CoolSpots_Reducing_the_power_consumption_of_wireless_mobile_devices_with_multiple_radio_interfaces","224060044_Software_assisted_digital_RF_processor_for_single-chip_GSM_radio_in_90_nm_CMOS","314489278_Impact_of_Technology_on_Consumer_Behaviour","312220159_Software_Security_Considerations_for_IoT","261045191_A_survey_on_the_ietf_protocol_suite_for_the_internet_of_things_Standards_challenges_and_opportunities","254052181_Key_Technologies_and_Applications_of_Internet_of_Things","254015847_Distributed_video_coding_A_promising_solution_for_distributed_wireless_video_sensors_or_not","228095891_Internet_of_Things_IoT_A_Vision_Architectural_Elements_and_FutureDirections"]}