{"id":"355285279_Parsimonious_truncated_Newton_method_for_time-domain_full_waveform_inversion_based_on_Fourier-domain_full-scattered-field_approximation","abstract":"In order to exploit Hessian information in Full Waveform Inversion (FWI), the matrix-free truncated Newton method can be used. In such a method, Hessian-vector product computation is one of the major concerns due to the huge memory requirements and demanding computational cost. Using the adjoint-state method, the Hessian-vector product can be estimated by zero-lag cross-correlation of the first-order/second-order incident wavefields and the second-order/first-order adjoint wavefields. Different from the implementation in frequency-domain FWI, Hessian-vector product construction in the time domain becomes much more challenging as it is not affordable to store the entire time-dependent wavefields. The widely used wavefield recomputation strategy leads to computationally intensive tasks. We present an efficient alternative approach to computing the Hessian-vector product for time-domain FWI. In our method, discrete Fourier transform is applied to extract frequency-domain components of involved wavefields, which are used to compute wavefield cross-correlation in the frequency domain. This makes it possible to avoid reconstructing the first-order and second-order incident wavefields. In addition, a full-scattered-field approximation is proposed to efficiently simplify the second-order incident and adjoint wavefields computation, which enables us to refrain from repeatedly solving the first-order incident and adjoint equations for the second-order incident and adjoint wavefields (re)computation. With the proposed method, the computational time can be reduced by 70% and 80% in viscous media for Gauss-Newton and full-Newton Hessian-vector product construction, respectively. The effectiveness of our method is also verified in the frame of a 2D multi-parameter inversion, in which the proposed method almost reaches the same iterative convergence of the conventional time-domain implementation.","authors":["Peng Yong","Romain Brossier","Ludovic Métivier"],"meta":["October 2021Geophysics","DOI:10.1190/geo2021-0164.1"],"references":["346933316_Amplitude-based_misfit_functions_in_viscoelastic_full-waveform_inversion_applied_to_walk-away_vertical_seismic_profile_data","341275756_Use_of_prismatic_waves_in_full-waveform_inversion_with_the_exact_Hessian","337279804_3D_frequency-domain_elastic_wave_modeling_with_spectral-element_method_using_a_massively_parallel_direct_solver","333114957_Least-squares_reverse_time_migration_via_linearized_waveform_inversion_using_a_Wasserstein_metric","329779624_Semi-global_visco-acoustic_full_waveform_inversion","350571998_Anisotropic_3D_elastic_full-wavefield_inversion_to_directly_estimate_elastic_properties_and_its_role_in_interpretation","346087075_Multiparameter_full-waveform_inversion_of_3D_OBC_data_from_the_Valhall_field","337845079_Seismic_wavefield_imaging_of_Earth's_interior_across_scales","330954800_6_An_introduction_to_full_waveform_inversion","330562723_A_subsampled_truncated-Newton_method_for_multi-parameter_full_waveform_inversion"]}