{"id":"355368908_On_Information_Orders_on_Metric_Spaces","abstract":"Information orders play a central role in the mathematical foundations of Computer Science. Concretely, they are a suitable tool to describe processes in which the information increases successively in each step of the computation. In order to provide numerical quantifications of the amount of information in the aforementioned processes, S.G. Matthews introduced the notions of partial metric and Scott-like topology. The success of partial metrics is given mainly by two facts. On the one hand, they can induce the so-called specialization partial order, which is able to encode the existing order structure in many examples of spaces that arise in a natural way in Computer Science. On the other hand, their associated topology is Scott-like when the partial metric space is complete and, thus, it is able to describe the aforementioned increasing information processes in such a way that the supremum of the sequence always exists and captures the amount of information, measured by the partial metric; it also contains no information other than that which may be derived from the members of the sequence. R. Heckmann showed that the method to induce the partial order associated with a partial metric could be retrieved as a particular case of a celebrated method for generating partial orders through metrics and non-negative real-valued functions. Motivated by this fact, we explore this general method from an information orders theory viewpoint. Specifically, we show that such a method captures the essence of information orders in such a way that the function under consideration is able to quantify the amount of information and, in addition, its measurement can be used to distinguish maximal elements. Moreover, we show that this method for endowing a metric space with a partial order can also be applied to partial metric spaces in order to generate new partial orders different from the specialization one. Furthermore, we show that given a complete metric space and an inf-continuous function, the partially ordered set induced by this general method enjoys rich properties. Concretely, we will show not only its order-completeness but the directed-completeness and, in addition, that the topology induced by the metric is Scott-like. Therefore, such a mathematical structure could be used for developing metric-based tools for modeling increasing information processes in Computer Science. As a particular case of our new results, we retrieve, for a complete partial metric space, the above-explained celebrated fact about the Scott-like character of the associated topology and, in addition, that the induced partial ordered set is directed-complete and not only order-complete.","authors":["Olivier Olela Otafudu","O. Valero"],"meta":["October 2021Information (Switzerland) 2021(12, 427)","DOI:10.3390/info12100427","Project: Generalized Metrics, Fixed Point Theory and Functional Analysis"],"references":["257878376_Fixed_point_theorems_in_generalized_metric_spaces_with_applications_to_computer_science","242793128_The_Smyth_Completion","319394497_Handbook_of_Logic_in_Computer_Science","288941372_Order-theoretic_aspects_of_metric_fixed_point_theory","252065115_The_Semantics_of_a_Simple_Language_for_Parallel_Processing","229470329_Partial_Metrics_Valuations_and_Domain_Theory","228739320_Partial_metric_monoids_and_semivaluation_spaces","227656324_Partial_Metric_Topology","226912869_Quantitative_Continuous_Domains","225396471_Bicompleting_weightable_quasi-metric_spaces_and_partial_metric_spaces","222673497_Weightable_quasi-metric_semigroup_and_semilattices","220370937_Distance_and_Measurement_in_Domain_Theory","225035741_Introduction_to_Lattices_and_Order_-_2nd_Ed","223001960_A_characterization_of_partial_metrizability_Domains_are_quantifiable","222181140_The_correspondence_between_partial_metrics_and_semivaluations"]}