{"id":"355389782_Effectiveness_of_Digital_Technology_in_Education_During_COVID-19_Pandemic_A_Bibliometric_Analysis","abstract":"Digital technologies are viewing as a gateway to solve many of the problems arising from the crisis. How can we provide efficient education in COVID-19? To extend classroom learning to the home is a challenging task for the nations and the COVID-19 outbreak put the world in a situation from home learning. This study will analyze the overall resources and digital technologies available for education from home. For this purpose, Scopus and web of science databases are used to find the literature. The final 82 articles are select for the SLR (systematic literature review). The data inclusion and exclusion process are used in the PRISMA statement 2015 for quality assessment of data. The bibliometric analysis will conduct for text frequency co-occurrence and collaborations between the authors in countries. The vital step of data classification will process according to the author's segmentation and published research settings. In the last findings of the study, reports will explain past literature and recent outbreak. We are applying bibliometric analysis, showing that reviews are classified into 04 main clusters for analysis and discussion. These are 1) Digital Education Quick Shift Online Teaching and Learning for during Covid19 Pandemic 2) Digital Education during Pandemic and Rethinking for Sustainable Community; 3) Digital education for medical education and healthcare in hospital; 4) Digital Education and Digital innovation development during Covid19 pandemic. These findings are expected to benefit stakeholders studying and working relevant in digital education during and resilient post-Covid-19 pandemic.","authors":["Ishamuddin Bin Mustapha","N.T. Van","M. Shahverdi","Muhammad Imran Qureshi"],"meta":["January 2021","DOI:10.3991/ijim.v15i08.20415"],"references":["346484775_sustainability_Classifications_of_Sustainable_Manufacturing_Practices_in_ASEAN_Region_A_Systematic_Review_and_Bibliometric_Analysis_of_the_Past_Decade_of_Research","341735964_A_Systematic_Literature_Review_on_Online_Medical_Services_in_Malaysia","340718285_A_Systematic_Review_of_Past_Decade_of_Mobile_Learning_What_we_Learned_and_Where_to_Go"]}