{"id":"355394219_Gamified_Collaborative_Environment_in_Moodle","abstract":"Higher education institutions are struggling to enhance teaching and learning processes to support students' needs in this information age. In the last few years, gamification has been widely used to improve learning experiences in various environments. Education is one of the fields that adopted gamification as technological innovation to increase student engagement since it plays a critical role in higher education, especially in digital learning environments. Today, learning management systems (LMSs) are commonly used to facilitate learning processes. However, the engagement and the motivation of students when using such systems require extra attention. There is a need for an instructor to incorporate digital technologies with esteemed innovations to create an engaging learning environment. Increasing students' engagement is said to be evidence of increased learning. Therefore, this paper addresses these challenges by designing, developing, and evaluating a gamified collaborative discussion environment on the moodle LMS. To achieve this, the students in a postgraduate course used a gamified online discussion environment for eight weeks during group work to complete their term projects. Students' online learning pre-test and post-test data are utilized to investigate students' engagement in a gamified discussion environment. The results illustrate that there is a significant difference between pre-test and post-test results, which shows that the gamified online discussion environment has improved students' engagement. Furthermore, students that highly accessed the online course activities had a good engagement, which motivated students to conduct online collaboration according to the game-feature context.","authors":["Hasan Fahmi Al-Delawi","Muesser Cemal Nat","Vanye Vanduhe"],"meta":["July 2019IEEE Access 7(99):89833-89844","DOI:10.1109/ACCESS.2019.2926622","Project: Gamified Moodle"],"references":["331539529_Gamification_in_MOOCs_Engagement_Application_Test_in_Energy_Sustainability_Courses","328367839_Students'_Evidential_Increase_in_Learning_Using_Gamified_Learning_Environment_Volume_1","322288130_A_Design_Framework_for_Adaptive_Gamification_Applications","320749028_A_Recommendation_of_Information_System_Implementation_to_Support_Decision-Making_Process_of_Top_Management","320622364_GAMIFICATION_IN_HIGHER_EDUCATION_LEARNING-STATE_OF_THE_ART_CHALLENGES_AND_OPPORTUNITIES","320234774_GAMIFICATION_IN_EDUCATION","319921216_Blended_learning_with_Moodle_in_medical_statistics_An_assessment_of_knowledge_attitudes_and_practices_relating_to_e-learning","319732563_Gamified_Digital_Services_How_Gameful_Experiences_Drive_Continued_Service_Usage","329873682_Business_intelligence_tools_-_content_generation_using_moodle_for_self_learning_as_an_elective_module","323102838_An_exploratory_study_of_student_engagement_in_gamified_online_discussions"]}