{"id":"355385706_Insect_pests_recognition_based_on_deep_transfer_learning_models","abstract":"Agriculture is one of the most important sources for human food throughout the history of humankind. In many countries, agriculture is the foundation of its economy, and more than 90% of its population deriving their livelihoods from it. Insect pests are one of the main factors affecting agricultural crop production. With the advances of computer algorithms and artificial intelligence, accurate and speedy recognition of insect pests in early stages may help in avoiding economic losses in short and long term. In this paper, an insect pest recognition based on deep transfer learning models will be presented. The IP102 insect pest dataset was selected in this research. The IP102 dataset consists of 27500 images and contains 102 classes of insect pests, it is considered one the biggest dataset for insect pest and was launched in 2019. Through the paper, AlexNet, GoogleNet, and SqueezNet were the selected deep transfer learning models. Those models were selected based on their small number of layers on their architectures, which will reflect in reducing the complexity of the models and the consumed memory and time. Data augmentation techniques were used to render the models more robust and to overcome the overfitting problem by increasing the dataset images up to 4 times than original images. The testing accuracy and performance metrics, such as the precision, recall, and F1 score, were calculated to prove the robustness of the selected models. The AlexNet model achieved the highest testing accuracy at 89.33%. In addition, it has a minimum number of layers, which decreases the training time and computational complexity. Moreover, the choice of data augmentation techniques played an important role in achieving better results. Finally, A comparison results were carried out at the end of the research with related work which used the same dataset IP102. The presented work achieved a superior result than the related work in terms of testing accuracy, precision, recall, and F1 score.","authors":["Nour Eldeen Khalifa","Mohamed Loey","M.H.N. Taha"],"meta":["January 2020Journal of Theoretical and Applied Information Technology 98(1):60-68"],"references":[]}