{"id":"355350087_LE_CHAMP_D'AFFORDANCES_DE_LA_THEORIE_DE_L'AFFORDANCE_POUR_LA_RECHERCHE_EN_SYSTEME_D'INFORMATION","abstract":"Les Technologies de l'information (TI) sont omniprésentes dans les pratiques des entreprises puisqu'on ne peut concevoir, à l'heure actuelle, un système d'information ne faisant pas recours à ce type de technologies. Cette omniprésence factuelle a induit comme corollaire que la recherche en système d'information s'intéresse à l'impact et aux changements induits par les TI sur les organisations et les individus. Mais ces recherches ont buté, depuis leurs débuts, sur la conceptualisation des TI comme objet d'étude. Plusieurs obstacles ont entravé cette conceptualisation. Le recours relativement récent à la théorie de l'affordance a ouvert, aux chercheurs en système d'information, un champ de possibilités (affordances) ayant permis le lancement d'une nouvelle dynamique dans cette discipline. L'objectif de notre article est de retracer l'évolution de la conceptualisation des TI dans les recherches sur le changement induit par ces technologies et de montrer comment la théorie de l'affordance a permis le dépassement de certains obstacles ralentissant la théorisation de cet objet central à la recherche en SI. Mot clé : Artefact informatique, théorie de l'affordance, système d'information. ABSTRACT Information technology (IT) is ubiquitous in business practices. No information system can be conceived, now days, without the use of this type of technology. This factual omnipresence has led to the fact that information system research is interested in the impact and changes induced by IT on organizations and individuals. But this research has stumbled, since their beginnings, on the conceptualization of IT as an object of study. Several obstacles hindered this conceptualization. The relatively recent use of the theory of affordance has opened up to the researchers in information systems a field of possibilities (affordances) that have allowed the launch of a new dynamic in this discipline. The aim of this article is to retrace the evolution of the IT conceptualization in the research on the change induced by these technologies and to show how the theory of affordance allowed the overcoming of certain obstacles slowing the theorization of this central object in IS research.","authors":["Elhakoumi Khalid"],"meta":["December 2018","DOI:10.34874/IMIST.PRSM/ISMI/17010"],"references":["312232217_The_Information_Systems_Artifact_A_Conceptualization_Based_on_General_Systems_Theory","269777028_Going_back_to_basics_in_design_science_From_the_information_technology_artifact_to_the_information_systems_artifact","263642241_Affordance_Theory_in_the_IS_Discipline_a_Review_and_Synthesis_of_the_Literature","240729307_Technologies_Texts_and_Affordances","220580526_A_Foundation_for_the_Study_of_IT_Effects_A_New_Look_at_DeSanctis_and_Poole's_Concepts_of_Structural_Features_and_Spirit","286326056_Theorizing_Information_Technology_as_a_Material_Artifact_in_Information_Systems_Research","271199060_Sociologie_des_outils_de_gestion","201169015_Research_Commentary_Desperately_Seeking_the_IT_in_IT_Research--A_Call_to_Theorizing_the_IT_Artifact","200473541_On_the_Deep_Structure_of_Information_Systems","45676706_Stylisation_de_l'appropriation_individuelle_des_technologies_Internet_a_partir_de_la_TSA"]}