{"id":"355492521_Attacking_the_DeFi_Ecosystem_with_Flash_Loans_for_Fun_and_Profit","abstract":"Credit allows a lender to loan out surplus capital to a borrower. In the traditional economy, credit bears the risk that the borrower may default on its debt, the lender hence requires upfront collateral from the borrower, plus interest fee payments. Due to the atomicity of blockchain transactions, lenders can offer flash loans, i.e., loans that are only valid within one transaction and must be repaid by the end of that transaction. This concept has lead to a number of interesting attack possibilities, some of which were exploited in February 2020. This paper is the first to explore the implication of transaction atomicity and flash loans for the nascent decentralized finance (DeFi) ecosystem. We show quantitatively how transaction atomicity increases the arbitrage revenue. We moreover analyze two existing attacks with ROIs beyond 500k%. We formulate finding the attack parameters as an optimization problem over the state of the underlying Ethereum blockchain and the state of the DeFi ecosystem. We show how malicious adversaries can efficiently maximize an attack profit and hence damage the DeFi ecosystem further. Specifically, we present how two previously executed attacks can be “boosted” to result in a profit of 829.5k USD and 1.1M USD, respectively, which is a boost of 2.37× and 1.73×, respectively.","authors":["Kaihua Qin","Liyi Zhou","Benjamin Livshits","Arthur Gervais"],"meta":["October 2021","DOI:10.1007/978-3-662-64322-8_1","In book: Financial Cryptography and Data Security, 25th International Conference, FC 2021, Virtual Event, March 1–5, 2021, Revised Selected Papers, Part I (pp.3-32)"],"references":["339890096_SoK_Transparent_Dishonesty_Front-Running_Attacks_on_Blockchain","329193706_To_the_moon_defining_and_detecting_cryptocurrency_pump-and-dumps","324512533_A_Semantic_Framework_for_the_Security_Analysis_of_Ethereum_Smart_Contracts","322205094_Price_Manipulation_in_the_Bitcoin_Ecosystem","321147071_Defining_the_Ethereum_Virtual_Machine_for_Interactive_Theorem_Provers","309444724_Making_Smart_Contracts_Smarter","4768638_The_Limits_of_Arbitrage"]}