{"id":"355425702_Piano_Performance_and_Music_Automatic_Notation_Algorithm_Teaching_System_Based_on_Artificial_Intelligence","abstract":"Artificial intelligence is a subject that studies all kinds of human intelligent activities and their laws. It is developed on the basis of the cohesion of many disciplines such as computer science, politics, information system, neurophysiology, psychology, philosophy, and language. This paper aims to study how to build a computer or intelligent machine, including hardware and software, imitate and expand the human brain to perform thinking functions such as thinking, programming, arithmetic, and learning, solve complex problems that need to be handled by professionals, and better apply the artificial intelligence assistance system to the teaching of piano performance. In this paper, Prolog language and music-assisted learning system based on the ARM and SA algorithm are proposed, the principle and operation process of music automatic recording technology are deeply studied, and the system data of artificial intelligence are summarized and analyzed by using internal database, so as to find out the implementation principle and law of piano automatic recording system. So that the artificial intelligence assistant system can be better applied to music teaching. The experimental results show that, in the teaching system of piano performance and music automatic notation algorithm, the utilization rate of artificial intelligence auxiliary technology has reached 56.81 and is growing rapidly. Therefore, we can find that the artificial intelligence assistant system plays an important role in the teaching system of piano performance and automatic music notation.","authors":["Yaokun Yang"],"meta":["October 2021Mobile Information Systems 2021","DOI:10.1155/2021/3552822"],"references":["353467624_Automatic_Selection_of_Relevant_Attributes_for_Multi-Sensor_Remote_Sensing_Analysis_A_Case_Study_on_Sea_Ice_Classification","352693279_Optimization_of_Automatic_PCG_Analysis_and_CVD_Diagnostic_System","351168385_Research_and_Case_Analysis_of_Apriori_Algorithm_Based_on_Mining_Frequent_Item-Sets","345363185_Analysis_on_the_Ideological_and_Political_Construction_of_Colleges_Piano_Teaching_in_the_New_Era","342419152_An_Empirical_Study_on_Sales_Performance_Effect_and_Pricing_Strategy_for_E-Commerce_From_the_Perspective_of_Mobile_Information","348705128_A_Novel_Trust_Model_for_Secure_Group_Communication_in_Distributed_Computing","348628336_Experiments_and_detailed_error-analysis_of_automatic_square_notation_transcription_of_medieval_music_manuscripts_using_CNNLSTM-networks_and_a_neume_dictionary","345344488_Developing_Learning_Module_for_Equalizing_the_Competence_of_Students_in_1st_Piano_Minor_Course_at_Jakarta_Institute_of_the_Arts","343787739_Evolution_Toward_Artificial_Intelligence_of_Things_Under_6G_Ubiquitous-X","341724903_Security-Aware_Autonomic_Allocation_of_Cloud_Resources_A_Model_Research_Trends_and_Future_Directions"]}