{"id":"355586917_What_do_they_TELL_A_systematic_analysis_of_master_programs_in_technology-enhanced_learning","abstract":"This article contributes to the debate on the growing number of interdisciplinary study programs in learning and technology, and aims to understand the diversity of programs as well as curricula structure in an international landscape. Scientific fields share their knowledge and recruit young researchers by offering discipline-specific study programs. Thus, study programs are a reflection of the fields they represent. As technology-enhanced learning is considered to be particularly interdisciplinary and heterogenous, it is important to better understand the landscape of study programs that represents the field. This article presents an analysis of master programs in technology-enhanced learning. A systematic review and analysis of master programs offered in English has been conducted and further used as input for hierarchical cluster analysis. The study identified general characteristics, curricula structure, and organization of topics of these programs. Hierarchical cluster analysis and qualitative content analysis helped us to identify the major types of curricular structures and typical topics covered by the courses. Results show that most study programs rely on interdisciplinary subjects in technology-enhanced learning with a considerable number of subjects from education, learning and psychology. Subjects related to technology, information and computer science appear in such programs less frequently.","authors":["Mikhail Fominykh","Joshua Weidlich","Marco Kalz","Ingunn Dahler Hybertsen"],"meta":["January 2022","DOI:10.1186/s41239-021-00305-7"],"references":["351186770_Interdisciplinaere_universitetsuddannelser_-_Hvordan_sikres_sammenhaengskraften","343760121_Interdisciplinary_Doctoral_Training_in_Technology-Enhanced_Learning_in_Europe","323240635_What_Do_We_Teach_When_We_Teach_the_Learning_Sciences_A_Document_Analysis_of_75_Graduate_Programs","313615274_Methods_of_systematic_reviews_and_meta-analysis_preferred_reporting_items_for_systematic_reviews_and_meta-analyses_the_PRISMA_statement","286208053_Preferred_Reporting_Items_for_Systematic_Reviews_and_Meta-Analyses_The_PRISMA_Statement","337013142_Technology-enhanced_learning_in_higher_education_A_bibliometric_analysis_with_latent_semantic_approach","331627535_Technology-Enhanced_Learing_From_Thesaurus_and_Dictionary_to_Ontology","321955761_Indicators_of_exemplary_programs_in_instructional_design_and_technology_faculty_and_student_perspectives","313145413_Hierarchical_grouping_to_optimize_an_obiective_function","281815480_Technological_and_Social_Environments_for_Interactive_Learning"]}