{"id":"355590460_Sistem_Pakar_Menggunakan_Metode_Certainty_Factor_untuk_Mendiagnosa_Hama_dan_Penyakit_pada_Tanaman_Cabai","abstract":"INTISARICabai merupakan salah satu jenis tanaman sayuran yang dapat menjadi bumbu masakan atau disajikan secara langsung sebagai bahan tambahan dalam makanan. Cabai juga menjadi sayuran yang paling diminati oleh masyarakat Indonesia, sehingga berpotensi besar untuk dikembangkan dan memiliki nilai ekonomi yang cukup tinggi. Akan tetapi, tanaman cabai memiliki masalah yang kompleks terkait serangan hama dan penyakit yang berpotensi mengurangi produksi dan menyebabkan gagal panen. Sistem pakar merupakan salah satu cabang artificial intelligence dalam ilmu komputer yang dapat dimanfaatkan untuk menyelesaikan berbagai jenis masalah. Sistem pakar mampu berperan seperti seorang pakar, sehingga mendiagnosa hama dan penyakit pada tanaman cabai. Pengembangan sistem pakar ini menggunakan metode centainty factor. Metode ini dapat membantu dalam pengambilan keputusan dan menampilkan persentase hasil diagnosa terkait hama dan penyakit pada tanaman cabai. Sistem pakar dikembangkan berbasis website supaya menjadi sistem yang dinamis, sehingga dapat di akses melalui komputer ataupun smartphone. Hasil akhir diagnosa oleh sistem pakar berupa kesimpulan, penjelasan, dan cara mengatasinya.Kata kunci— Tanaman Cabai, sistem pakar, certainty factor ABSTRACTChili is a type of vegetable plant that can be used as a spice in cooking or served directly as an additional ingredient in food. Chili is also a game that is most in demand by the people of Indonesia, so it is likely to be developed and has a fairly high economic value. However, chili plants have problems related to pests and diseases that disrupt production and cause crop failure. Expert system is a branch of artificial intelligence in computer science that can be used to solve various types of problems. The expert system is able to act as a person, thus diagnosing pests and diseases in chili plants. The development of this expert system uses the centacity factor method. This method can assist in making decisions and displaying diagnostic results related to pests and diseases in chili plants. The expert system was developed based on a website to become a dynamic system, so that it can be accessed via a computer or smartphone. The final result of diagnosis by the system is in the form of conclusions, explanations, and how to overcome them.Kata kunci— Chilli plant, expert system, certainty factor","authors":["Hendra Kurniawan Muhammad Reza Alamsyah"],"meta":["July 2021","DOI:10.35842/jtir.v16i2.399"],"references":["336381136_Aplikasi_Sistem_Pakar_Untuk_Mendiagnosa_Gangguan_Kepribadian_Pada_Remaja_Dengan_Menggunakan_Metode_Certainty_Factor_CF","330584143_Respons_Tanaman_Cabai_Besar_Capsicum_annuum_L_Terhadap_Pemberian_Pupuk_Organik_Hormon_Tanaman_Unggul","228866353_Penggunaan_Sistem_Pakar_dalam_Pengembangan_portal_Informasi_untuk_Spesifikasi_Jenis_Penyakit_Infeksi"]}