{"id":"355550434_The_Utilization_of_English4IT_Website_in_Improving_Computer_Major_Students'_English_Competence","abstract":"Keywords: English4IT, Computer Major Students, English Competence, English for Specific Purposes. Abstract: This study aims to evaluate the potential benefit of English4IT in helping Computer primary students at STMIK Multicom Bolaang-Mongondow to learn English. These students were lacking interest in learning English due to their background as science students, and English is not their primary. In order to gain their interest in learning English and to maximize their potency in learning a foreign language, the teacher needs to use a particular method to facilitate students' language learning process. Thus, the teacher utilized English4IT. English4IT is a website that provides eLearning Platform which is designed by English4work.com for those who come from the area of Computer Science and Information Technology. English materials on the platform are related to Computerization and Information Technology. This study used a questionnaire and interview section to gain data from respondents. The respondents reported that English4IT successfully attracted their interest in learning English and also helped them in improving their English. This study will benefit teachers who teach English for a specific purpose such as teaching for Computer significant students, and the students as well. This study is limited to the second semester of Information Technology and Information System students of 2018-2019 academic year at STMIK Multicom Bolaang-Mongondow and only involved 25 participants.","authors":["Dewi Christa Kobis","Dewi Christa Kobis"],"meta":["October 2021","DOI:10.5220/0010622900002967"],"references":["328483019_Applying_Technology_in_Teaching_English_Padlet_Animoto_and_Sway","278848636_The_importance_of_educational_technology_in_teaching","236151044_English_Language_in_the_Context_of_Globalization","220969904_The_Pilot_Implementation_Of_The_Eit_English_For_Information_Technology_E-Learning_Portal","271429461_Educational_Research_Planning_Planning_Conducting_and_Evaluating_Quantitative_and_Qualitative_Research"]}