{"id":"355600410_Entanglement-Induced_Barren_Plateaus","abstract":"We argue that an excess in entanglement between the visible and hidden units in a quantum neural network can hinder learning. In particular, we show that quantum neural networks that satisfy a volume law in the entanglement entropy will give rise to models that are not suitable for learning with high probability. Using arguments from quantum thermodynamics, we then show that this volume law is typical and that there exists a barren plateau in the optimization landscape due to entanglement. More precisely, we show that for any bounded objective function on the visible layers, the Lipshitz constants of the expectation value of that objective function will scale inversely with the dimension of the hidden subsystem with high probability. We show how this can cause both gradient-descent and gradient-free methods to fail. We note that similar problems can happen with quantum Boltzmann machines, although stronger assumptions on the coupling between the hidden and/or visible subspaces are necessary. We highlight how pretraining such generative models may provide a way to navigate these barren plateaus.","authors":["Carlos Ortiz Marrero","Maria Kieferova","Nathan Wiebe"],"meta":["October 2021","DOI:10.1103/PRXQuantum.2.040316"],"references":["343438490_Key_questions_for_the_quantum_machine_learner_to_ask_themselves","337846240_An_initialization_strategy_for_addressing_barren_plateaus_in_parametrized_quantum_circuits","331719791_Supervised_learning_with_quantum-enhanced_feature_spaces","322341080_Structural_absorption_by_barbule_microstructures_of_super_black_bird_of_paradise_feathers","290263608_Quantum_Boltzmann_Machine","347674485_Closing_Gaps_of_a_Quantum_Advantage_with_Short-Time_Hamiltonian_Dynamics","340914588_Information_Scrambling_and_Loschmidt_Echo","323904931_Quantum_Machine_Learning_in_Feature_Hilbert_Spaces","322016273_Tomography_and_generative_training_with_quantum_Boltzmann_machines","317123046_Unitary_2-designs_from_random_X_-_and_Z_-diagonal_unitaries"]}