{"id":"355685788_Automation_Isn't_Automatic","abstract":"Automation has become an increasingly popular tool for synthetic chemists over the past decade. Recent advances in robotics and computer science have led to the emergence of automated systems that execute common laboratory procedures including parallel synthesis, reaction discovery, reaction optimization, time course studies, and crystallization development. While such systems offer many potential benefits, their implementation is rarely automatic due to the highly specialized nature of synthetic procedures. Each reaction category requires careful execution of a particular sequence of steps, the specifics of which change with different conditions and chemical systems. Careful assessment of these critical procedural requirements and identification of the tools suitable for effective experimental execution are key to developing effective automation workflows. Even then, it is often difficult to get all the components of an automated system integrated and operational. Data flows and specialized equipment present yet another level of challenge. Unfortunately, the pain points and process of implementing automated systems are often not shared or remain buried deep in the SI. This perspective provides an overview of the current state of automation of synthetic chemistry at the benchtop scale with a particular emphasis on core considerations and the ensuing challenges of deploying a system. Importantly, we aim to reframe automation as decidedly not automatic but rather an iterative process that involves a series of careful decisions (both human and computational) and constant adjustment.","authors":["Melodie Christensen","Lars P E Yunker","Parisa Shiri","Tara Zepel"],"meta":["October 2021Chemical Science 12(6423)","DOI:10.1039/D1SC04588A"],"references":["353640207_Data-science_driven_autonomous_process_optimization","349340291_Automated_solubility_screening_platform_using_computer_vision","342790679_A_mobile_robotic_chemist","341361505_Self-driving_laboratory_for_accelerated_discovery_of_thin-film_materials","348878214_Automation_Technologies_to_Enable_Data-Rich_Experimentation_Beyond_Design_of_Experiments_for_Process_Modeling_in_Late-Stage_Process_Development","348638958_A_Perspective_on_the_Analytical_Challenges_Encountered_in_High-Throughput_Experimentation","347352798_Recent_Advances_in_High-Throughput_Automated_Powder_Dispensing_Platforms_for_Pharmaceutical_Applications","344818916_Mechanistic_Understanding_of_a_Robust_and_Scalable_Synthesis_of_Per6-deoxy-6-halocyclodextrins_Versatile_Intermediates_for_Cyclodextrin_Modification","344078942_Exploration_of_continuous_flow_benchtop_NMR_acquisition_parameters_and_considerations_for_reaction_monitoring","343000236_Automation_of_Synthesis_in_Medicinal_Chemistry_Progress_and_Challenges"]}