{"id":"355686876_IRA_A_Shape_Matching_Approach_for_Recognition_and_Comparison_of_Generic_Atomic_Patterns","abstract":"We propose a versatile, parameter-less approach for solving the shape matching problem, specifically in the context of atomic structures when atomic assignments are not known a priori. The algorithm Iteratively suggests Rotated atom-centered reference frames and Assignments (iterative rotations and assignments (IRA)). The frame for which a permutationally invariant set-set distance, namely, the Hausdorff distance, returns a minimal value is chosen as the solution of the matching problem. IRA is able to find rigid rotations, reflections, translations, and permutations between structures with different numbers of atoms, for any atomic arrangement and pattern, periodic or not. When distortions are present between the structures, optimal rotation and translation are found by further applying a standard singular value decomposition-based method. To compute the atomic assignments under the one-to-one assignment constraint, we develop our own algorithm, constrained shortest distance assignments (CShDA). The overall approach is extensively tested on several structures, including distorted structural fragments. The efficiency of the proposed algorithm is shown as a benchmark comparison against two other shape matching algorithms. We discuss the use of our approach for the identification and comparison of structures and structural fragments through two examples: a replica-exchange trajectory of a cyanine molecule, in which we show how our approach could aid the exploration of relevant collective coordinates for clustering the data, and a SiO2 amorphous model, in which we compute distortion scores, and compare them with a classical strain-based potential. The source code and benchmark data are available at https://github.com/mammasmias/IterativeRotationsAssignments.","authors":["Miha Gunde","Nicolas Salles","Anne Hemeryck","Layla Martin-Samos"],"meta":["October 2021Journal of Chemical Information and Modeling 61(11)","DOI:10.1021/acs.jcim.1c00567"],"references":["342280479_The_quaternion-based_spatial-coordinate_and_orientation-frame_alignment_problems","331854683_Unraveling_the_molecular_mechanisms_of_color_expression_in_anthocyanins","331494522_RMSD_and_Symmetry","319300733_Optimal_Alignment_of_Structures_for_Finite_and_Periodic_Systems","316047383_ArbAlign_A_Tool_for_Optimal_Alignment_of_Arbitrarily_Ordered_Isomers_Using_the_Kuhn-Munkres_Algorithm","350846977_Development_of_a_Structural_Comparison_Method_to_Promote_Exploration_of_the_Potential_Energy_Surface_in_the_Global_Optimization_of_Nanoclusters","349005058_Exploration_and_Optimization_in_Crystal_Structure_Prediction_Combining_Basin_Hopping_with_Quasi-Random_Sampling","336314936_A_universal_algorithm_for_finding_the_shortest_distance_between_systems_of_points","334137672_Electronic_shells_of_a_tubular_Au26_cluster_a_cage-cage_superatomic_molecule_based_on_spherical_aromaticity","330818857_BCLMolAlign_Three-Dimensional_Small_Molecule_Alignment_for_Pharmacophore_Mapping"]}