{"id":"355780009_Artificial_Intelligence_Based_Body_Sensor_Network_Framework-Narrative_Review_Proposing_an_End-to-End_Framework_using_Wearable_Sensors_Real-Time_Location_Systems_and_Artificial_IntelligenceMachine_Lear","abstract":"With the rising amount of data in the sports and health sectors, a plethora of applications using big data mining have become possible. Multiple frameworks have been proposed to mine, store, preprocess, and analyze physiological vitals data using artificial intelligence and machine learning algorithms. Comparatively, less research has been done to collect potentially high volume, high-quality ‘big data’ in an organized, time-synchronized, and holistic manner to solve similar problems in multiple fields. Although a large number of data collection devices exist in the form of sensors. They are either highly specialized, univariate and fragmented in nature or exist in a lab setting. The current study aims to propose artificial intelligence-based body sensor network framework (AIBSNF), a framework for strategic use of body sensor networks (BSN), which combines with real-time location system (RTLS) and wearable biosensors to collect multivariate, low noise, and high-fidelity data. This facilitates gathering of time-synchronized location and physiological vitals data, which allows artificial intelligence and machine learning (AI/ML)-based time series analysis. The study gives a brief overview of wearable sensor technology, RTLS, and provides use cases of AI/ML algorithms in the field of sensor fusion. The study also elaborates sample scenarios using a specific sensor network consisting of pressure sensors (insoles), accelerometers, gyroscopes, ECG, EMG, and RTLS position detectors for particular applications in the field of health care and sports. The AIBSNF may provide a solid blueprint for conducting research and development, forming a smooth end-to-end pipeline from data collection using BSN, RTLS and final stage analytics based on AI/ML algorithms.","authors":["Ashwin Phatak","Daniel Memmert","Franz-Georg Wieland","Frederik Volkmar"],"meta":["December 2021Sports Medicine - Open 7(1)","DOI:10.1186/s40798-021-00372-0"],"references":["353234790_The_Role_of_Veracity_on_the_Load_Monitoring_of_Professional_Soccer_Players_A_Systematic_Review_in_the_Face_of_the_Big_Data_Era","349465530_Validation_of_Player_and_Ball_Tracking_with_a_Local_Positioning_System","344353427_Pattern_Recognition_in_Multivariate_Time_Series_Towards_an_Automated_Event_Detection_Method_for_Smart_Manufacturing_Systems","343699178_Traditional_Chinese_Medicine_Pulse_Diagnosis_on_a_Smartphone_Using_Skin_Impedance_at_Acupoints_A_Feasibility_Study","342418280_Sport_Biomechanics_Applications_Using_Inertial_Force_and_EMG_Sensors_A_Literature_Overview","341393197_Validation_of_a_Real-Time_Locating_System_for_Contact_Tracing_of_Healthcare_Workers_during_the_COVID-19_Pandemic_in_Singapore_Preprint","348076177_Wearable_sensors_At_the_frontier_of_personalised_health_monitoring_smart_prosthetics_and_assistive_technologies","343973948_Stretchable_piezoelectric_energy_harvesters_and_self-powered_sensors_for_wearable_and_implantable_devices","343025583_Stretchable_respiration_sensors_Advanced_designs_and_multifunctional_platforms_for_wearable_physiological_monitoring","341096228_mm-Pose_Real-Time_Human_Skeletal_Posture_Estimation_using_mmWave_Radars_and_CNNs"]}