{"id":"355762010_Probabilistic_Machine_Learning_Estimation_of_Ocean_Mixed_Layer_Depth_From_Dense_Satellite_and_Sparse_In_Situ_Observations","abstract":"The ocean mixed layer plays an important role in the coupling between the upper ocean and atmosphere across a wide range of time scales. Estimation of the variability of the ocean mixed layer is therefore important for atmosphere‐ocean prediction and analysis. The increasing coverage of in situ Argo profile data allows for an increasingly accurate analysis of the mixed layer depth (MLD) variability associated with deviations from the seasonal climatology. However, sampling rates are not sufficient to fully resolve subseasonal (<90 $< 90$ day) MLD variability. Yet, many multivariate observations‐based analyses include implicit modeled subseasonal MLD variability. One analysis method is optimal interpolation of in situ data, but the interior analysis can be improved by leveraging surface data with regression or variational approaches. Here, we demonstrate how machine learning methods and satellite sea surface temperature, salinity, and height facilitate MLD estimation in a pilot study of two regions: the mid‐latitude southern Indian and the eastern equatorial Pacific Oceans. We construct multiple machine learning architectures to produce weekly 1/2° gridded MLD anomaly fields (relative to a monthly climatology) with uncertainty estimates. We test multiple traditional and probabilistic machine learning techniques to compare both accuracy and probabilistic calibration. We validate our methodology by applying it to ocean model simulations. We find that incorporating sea surface data through a machine learning model improves the performance of spatiotemporal MLD variability estimation compared to optimal interpolation of Argo observations alone. These preliminary results are a promising first step for the application of machine learning to MLD prediction.","authors":["Dallas Foster","David John Gagne","Daniel B. Whitt"],"meta":["December 2021Journal of Advances in Modeling Earth Systems 13(12)","DOI:10.1029/2021MS002474"],"references":["352761427_Sub-Seasonal_Forecasting_With_a_Large_Ensemble_of_Deep-Learning_Weather_Prediction_Models","346036500_On_the_control_of_subantarctic_stratification_by_the_ocean_circulation","343034662_Deeply_uncertain_comparing_methods_of_uncertainty_quantification_in_deep_learning_algorithms","340932385_Machine_Learning-Based_Prediction_of_Spatiotemporal_Uncertainties_in_Global_Wind_Velocity_Reanalyses","339348189_Machine_Learning_for_Stochastic_Parameterization_Generative_Adversarial_Networks_in_the_Lorenz'96_Model","339051233_Calibration_of_probability_predictions_from_machine-learning_and_statistical_models","336398161_Global_Impacts_of_Subseasonal","351254586_Modulation_of_Cross-Isothermal_Velocities_with_ENSO_in_the_Tropical_Pacific_Cold_Tongue","349195593_Sub-seasonal_forecasting_with_a_large_ensemble_of_deep-learning_weather_prediction_models","345658303_Bayesian_Data_Analysis"]}