{"id":"355710731_A_novel_top-_k_key_node_query_problem_in_subgraph_matching_and_its_greedy_strategy","abstract":"Top-k node selection in graph data is an essential problem in computer science and applications. In view of an important issue in the field of graph data, subgraph matching issue, we define the problem and propose its method for the top-k key node query w.r.t. the subgraph matching. Unlike the general top-k query problem, we aim to find out k nodes that make the matching subgraphs in data graph G that are covered by the k nodes as more as possible. This is a problem of the maximum coverage of subgraph matching, which belongs to the NP-hard problem. We study the problem based on a greedy algorithm and give an intuitive solution. Considering the characteristics of the top-k problem, we propose an improved and more efficient greedy algorithm. Experiments on real social network graph data set (Twitter) show that the related results represent the key nodes that can better reveal the essential characteristics of the query graph in the data graph G. The key node query problem in subgraph matching proposed in this article may have extensive applications in reality, such as the assessment of the influence of specific group members in social network, the detection of abnormal communication in a computer communication network, the road traffic evaluation and load balance problem in a road traffic network, and so on.","authors":["Zhengyuan Xue"],"meta":["October 2021Engineering Reports","DOI:10.1002/eng2.12469"],"references":["337922923_TKG_Efficient_Mining_of_Top-K_Frequent_Subgraphs","301444822_Detection_of_Top-K_Central_Nodes_in_Social_Networks_A_Compressive_Sensing_Approach","342539588_Mining_Top-_k_pairs_of_correlated_subgraphs_in_a_large_network","333863361_Efficient_Subgraph_Matching_Harmonizing_Dynamic_Programming_Adaptive_Matching_Order_and_Failing_Set_Together","330629107_Distributed_Top-k_Subgraph_Matching_in_A_Big_Graph","329594678_Top-k_Subgraph_Query_Based_on_Frequent_Structure_in_Large-Scale_Dynamic_Graphs","304878246_Fast_Top-K_Path-Based_Relevance_Query_on_Massive_Graphs","304456568_Fast_top-k_search_in_knowledge_graphs","304021399_Diversified_Top-k_Subgraph_Querying_in_a_Large_Graph","289571088_Efficient_and_Exact_Local_Search_for_Random_Walk_Based_Top-K_Proximity_Query_in_Large_Graphs","277895445_Taming_Subgraph_Isomorphism_for_RDF_Query_Processing","282701175_Fast_and_exact_top-k_algorithm_for_PageRank","282276610_Locality-sensitive_and_Re-use_Promoting_Personalized_PageRank_computations","276519986_FrogWild","276481460_Efficient_processing_of_graph_similarity_search"]}