{"id":"355769593_A_polynomial_time_and_space_heuristic_algorithm_for_T-count","abstract":"An important part of reaping computational advantage from a quantum computer is to reduce the quantum resources needed to implement a desired quantum algorithm. Quantum algorithms that are too large to be practical on noisy intermediate scale quantum (NISQ) devices will require fault-tolerant error correction. This work focuses on reducing the physical cost of implementing quantum algorithms when using the state-of-the-art fault-tolerant quantum error correcting codes, in particular, those for which implementing the $\\T$ gate consumes vastly more resources than the other gates in the gate set.\n\nMore specifically, in this paper we consider the group of unitaries that can be exactly implemented by a quantum circuit consisting of the Clifford+T gate set. The Clifford+T gate set is a universal gate set and in this group, using state-of-the-art surface codes, the T gate is by far the most expensive component to implement fault-tolerantly. So it is important to minimize the number of T gates necessary for a fault-tolerant implementation. Our primary interest is to compute a circuit for a given $n$-qubit unitary $U$, using the minimum possible number of T gates (called the T-count of unitary $U$). We consider the problem COUNT-T, the optimization version of which aims to find the T-count of $U$. In its decision version the goal is to decide if the T-count is at most some positive integer $m$. Given an oracle for COUNT-T, we can compute a T-count-optimal circuit in time polynomial in the T-count and dimension of $U$. We give a provable classical algorithm that solves COUNT-T (decision) in time $O\\left(N^{2(c-1)\\lceil\\frac{m}{c}\\rceil}\\poly(m,N)\\right)$ and space $O\\left(N^{2\\lceil\\frac{m}{c}\\rceil}\\poly(m,N)\\right)$, where $N=2^n$ and $c\\geq 2$. This gives a space-time trade-off for solving this problem with variants of meet-in-the-middle techniques. We also introduce an asymptotically faster multiplication method that shaves a factor of $N^{0.7457}$ off of the overall complexity.\n\nLastly, beyond our improvements to the rigorous algorithm, we give a heuristic algorithm that outputs a T-count-optimal circuit and has space and time complexity $\\poly(m,N)$, under some assumptions. In our heuristic algorithm we developed a novel way of pruning the search space. \nWhile our heuristic method still scales exponentially with the number of qubits (though with a lower exponent), there is a large improvement by going from exponential to polynomial scaling with $m$.\nWe implemented our heuristic algorithm with up to 4 qubit unitaries and obtained a significant improvement in time. For all benchmark and random unitaries we studied, the T-count returned by our algorithm is at most the T-count of their circuits shown in previous papers.","authors":["Michele Mosca","Priyanka Mukhopadhyay"],"meta":["January 2022Quantum Science and Technology 7(1):015003","DOI:10.1088/2058-9565/ac2d3a"],"references":["352667245_Optimal_two-qubit_circuits_for_universal_fault-tolerant_quantum_computation","350146564_T-Count_Optimized_Quantum_Circuit_Designs_for_Single-Precision_Floating-Point_Division","319952718_Halving_the_cost_of_quantum_addition","304351044_Parallelizing_quantum_circuit_synthesis","300576269_Fast_Matrix_Multiplication","346548751_Quantum_circuit_designs_of_carry_lookahead_adder_optimized_for_T-count_T-depth_and_qubits","329135482_Quantum_Circuit_Design_of_A_T-count_Optimized_Integer_Multiplier","321571158_An_Efficient_Quantum_Compiler_that_reduces_T_count","301874827_Improved_Classical_Simulation_of_Quantum_Circuits_Dominated_by_Clifford_Gates","301856641_T-Count_Optimization_and_Reed-Muller_Codes"]}