{"id":"355720817_singlecellVR_Interactive_Visualization_of_Single-Cell_Data_in_Virtual_Reality","abstract":"Single-cell assays have transformed our ability to model heterogeneity within cell populations. As these assays have advanced in their ability to measure various aspects of molecular processes in cells, computational methods to analyze and meaningfully visualize such data have required matched innovation. Independently, Virtual Reality (VR) has recently emerged as a powerful technology to dynamically explore complex data and shows promise for adaptation to challenges in single-cell data visualization. However, adopting VR for single-cell data visualization has thus far been hindered by expensive prerequisite hardware or advanced data preprocessing skills. To address current shortcomings, we present singlecellVR, a user-friendly web application for visualizing single-cell data, designed for cheap and easily available virtual reality hardware (e.g., Google Cardboard, ∼$8). singlecellVR can visualize data from a variety of sequencing-based technologies including transcriptomic, epigenomic, and proteomic data as well as combinations thereof. Analysis modalities supported include approaches to clustering as well as trajectory inference and visualization of dynamical changes discovered through modelling RNA velocity. We provide a companion software package, scvr to streamline data conversion from the most widely-adopted single-cell analysis tools as well as a growing database of pre-analyzed datasets to which users can contribute.","authors":["David F. Stein","Huidong Chen","Michael E. Vinyard","Qian Qin"],"meta":["October 2021Frontiers in Genetics 12:764170","DOI:10.3389/fgene.2021.764170"],"references":["352857927_Exploration_and_analysis_of_molecularly_annotated_3D_models_of_breast_cancer_at_single-cell_resolution_using_virtual_reality","352011871_Integrated_analysis_of_multimodal_single-cell_data","350780630_Simultaneous_trimodal_single-cell_measurement_of_transcripts_epitopes_and_chromatin_accessibility_using_TEA-seq","350380037_Genome-wide_molecular_recording_using_Live-seq","345652444_A_comparison_of_single-cell_trajectory_inference_methods_Towards_more_accurate_and_robust_tools","344667212_vLUME_3D_virtual_reality_for_single-molecule_localization_microscopy","353364024_Single-cell_analysis_enters_the_multiomics_age","351862562_Characterizing_spatial_gene_expression_heterogeneity_in_spatially_resolved_single-cell_transcriptomic_data_with_nonuniform_cellular_densities","351641506_A_taxonomy_of_transcriptomic_cell_types_across_the_isocortex_and_hippocampal_formation","347205728_Chromatin_Potential_Identified_by_Shared_Single-Cell_Profiling_of_RNA_and_Chromatin"]}