{"id":"355831868_Proficiency_amidst_COVID-19_challenges_in_developing_computer_programs_An_outcomes-based_approach_in_discrete_structures","abstract":"The educational system has been greatly affected by the COVID-19 pandemic which lead to the cancellation of face-to-face classes from different learning institutions in the whole world. Using the descriptive and phenomenological approach, this study determined the programming proficiency level of sophomore computer science students where laboratories were not available and online classes through learning management system was just one of the options to deliver the lessons to the students. It determined the proficiency level of the students across the four indicators (program design, program execution, specification satisfaction and coding structures). Findings revealed that the students have an “advanced skills in computer programming and application” across the different evaluative indicators. It was also found out that the proficiency levels of students based from their groupings do not vary which gave meaningful output of their project. It further manifested that their main concerns or problems in developing the programs are lack of programming skills, insufficient knowledge in programming, weak internet connection, communication barriers among members and the passive participation of members of the group.","authors":["Mario Oli"],"meta":["October 2021","DOI:10.21744/lingcure.v5nS3.1593"],"references":["343219008_Programming_Competencies_of_Filipino_Information_Technology_Students_Inputs_to_Improving_Instructional_Processes","321471683_Collaboration_as_a_Strategy_for_Poverty_Alleviation","257716774_Major_Problems_in_Basic_Programming_that_Influence_Student_Performance","355837994_Research_and_extension_completed_and_on-going_registered_programs_database_system_RECORDS","333878360_Education_and_Training_Improve_Quality_of_Life_and_Decrease_Depression_Score_in_Elderly_Population","327819026_Barriers_to_Food_Literacy_A_Conceptual_Model_to_Explore_Factors_Inhibiting_Proficiency","271388365_Intersecting_families_of_discrete_structures_are_typically_trivial","256380006_On_the_optimization_of_discrete_structures_with_aeroelastic_constraints","256258084_A_relation_between_Bernoulli_numbers","232598650_The_Relation_between_Interest_Congruence_and_Satisfaction_A_Metaanalysis"]}