{"id":"355894332_Experimental_relativistic_zero-knowledge_proofs","abstract":"Protecting secrets is a key challenge in our contemporary information-based era. In common situations, however, revealing secrets appears unavoidable; for instance, when identifying oneself in a bank to retrieve money. In turn, this may have highly undesirable consequences in the unlikely, yet not unrealistic, case where the bank’s security gets compromised. This naturally raises the question of whether disclosing secrets is fundamentally necessary for identifying oneself, or more generally for proving a statement to be correct. Developments in computer science provide an elegant solution via the concept of zero-knowledge proofs: a prover can convince a verifier of the validity of a certain statement without facilitating the elaboration of a proof at all1. In this work, we report the experimental realization of such a zero-knowledge protocol involving two separated verifier–prover pairs2. Security is enforced via the physical principle of special relativity3, and no computational assumption (such as the existence of one-way functions) is required. Our implementation exclusively relies on off-the-shelf equipment and works at both short (60 m) and long distances (≥400 m) in about one second. This demonstrates the practical potential of multi-prover zero-knowledge protocols, promising for identification tasks and blockchain applications such as cryptocurrencies or smart contracts4. A zero-knowledge proof, which can be used to verify secret information, is reported here with security that is enforced by the laws of special relativity.","authors":["Pouriya Alikhani","Nicolas Brunner","Claude Crépeau","Sébastien Designolle"],"meta":["November 2021Nature 599(7883):47-50","DOI:10.1038/s41586-021-03998-y"],"references":["336744162_Quantum_supremacy_using_a_programmable_superconducting_processor","286668243_Zerocash_Decentralized_Anonymous_Payments_from_Bitcoin","347878207_Introduction_to_Modern_Cryptography","336402471_Multi-prover_interactive_proofs_how_to_remove_intractability_assumptions","336393160_The_knowledge_complexity_of_interactive_proof-systems","323130140_On_the_Einstein_Podolsky_Rosen_paradox","319683742_Post-quantum_cryptography","315858797_Relativistic_or_2-Prover_1-Round_Zero-Knowledge_Protocol_for_mathsf_NP_Secure_Against_Quantum_Adversaries","303494300_24-Hour_Relativistic_Bit_Commitment","273674251_The_Knowledge_Complexity_of_Interactive_Proof_Systems","268525152_Practical_Relativistic_Bit_Commitment","263474953_A_zero-knowledge_protocol_for_nuclear_warhead_verification","262246835_Cryptography_Miracles_Secure_Auctions_Matching_Problem_Verification","257749257_Binary_Constraint_System_Games_and_Locally_Commutative_Reductions","256441213_Optimal_Ternary_Cyclic_Codes_with_Minimum_Distance_Four_and_Five"]}