{"id":"355809282_An_Application_of_Data_Mining_Algorithms_for_Analyzing_Psychological_Researches","abstract":"Computer science has evolved to become the basis for evolution and entered into all areas of life where the use of computer has been developed in all scientific, military, commercial and health institutions. In addition, it has been applied in residential and industrial projects due to the high capacity and ability to achieve goals in a shorter time and less effort. In this research, the computer, its branches, and algorithms will be invested in the psychological field. In general, in psychological fields, a questionnaire model is created according to the requirements of the research topic. The model contains many questions that are answered by the individuals of the sample space chosen by the researcher. Often, these questions are long and tedious, and some questions are repeated and not useful. In this research, we will work on summarizing these forms without effecting their research results; eventually, these steps in the proposed approach will produce better forms. However, it leads to building a method using the Apriori algorithm and Association rule mining which, consequently, applies to each questionnaire from which unnecessary questions are to be removed.","authors":["Tareef Kamil Mustafa","Manar Abbas"],"meta":["October 2021Iraqi Journal of Science 62(10):3705-3718","DOI:10.24996/ijs.2021.62.10.29","Project: Hybrid algorithms in data mining"],"references":["340131244_Application_of_Data_Mining_in_Cultivation_of_Student_Mental_Health","338440522_Exploring_Pattern_Mining_Algorithms_for_Hashtag_Retrieval_Problem","334326675_Principles_Approaches_and_Challenges_of_Applying_Big_Data_in_Safety_Psychology_Research","331275391_TEXT_MINING_AUTHORSHIP_DETECTION_METHODS_DEVELOPMENT","330761376_Improve_Performance_of_Association_Rule-Based_Collaborative_Filtering_Recommendation_Systems_using_Genetic_Algorithm","329504863_Proposed_Approach_for_Analysing_General_Hygiene_Information_Using_Various_Data_Mining_Algorithms","339205484_Visual_Association_Rules_on_the_Psychological_Connection_of_University_Students_with_their_Studies","320148775_Positive_and_Negative_Association_Rules_Mining_for_Mental_Health_Analysis_of_College_Students"]}