{"id":"355944584_Developing_a_Hybrid_Model_to_Predict_Student_First_Year_Retention_in_STEM_Disciplines_Using_Machine_Learning_Techniques","abstract":"Understanding the reasons behind the low enrollment and retention\nrates of Underrepresented Minority (URM) students (African\nAmericans, Hispanic Americans, and Native Americans) in the disciplines\nof science, technology, engineering, and mathematics (STEM)\nhas concerned researchers for decades. Statistics show that students\nof color have higher attrition rates compared with other groups, although\nthis trend has been decreasing over the past twenty years\n(Besterfield-Sacre, Atman, & Shuman, 1997; Mitchell & Daniel,\n2007; Fleming, Ledbetter, Williams, & McCain, 2008). These groups\ntend to enroll in STEM majors in small numbers and leave in higher\nnumbers (Urban, Reyes, & Anderson-Rowland, 2002; Alkasawneh\n& Hobson, 2009).\nIncreasing the number of minorities (women and ethnic groups)\nis a practical way of increasing the workforce pool in STEM fields\nwhere white male representation is still dominant. Unfortunately,\nthis solution is difficult for many institutions. Only two out of five\nAfrican American and/or Hispanic American students remain in their\nmajors and receive bachelor’s degrees in a STEM discipline nationwide\n(Markley, 2005). In order to impact workforce demographics,\nthe population of students choosing STEM majors must change. The\nliterature reflects a substantial interest in increasing URM student retention\nin higher education (Sidle & McReynolds, 1999; Nave, Frizell,\nObiomon, Cui, & Perkins, 2006; Hargrove & Burge, 2002). Retention\nis of significant interest because of its positive impact on college reputation\nand workforce demographics (Williford & Schaller, 2005).\nSeveral studies emphasize the importance of identifying college\nstudents with higher risk of dropping out in early stages in order to\nallocate the available resources based upon student needs (Herzog,\n2006; Lin, Imbrie, & Reid, 2009). Research by Zhang, Anderson, Ohland,\nCarter, & Thorndyke (2002) stated that identifying factors that\naffect student retention could play an effective role in the counseling\nand advising process for engineering students. This equips institutions\nto utilize their available resources based upon those groups’\nneeds (Herzog, 2006). Traditional methods of statistical analysis\nhave been used to predict student retention, such as logistic regression\n(Gaskins, 2009). Recently, research has focused on data mining\ntechniques to study student retention in higher education (Brown,\n2007). These techniques are highly accurate, robust with missing\ndata, and do not need to be built on a hypothesis. Data mining is\ndefined as recognizing patterns in a large set of data and then trying\nto understand those patterns.","authors":["Ruba Alkhasawneh","Rosalyn Hobson"],"meta":["November 2021"],"references":["293083836_Engineering_students_define_diversity_An_uncommon_thread","345924979_Evaluation_Of_Retention_And_Other_Benefits_Of_A_Fifteen_Year_Residential_Bridge_Program_For_Underrepresented_Engineering_Students","321619684_Rethinking_Engineering_Education_The_CDIO_Approach","312900327_Student_involvement_A_developmental_theory_for_higher_education","308926748_Designing_Qualitative_Research","305166663_Dropout_from_Higher_Education_A_Theoretical_Synthesis_of_Recent_Research","280939946_Engineering_Education_Research_and_Development_in_Curriculum_and_Instruction","275636007_Assessment_for_Excellence_The_Philosophy_and_Practice_of_Assessment_and_Evaluation_in_Higher_Education","273672097_Suicide_A_Study_in_Sociology","272177779_Student_Variables_That_Predict_Retention_Recent_Research_and_New_Developments"]}