{"id":"356058062_Adiabatic_quantum_linear_regression","abstract":"A major challenge in machine learning is the computational expense of training these models. Model training can be viewed as a form of optimization used to fit a machine learning model to a set of data, which can take up significant amount of time on classical computers. Adiabatic quantum computers have been shown to excel at solving optimization problems, and therefore, we believe, present a promising alternative to improve machine learning training times. In this paper, we present an adiabatic quantum computing approach for training a linear regression model. In order to do this, we formulate the regression problem as a quadratic unconstrained binary optimization (QUBO) problem. We analyze our quantum approach theoretically, test it on the D-Wave adiabatic quantum computer and compare its performance to a classical approach that uses the Scikit-learn library in Python. Our analysis shows that the quantum approach attains up to $${2.8 \\times }$$ 2.8 × speedup over the classical approach on larger datasets, and performs at par with the classical approach on the regression error metric. The quantum approach used the D-Wave 2000Q adiabatic quantum computer, whereas the classical approach used a desktop workstation with an 8-core Intel i9 processor. As such, the results obtained in this work must be interpreted within the context of the specific hardware and software implementations of these machines.","authors":["Prasanna Date","Thomas E Potok"],"meta":["November 2021Scientific Reports 11(1)","DOI:10.1038/s41598-021-01445-6"],"references":["354357872_Balanced_k-means_clustering_on_an_adiabatic_quantum_computer","351486637_QUBO_formulations_for_training_machine_learning_models","338083201_Combinatorial_Neural_Network_Training_Algorithm_for_Neuromorphic_Computing","337011758_Least-squares_solutions_to_polynomial_systems_of_equations_with_quantum_annealing","334490779_Quantum_annealing_for_systems_of_polynomial_equations","331537269_Efficiently_embedding_QUBO_problems_on_adiabatic_quantum_computers","330831903_A_Classical-Quantum_Hybrid_Approach_for_Unsupervised_Probabilistic_Machine_Learning","330494626_Realizing_quantum_linear_regression_with_auxiliary_qumodes","329022008_Simulated_versus_reduced_noise_quantum_annealing_in_maximum_independent_set_solution_to_wireless_network_scheduling","329842882_Analyzing_the_Quantum_Annealing_Approach_for_Solving_Linear_Least_Squares_Problems_13th_International_Conference_WALCOM_2019_Guwahati_India_February_27_-_March_2_2019_Proceedings"]}