{"id":"356086330_An_Experimental_and_Algorithm_Research_on_the_Influence_of_OTO_Teaching_Mode_on_College_Students'_PE_Learning_Interest_Based_on_Cloud_Computing","abstract":"Algorithm is a step of problem-solving, and algorithm can be defined as any special method for solving a certain type of problem. In computer science, algorithms are described in computer algorithm language and represent accurate and effective methods for solving a class of problems with computers. In order to verify the role of the OTO teaching mode from the perspective of cultivating learning interest and to provide a practical basis for the reform of physical education in colleges and universities, 107 second-year physical education majors in a common university were selected as experimental subjects and divided into an experimental group and a control group, and the two groups were intervened through a 16-week experiment. Multivariate covariance was used to analyze the influence of two teaching modes on college students' interest in sports learning. After excluding factors such as student gender, physical exercise behavior stage, football learning experience, and physical health, the groups have statistical significance in the four dimensions of positivity, skill learning, extracurricular activities, and negativity in sports learning interest. However, there is no significant difference in the influence of sports attention on sports learning interest. The research proves that the application of OTO teaching mode is conducive to promoting students' learning positivity, technical learning, and extracurricular activities and alleviating students' negative learning emotions. The degree of attention to sports in the interest of sports learning is not very significant. It is suggested that colleges and universities adopt the OTO teaching mode in the teaching of general football courses.","authors":["Shijun Wu","Jianghong Dai","Jiujiu Yang"],"meta":["November 2021Scientific Programming 2021(3)","DOI:10.1155/2021/2042158"],"references":["223832634_Interest_A_unique_motivational_variable"]}