{"id":"356148149_Dynamics_of_online_hate_and_misinformation","abstract":"Online debates are often characterised by extreme polarisation and heated discussions among users. The presence of hate speech online is becoming increasingly problematic, making necessary the development of appropriate countermeasures. In this work, we perform hate speech detection on a corpus of more than one million comments on YouTube videos through a machine learning model, trained and fine-tuned on a large set of hand-annotated data. Our analysis shows that there is no evidence of the presence of “pure haters”, meant as active users posting exclusively hateful comments. Moreover, coherently with the echo chamber hypothesis, we find that users skewed towards one of the two categories of video channels (questionable, reliable) are more prone to use inappropriate, violent, or hateful language within their opponents’ community. Interestingly, users loyal to reliable sources use on average a more toxic language than their counterpart. Finally, we find that the overall toxicity of the discussion increases with its length, measured both in terms of the number of comments and time. Our results show that, coherently with Godwin’s law, online debates tend to degenerate towards increasingly toxic exchanges of views.","authors":["Matteo Cinelli","Andraž Pelicon","Igor Mozetič","Walter Quattrociocchi"],"meta":["November 2021Scientific Reports 11(1)","DOI:10.1038/s41598-021-01487-w","Project: IMSyPP - Innovative Monitoring Systems and Prevention Policies of Online Hate Speech"],"references":["349544736_The_echo_chamber_effect_on_social_media","347233464_Transformers_State-of-the-Art_Natural_Language_Processing","346243677_Hate_begets_Hate_A_Temporal_Study_of_Hate_Speech","346165430_Affective_polarization_local_contexts_and_public_opinion_in_America","346110180_Fanning_the_Flames_of_Hate_Social_Media_and_Hate_Crime","345395986_SemEval-2019_Task_6_Identifying_and_Categorizing_Offensive_Language_in_Social_Media_OffensEval","355430025_SemEval-2020_Task_12_Multilingual_Offensive_Language_Identification_in_Social_Media_OffensEval_2020","351390272_Partisan_Polarization_Is_the_Primary_Psychological_Motivation_behind_Political_Fake_News_Sharing_on_Twitter","348400263_Trumping_Hate_on_Twitter_Online_Hate_Speech_in_the_2016_US_Election_Campaign_and_its_Aftermath","345427032_Overview_of_the_EVALITA_2018_Hate_Speech_Detection_Task"]}