{"id":"356242382_Variants_of_derivation_modes_for_which_catalytic_P_systems_with_one_catalyst_are_computationally_complete","abstract":"Catalytic P systems are among the first variants of membrane systems ever considered in this area. This variant of systems also features some prominent computational complexity questions, and in particular the problem of using only one catalyst: is one catalyst enough to allow for generating all recursively enumerable sets of multisets? Several additional ingredients have been shown to be sufficient for obtaining even computational completeness with only one catalyst. Last year we could show that the derivation mode $$max_{objects}$$ m a x objects , where we only take those multisets of rules which affect the maximal number of objects in the underlying configuration one catalyst is sufficient for obtaining computational completeness without any other ingredients. In this paper we follow this way of research and show that one catalyst is also sufficient for obtaining computational completeness when using specific variants of derivation modes based on non-extendable multisets of rules: we only take those non-extendable multisets whose application yields the maximal number of generated objects or else those non-extendable multisets whose application yields the maximal difference in the number of objects between the newly generated configuration and the current configuration. A similar computational completeness result can even be obtained when omitting the condition of non-extendability of the applied multisets when taking the maximal difference of objects or the maximal number of generated objects. Moreover, we reconsider simple P system with energy control—both symbol and rule energy-controlled P systems equipped with these new variants of derivation modes yield computational completeness.","authors":["Artiom Alhazov","Rudolf Freund","Sergiu Ivanov","Sergey Verlan"],"meta":["December 2021Journal of Membrane Computing 3(3)","DOI:10.1007/s41965-021-00085-z"],"references":["353672318_When_catalytic_P_systems_with_one_catalyst_can_be_computationally_complete","349805299_P_systems_with_limited_number_of_objects","337842281_How_derivation_modes_and_halting_conditions_may_influence_the_computational_power_of_P_systems","334858150_Variants_of_P_systems_with_activation_and_blocking_of_rules","319220387_Tissue_P_Systems_with_Vesicles_of_Multisets","313806055_P_Systems_Working_in_Maximal_Variants_of_the_Set_Derivation_Mode","344520881_Regulated_Rewriting_in_Formal_Language_Theory","333473540_Variants_of_Spiking_Neural_P_Systems_with_Energy_Control","321613068_Handbook_of_Formal_Languages_Volume_1_Word_Language_Grammar","300111779_On_the_Power_of_Catalytic_P_Systems_with_One_Catalyst","279292707_Catalytic_and_Purely_Catalytic_P_Systems_and_P_Automata_Control_Mechanisms_for_Obtaining_Computational_Completeness","273945968_P_Systems_with_Anti-Matter","273945962_P_Systems_with_Toxic_Objects","268609752_Membrane_Computing_An_Introduction","268054690_Regulated_rewriting_in_formel_language_theory"]}