{"id":"356210651_Implementasi_K-Nearest_Neighbor_Dalam_Prediksi_Mahasiswa_Berhenti_Kuliah","abstract":"A student is a student who sits and is registered in one of the universities, both public and private, being a student is the dream of many students around the world and being a student is the starting gate to determine someone will be in the world of science in what field, be it computer science, medicine, world of education and others. However, there are many reasons why students decide to stop attending lectures suddenly due to several factors, both external and internal factors. This causes its own losses that will be faced by the campus, one of which is the reduction in the quantity of student data and resulting in data accumulation, it is necessary to predict students who have the potential to stop studying unilaterally by looking at several criteria and digging up information on the data of students who have the potential to quit college by applying the K-algorithm. NN. In this study, the K-NN algorithm records old data and sees similarities to new data in an effort to recognize patterns of students dropping out of college, the results obtained from new lecture data show that the data is similar to the old data of students who dropped out of college with the closest similarity of values from other cases, namely 17 .3815 with 19.98875 so that the results obtained by the new data student decision decided the possibility of dropping out of college","authors":["Yunita Yunita"],"meta":["July 2021JURNAL MEDIA INFORMATIKA BUDIDARMA 5(3):866","DOI:10.30865/mib.v5i3.3049"],"references":["338672379_PENERAPAN_ALGORITMA_C45_PADA_KLASIFIKASI_POTENSI_SISWA_DROP_OUT","320652854_A_comparative_study_of_MFCC-KNN_and_LPC-KNN_for_hijaiyyah_letters_pronounciation_classification_system","341969959_Comparison_of_Accuracy_Level_of_Support_Vector_Machine_SVM_and_K-Nearest_Neighbors_KNN_Algorithms_in_Predicting_Heart_Disease","338672402_ANALISA_TESTIMONIAL_DENGAN_MENGGUNAKAN_ALGORITMA_TEXT_MINING_DAN_TERM_FREQUENCY-_INVERSE_DOCUMENT_FREQUENCE_TF-IDF_PADA_TOKO_ALLMEEART","338255614_Unobtrusive_monitoring_of_behavior_and_movement_patterns_to_detect_clinical_depression_severity_level_via_smartphone","328072151_ANALISIS_HAMBATAN_BELAJAR_MAHASISWA_PADA_MATA_KULIAH_STATISTIKA","326778814_A_novel_ensemble_method_for_k_-nearest_neighbor"]}