{"id":"356337021_Researching_Race_in_Mathematics_Education","abstract":"Background\nWithin mathematics education research, policy, and practice, race remains undertheorized in relation to mathematics learning and participation. Although race is characterized in the sociological and critical theory literatures as socially and politically constructed with structural expressions, most studies of differential outcomes in mathematics education begin and end their analyses of race with static racial categories and group labels used for the sole purpose of disaggregating data. This inadequate framing is, itself, reflective of a racialization process that continues to legitimize the social devaluing and stigmatization of many students of color. I draw from my own research with African American adults and adolescents, as well as recent research on the mathematical experiences of African American students conducted by other scholars. I also draw from the sociological and critical theory literatures to examine the ways that race and racism are conceptualized in the larger social context and in ways that are informative for mathematics education researchers, policy makers, and practitioners.\n\nPurpose\nTo review and critically analyze how the construct of race has been conceptualized in mathematics education research, policy, and practice.\n\nResearch Design\nNarrative synthesis.\n\nConclusion\nFuture research and policy efforts in mathematics education should examine racialized inequalities by considering the socially constructed nature of race.","authors":["Danny Bernard Martin"],"meta":["February 2009Teachers College Record 111(2):295-338","DOI:10.1177/016146810911100208"],"references":["313171094_Race_retrenchment_and_the_reform_of_school_mathematics","349860954_Mathematics_Success_and_Failure_Among_African-American_Youth_The_Roles_of_Sociohistorical_Context_Community_Forces_School_Influence_and_Individual_Agency","349832748_Race_in_the_Schoolyard_Negotiating_the_Color_Line_in_Classrooms_and_Communities","344593582_Experiencing_School_Mathematics_Traditional_and_Reform_Approaches_To_Teaching_and_Their_Impact_on_Student_Learning_Revised_and_Expanded_Edition","331763083_Racial_Formation_in_the_United_States","323466202_Mathematics_Queen_and_Servant_of_Science","322100111_Self-Taught_African_American_Education_in_Slavery_and_Freedom","320596571_Preparing_Prospective_Mathematics_and_Science_Teachers_to_Teach_for_Diversity_Promising_Strategies_for_Transformative_Pedagogy","317953501_The_teaching_gap_best_ideas_from_the_world's_teachers_for_improving_education_in_the_classroom","313572772_Social_and_critical_dimensions_for_equity_in_mathematics_education"]}