{"id":"356329554_Fast_Diameter_Computation_within_Split_Graphs","abstract":"When can we compute the diameter of a graph in quasi linear time? We address this question for the class of {\\em split graphs}, that we observe to be the hardest instances for deciding whether the diameter is at most two. We stress that although the diameter of a non-complete split graph can only be either $2$ or $3$, under the Strong Exponential-Time Hypothesis (SETH) we cannot compute the diameter of an $n$-vertex $m$-edge split graph in less than quadratic time -- in the size $n+m$ of the input. Therefore it is worth to study the complexity of diameter computation on {\\em subclasses} of split graphs, in order to better understand the complexity border. Specifically, we consider the split graphs with bounded {\\em clique-interval number} and their complements, with the former being a natural variation of the concept of interval number for split graphs that we introduce in this paper. We first discuss the relations between the clique-interval number and other graph invariants such as the classic interval number of graphs, the treewidth, the {\\em VC-dimension} and the {\\em stabbing number} of a related hypergraph. Then, in part based on these above relations, we almost completely settle the complexity of diameter computation on these subclasses of split graphs: - For the $k$-clique-interval split graphs, we can compute their diameter in truly subquadratic time if $k={\\cal O}(1)$, and even in quasi linear time if $k=o(\\log{n})$ and in addition a corresponding ordering of the vertices in the clique is given. However, under SETH this cannot be done in truly subquadratic time for any $k = \\omega(\\log{n})$. - For the {\\em complements} of $k$-clique-interval split graphs, we can compute their diameter in truly subquadratic time if $k={\\cal O}(1)$, and even in time ${\\cal O}(km)$ if a corresponding ordering of the vertices in the stable set is given. Again this latter result is optimal under SETH up to polylogarithmic factors. Our findings raise the question whether a $k$-clique interval ordering can always be computed in quasi linear time. We prove that it is the case for $k=1$ and for some subclasses such as bounded-treewidth split graphs, threshold graphs and comparability split graphs. Finally, we prove that some important subclasses of split graphs -- including the ones mentioned above -- have a bounded clique-interval number.","authors":["Guillaume Ducoffe","Michel Habib","Laurent Viennot"],"meta":["November 2021Discrete mathematics & theoretical computer science DMTCS vol. 23, no. 3(Graph Theory)","DOI:10.46298/dmtcs.6422"],"references":["344781289_A_story_of_diameter_radius_and_almost_Helly_property","339935331_Multivariate_Analysis_of_Orthogonal_Range_Searching_and_Graph_Distances","264160616_Identifying_Codes_in_Hereditary_Classes_of_Graphs_and_VC-Dimension","264084789_Into_the_Square_-_On_the_Complexity_of_Quadratic-Time_Solvable_Problems","236366775_An_introduction_to_chordal_graphs_and_clique_trees","280765566_Lex-BFS_and_partition_refinement_with_applications_to_transitive_orientation_interval_graph_recognition_and_consecutive_ones_testing","277895669_Approximation_and_Fixed_Parameter_Subquadratic_Algorithms_for_Radius_and_Diameter","265435621_Algorithm_Graph_Theory_and_Perfect_Graphs","262281728_Fast_approximation_algorithms_for_the_diameter_and_radius_of_sparse_graphs","233477003_A_simple_linear-time_algorithm_for_computing_the_center_of_an_interval_graph","228565725_On_the_Crossing_Spanning_Tree_Problem","226530808_Quasi-optimal_range_searching_in_spaces_of_finite_VC-dimension","224919630_Three_ways_to_cover_a_graph","223932296_The_algorithmic_use_of_hypertree_structure_and_maximum_neighbourhood_orderings","223529627_Rooted_directed_path_graphs_are_leaf_powers"]}