{"id":"356398282_A_novel_geometry_image_to_accurately_represent_a_surface_by_preserving_mesh_topology","abstract":"Geometry images parameterise a mesh with a square domain and store the information in a single chart. A one-to-one correspondence between the 2D plane and the 3D model is convenient for processing 3D models. However, the parameterised vertices are not all located at the intersection of the gridlines the existing geometry images. Thus, errors are unavoidable when a 3D mesh is reconstructed from the chart. In this paper, we propose parameterise surface onto a novel geometry image that preserves the constraint of topological neighbourhood information at integer coordinate points on a 2D grid and ensures that the shape of the reconstructed 3D mesh does not change from supplemented image data. We find a collection of edges that opens the mesh into simply connected surface with a single boundary. The point distribution with approximate blue noise spectral characteristics is computed by capacity-constrained delaunay triangulation without retriangulation. We move the vertices to the constrained mesh intersection, adjust the degenerate triangles on a regular grid, and fill the blank part by performing a local affine transformation between each triangle in the mesh and image. Unlike other geometry images, the proposed method results in no error in the reconstructed surface model when floating-point data are stored in the image. High reconstruction accuracy is achieved when the xyz positions are in a 16-bit data format in each image channel because only rounding errors exist in the topology-preserving geometry images, there are no sampling errors. This method performs one-to-one mapping between the 3D surface mesh and the points in the 2D image, while foldovers do not appear in the 2D triangular mesh, maintaining the topological structure. This also shows the potential of using a 2D image processing algorithm to process 3D models.","authors":["Sheng Zeng","Guohua Geng","Hongjuan Gao","Mingquan Zhou"],"meta":["November 2021Scientific Reports 11(1)","DOI:10.1038/s41598-021-01722-4"],"references":["251298447_Parameterization_of_Triangulations_and_Unorganized_Points","338100403_Seamless_Parametrization_with_Arbitrary_Cones_for_Arbitrary_Genus","325236382_Sphere-based_cut_construction_for_planar_parameterizations","321232070_Autocuts_simultaneous_distortion_and_cut_optimization_for_UV_mapping","309050537_Discrete_differential-geometry_operators_for_triangulated_2-manifolds","308278062_Deep_Learning_3D_Shape_Surfaces_Using_Geometry_Images","277502214_Capacity-Constrained_Point_Distributions_A_Variant_of_Lloyd's_Method","262323350_An_Efficient_Computation_of_Handle_and_Tunnel_Loops_via_Reeb_Graphs","259528490_Connectivity-preserving_Geometry_Images","245826584_Cutting_a_Surface_into_a_Disk","227611629_METRO_Measuring_error_on_simplified_surfaces","224127507_GPU-Assisted_Computation_of_Centroidal_Voronoi_Tessellation","229730192_Geometry_Images_of_Arbitrary_Genus_in_the_Spherical_Domain","226801381_A_new_technique_to_compute_polygonal_schema_for_2-manifolds_with_application_to_null-homotopy_detection","222826308_Active_contours_with_selective_local_or_global_segmentation_A_new_formulation_and_level_set_method"]}