{"id":"356445653_On_Fault-Tolerant_Partition_Dimension_of_Homogeneous_Caterpillar_Graphs","abstract":"Metric-related parameters in graph theory have several applications in robotics, navigation, and chemical strata. An important such parameter is the partition dimension of graphs that plays an important role in engineering, computer science, and chemistry. In the context of chemical and pharmaceutical engineering, these parameters are used for unique representation of chemical compounds and their structural analysis. The structure of benzenoid hydrocarbon molecules is represented in the form of caterpillar trees and studied for various attributes including UV absorption spectrum, molecular susceptibility, anisotropy, and heat of atomization. Several classes of trees have been studied for partition dimension; however, in this regard, the advanced variant, the fault-tolerant partition dimension, remains to be explored. In this paper, we computed fault-tolerant partition dimension for homogeneous caterpillars Cp;1, Cp;2, and Cp;3 for p≥5, p≥3, and p≥4, respectively, and it is found to be constant. Further numerical examples and an application are furnished to elaborate the accuracy and significance of the work.","authors":["Kamran Azhar","Sohail Zafar","Agha Kashif Arshad Khan"],"meta":["November 2021Mathematical Problems in Engineering 2021(3):1-7","DOI:10.1155/2021/7282245"],"references":["349902704_On_Partition_Dimension_of_Some_Cycle-Related_Graphs","345763940_Metric_basis_and_metric_dimension_of_1-pentagonal_carbon_nanocone_networks","340626494_All_graphs_of_order_n_11_and_diameter_2_with_partition_dimension_n_-_3","350421737_FAULT-TOLERANT_METRIC_DIMENSION_OF_CIRCULANT_GRAPHS","348978079_On_2-partition_dimension_of_the_circulant_graphs","346975875_On_sharp_bounds_of_the_Partition_Dimension_of_Convex_Polytoes","346505881_The_partition_dimension_of_a_subdivision_of_a_homogeneous_firecracker","346433414_On_fault-tolerant_partition_dimension_of_graphs","335866627_A_Note_On_The_Partition_Dimension_of_Thorn_of_Fan_Graph","330606574_Partition_Dimension_of_Certain_Classes_of_Series_Parallel_Graphs"]}