{"id":"356446577_Gender_stereotypes_about_interests_start_early_and_cause_gender_disparities_in_computer_science_and_engineering","abstract":"Societal stereotypes depict girls as less interested than boys in computer science and engineering. We demonstrate the existence of these stereotypes among children and adolescents from first to 12th grade and their potential negative consequences for girls’ subsequent participation in these fields. Studies 1 and 2 ( n = 2,277; one preregistered) reveal that children as young as age six (first grade) and adolescents across multiple racial/ethnic and gender intersections (Black, Latinx, Asian, and White girls and boys) endorse stereotypes that girls are less interested than boys in computer science and engineering. The more that individual girls endorse gender-interest stereotypes favoring boys in computer science and engineering, the lower their own interest and sense of belonging in these fields. These gender-interest stereotypes are endorsed even more strongly than gender stereotypes about computer science and engineering abilities. Studies 3 and 4 ( n = 172; both preregistered) experimentally demonstrate that 8- to 9-y-old girls are significantly less interested in an activity marked with a gender stereotype (“girls are less interested in this activity than boys”) compared to an activity with no such stereotype (“girls and boys are equally interested in this activity”). Taken together, both ecologically valid real-world studies (Studies 1 and 2) and controlled preregistered laboratory experiments (Studies 3 and 4) reveal that stereotypes that girls are less interested than boys in computer science and engineering emerge early and may contribute to gender disparities.","authors":["Allison Master","Andrew N Meltzoff","Sapna Cheryan"],"meta":["November 2021Proceedings of the National Academy of Sciences 118(48):e2100030118","DOI:10.1073/pnas.2100030118"],"references":["344206014_Math_and_language_gender_stereotypes_Age_and_gender_differences_in_implicit_biases_and_explicit_beliefs","340874803_Cultural_Stereotypes_and_Sense_of_Belonging_Contribute_to_Gender_Gaps_in_STEM","317096537_Female_peer_mentors_early_in_college_increase_women's_positive_academic_experiences_and_retention_in_engineering","312961123_Gender_stereotypes_about_intellectual_ability_emerge_early_and_influence_children's_interests","342911025_The_development_of_academic_and_nonacademic_race_stereotypes_in_African_American_adolescents","342291762_Understanding_persistent_gender_gaps_in_STEM","341438513_Why_So_Slow_The_Advancement_of_Women","333301861_Double_isolation_Identity_expression_threat_predicts_greater_gender_disparities_in_computer_science","320115332_Gender_Stereotypes","316630853_Programming_experience_promotes_higher_STEM_motivation_among_first-grade_girls"]}