{"id":"356480810_Improved_YOLOv4-tiny_network_for_real-time_electronic_component_detection","abstract":"In the electronics industry environment, rapid recognition of objects to be grasped from digital images is essential for visual guidance of intelligent robots. However, electronic components have a small size, are difficult to distinguish, and are in motion on a conveyor belt, making target detection more difficult. For this reason, the YOLOv4-tiny method is used to detect electronic components and is improved. Then, different network structures are built for the adaptive integration of middle- and high-level features to address the phenomenon in which the original algorithm integrates all feature information indiscriminately. The method is deployed on an electronic component dataset for validation. Experimental results show that the accuracy of the original algorithm is improved from 93.74 to 98.6%. Compared with other current mainstream algorithms, such as Faster RCNN, SSD, RefineDet, EfficientDet, and YOLOv4, the method can maintain high detection accuracy at the fastest speed. The method can provide a technical reference for the development of manufacturing robots in the electronics industry.","authors":["Ce Guo","Xiao-ling Lv","Yan Zhang","Ming-lu Zhang"],"meta":["November 2021Scientific Reports 11(1)","DOI:10.1038/s41598-021-02225-y"],"references":["338111709_CNN-Based_Person_Detection_Using_Infrared_Images_for_Night-Time_Intrusion_Warning_Systems","321180719_Single-Shot_Refinement_Neural_Network_for_Object_Detection","355881027_Scaled-YOLOv4_Scaling_Cross_Stage_Partial_Network","346927129_MAFNet_Multi-style_attention_fusion_network_for_salient_object_detection","345901669_An_empirical_study_of_multi-scale_object_detection_in_high_resolution_UAV_images","343456623_EfficientDet_Scalable_and_Efficient_Object_Detection","338512016_Dual_Attention_Network_for_Scene_Segmentation","338439229_SAANet_Spatial_adaptive_alignment_network_for_object_detection_in_automatic_driving","324387691_YOLOv3_An_Incremental_Improvement","322059369_Focal_Loss_for_Dense_Object_Detection"]}