{"id":"356503732_General_intelligence_disentangled_via_a_generality_metric_for_natural_and_artificial_intelligence","abstract":"Success in all sorts of situations is the most classical interpretation of general intelligence. Under limited resources, however, the capability of an agent must necessarily be limited too, and generality needs to be understood as comprehensive performance up to a level of difficulty . The degree of generality then refers to the way an agent’s capability is distributed as a function of task difficulty. This dissects the notion of general intelligence into two non-populational measures, generality and capability , which we apply to individuals and groups of humans, other animals and AI systems, on several cognitive and perceptual tests. Our results indicate that generality and capability can decouple at the individual level: very specialised agents can show high capability and vice versa. The metrics also decouple at the population level, and we rarely see diminishing returns in generality for those groups of high capability. We relate the individual measure of generality to traditional notions of general intelligence and cognitive efficiency in humans, collectives, non-human animals and machines. The choice of the difficulty function now plays a prominent role in this new conception of generality, which brings a quantitative tool for shedding light on long-standing questions about the evolution of general intelligence and the evaluation of progress in Artificial General Intelligence.","authors":["Jose Hernandez-Orallo","Bao Sheng Loe","Lucy Cheke","Fernando Martínez Plumed"],"meta":["November 2021Scientific Reports 11(1)","DOI:10.1038/s41598-021-01997-7"],"references":["347811904_Mastering_Atari_Go_chess_and_shogi_by_planning_with_a_learned_model","347238427_How_general_is_cognitive_ability_in_non-human_animals_A_meta-analytical_and_multi-level_reanalysis_approach","346259518_Artificial_Intelligence_and_the_Common_Sense_of_Animals","344852602_Performance_vs_competence_in_human-machine_comparisons","332636704_Machine_behaviour","347447937_Evaluating_Generalisation_in_General_Video_Game_Playing","347336161_Modern_Psychometrics_The_Science_of_Psychological_Assessment","343405984_Increasing_generality_in_machine_learning_through_procedural_content_generation","343182211_General_learning_ability_in_perceptual_learning","334407224_Superhuman_AI_for_multiplayer_poker","331397043_Unmasking_Clever_Hans_Predictors_and_Assessing_What_Machines_Really_Learn","330203340_Bridging_near-_and_long-term_concerns_about_AI","331659608_Gazing_into_Clever_Hans_machines","330771284_Item_response_theory_in_AI_Analysing_machine_learning_classifiers_at_the_instance_level","330091001_Unbridled_mental_power"]}