{"id":"356502711_Discovering_alignment_relations_with_Graph_Convolutional_Networks_A_biomedical_case_study","abstract":"Knowledge graphs are freely aggregated, published, and edited in the Web of data, and thus may overlap. Hence, a key task resides in aligning (or matching) their content. This task encompasses the identification, within an aggregated knowledge graph, of nodes that are equivalent, more specific, or weakly related. In this article, we propose to match nodes within a knowledge graph by (i) learning node embeddings with Graph Convolutional Networks such that similar nodes have low distances in the embedding space, and (ii) clustering nodes based on their embeddings, in order to suggest alignment relations between nodes of a same cluster. We conducted experiments with this approach on the real world application of aligning knowledge in the field of pharmacogenomics, which motivated our study. We particularly investigated the interplay between domain knowledge and GCN models with the two following focuses. First, we applied inference rules associated with domain knowledge, independently or combined, before learning node embeddings, and we measured the improvements in matching results. Second, while our GCN model is agnostic to the exact alignment relations (e.g., equivalence, weak similarity), we observed that distances in the embedding space are coherent with the “strength” of these different relations (e.g., smaller distances for equivalences), letting us considering clustering and distances in the embedding space as a means to suggest alignment relations in our case study.","authors":["Pierre Monnin","Chedy Raïssi","Amedeo Napoli","Adrien Coulet"],"meta":["November 2021Semantic Web","DOI:10.3233/SW-210452"],"references":["352467347_OWL2Vec_embedding_of_OWL_ontologies","332504027_PGxO_and_PGxLOD_A_reconciliation_of_pharmacogenomic_knowledge_of_various_provenances_enabling_further_comparison","351987701_Augmenting_Ontology_Alignment_by_Semantic_Embedding_and_Distant_Supervision","351987229_Injecting_Background_Knowledge_into_Embedding_Models_for_Predictive_Tasks_on_Knowledge_Graphs","344273593_Knowledge-Based_Matching_of_n-ary_Tuples","335390880_Logic_Attention_Based_Neighborhood_Aggregation_for_Inductive_Knowledge_Graph_Embedding","334118054_Cross-lingual_Knowledge_Graph_Alignment_via_Graph_Convolutional_Networks","325529200_Modeling_Relational_Data_with_Graph_Convolutional_Networks","320014532_A_Comprehensive_Survey_of_Graph_Embedding_Problems_Techniques_and_Applications","319947524_Knowledge_Graph_Embedding_A_Survey_of_Approaches_and_Applications","303969790_Logic_Tensor_Networks_Deep_Learning_and_Logical_Reasoning_from_Data_and_Knowledge","312711376_Applications","308568813_RDF2Vec_RDF_Graph_Embeddings_for_Data_Mining","307991731_Semi-Supervised_Classification_with_Graph_Convolutional_Networks","288250868_A_Review_of_Relational_Machine_Learning_for_Knowledge_Graphs"]}