{"id":"356574097_CONTENIDOS_DE_NATURALEZA_DE_LA_CIENCIA_Y_LA_TECNOLOGIA_EN_LOS_NUEVOS_CURRICULOS_BASICOS_DE_EDUCACION_SECUNDARIA","abstract":"Resumen: Los temas de naturaleza de ciencia y tecnología (NdCyT) constituyen el componente innovador de la alfabetización científica para todos, que la investigación didáctica proclama como objetivo principal de la educación científica. Algunas investigaciones indican que la enseñanza de estos temas es relegada por la influencia de una serie de factores tales como su presencia imprecisa en el currículo (escasez, desorganización y dispersión), su complejidad, la escasa tradición innovadora, la falta de formación del profesorado y materiales educativos específicos, que se realimentan para perpetuar su ausencia del aula de ciencias. Este artículo analiza la presencia de estos temas en los nuevos currículos básicos de educación secundaria obligatoria (ESO) y bachillerato, publicados por el Ministerio de Educación español en 2015, con el objetivo de facilitar al profesorado una visión más precisa, sistemática y estructurada de ellos, para así vencer su tradicional relegación u olvido e incentivar su enseñanza adecuada. El análisis aplica una taxonomía importada de la investigación didáctica sobre los nuevos estándares de aprendizaje evaluables, porque la mayor concreción de este contenido curricular permite identificar y clasificar los contenidos NdCyT con mayor precisión. Los resultados muestran que la presencia de temas de NdCyT en los currículos básicos de ciencias es más extendida y detallada, aunque irregular. Sin embargo, todavía subsisten deficiencias en el planteamiento curricular de esos contenidos (mejorable precisión terminológica, confusión con los procesos de la ciencia y carencia de un diseño de progresiones de aprendizaje). Como conclusión, este estudio identifica y estructura los temas NdCyT como un paso necesario para clarificar el currículo, comprender y formar mejor al profesorado, de modo que incida en mejorar el desarrollo del currículo y de materiales adecuados y la calidad de la enseñanza científica sobre contenidos de NdCyT. Abstract:The themes of nature of science (NoS) and technology are the innovative component of scientific and technological literacy for all citizens, which is advocated from the research as the main aim for science education. Some research also points out that the teaching of NoS issues is often relegated due to a set of factors, such as the inaccurate curricular presentation (scarcity, disorganization and dispersion), its complexity, the scarce innovative tradition, and lack of training and specific educational materials, which reinforce themselves to perpetuate their absence in science classrooms. This paper analyses the presence of NoS issues in the new core curricula for compulsory secondary and high school education, published in early 2015 by the Spanish Ministry of Education, aimed at helping teachers to get an accurate, systematic and structured vision, to overcome their traditional relegation or omission and thus promoting a better education of these issues. The analysis applies a taxonomy imported from the educational research on the learning standards for assessment, because this curricular contents display high specificity that allows the identification and classification of NoS contents in curricula with the highest accuracy. The results show that NoS contents in curricula reach a detailed and extended, yet uneven, presence. However, some shortcomings still remain in the curricular approach to NoS issues (improvable conceptual precision, unclear delimitation with the processes of science, lack of learning progression design). In conclusion, the study identifies and structures NoS issues, as a necessary step forward to clarify the curriculum and to improve teachers’ understanding and training on NoS, as means to globally improve the NoS curriculum and new NoS materials development and the quality of NoS teaching. Keywords: Science Education, Scientific and Technological Literacy, Nature of Science and Technology, Curriculum Development, Science Teacher Education, Reflective Teaching, Academic Standards. Los resultados muestran que la presencia de temas de NdCyT en los currículos básicos de ciencias es más extendida y detallada, aunque irregular. Sin embargo, todavía subsisten deficiencias en el planteamiento curricular de esos contenidos (mejorable precisión terminológica, confusión con los procesos de la ciencia y carencia de un diseño de progresiones de aprendizaje). Como conclusión, este estudio identifica y estructura los temas NdCyT como un paso necesario para clarificar el currículo, comprender y formar mejor al profesorado, de modo que incida en mejorar el desarrollo del currículo y de materiales adecuados y la calidad de la enseñanza científica sobre contenidos de NdCyT.","authors":["Angel Vazquez","María Antonia Manassero Mas"],"meta":["April 2017Profesorado. Revista de Curriculum y Formación del Profesorado 21(1):294-312","DOI:10.30827/profesorado.v21i1.10364"],"references":[]}