{"id":"356703808_Quantifying_social_organization_and_political_polarization_in_online_platforms","abstract":"Mass selection into groups of like-minded individuals may be fragmenting and polarizing online society, particularly with respect to partisan differences1,2,3,4. However, our ability to measure the social makeup of online communities and in turn, to understand the social organization of online platforms, is limited by the pseudonymous, unstructured and large-scale nature of digital discussion. Here we develop a neural-embedding methodology to quantify the positioning of online communities along social dimensions by leveraging large-scale patterns of aggregate behaviour. Applying our methodology to 5.1 billion comments made in 10,000 communities over 14 years on Reddit, we measure how the macroscale community structure is organized with respect to age, gender and US political partisanship. Examining political content, we find that Reddit underwent a significant polarization event around the 2016 US presidential election. Contrary to conventional wisdom, however, individual-level polarization is rare; the system-level shift in 2016 was disproportionately driven by the arrival of new users. Political polarization on Reddit is unrelated to previous activity on the platform and is instead temporally aligned with external events. We also observe a stark ideological asymmetry, with the sharp increase in polarization in 2016 being entirely attributable to changes in right-wing activity. This methodology is broadly applicable to the study of online interaction, and our findings have implications for the design of online platforms, understanding the social contexts of online behaviour, and quantifying the dynamics and mechanisms of online polarization.","authors":["Isaac Waller","Ashton Anderson"],"meta":["December 2021Nature 600(7888)","DOI:10.1038/s41586-021-04167-x"],"references":["327275773_Exposure_to_opposing_views_on_social_media_can_increase_political_polarization","323722948_Community_Interaction_and_Conflict_on_the_Web","335779420_Second-order_Co-occurrence_Sensitivity_of_Skip-Gram_with_Negative_Sampling","333060100_Generalists_and_Specialists_Using_Community_Embeddings_to_Quantify_Activity_Diversity_in_Online_Platforms","333026546_Republic_Divided_Democracy_in_the_Age_of_Social_Media","327441273_Making_Sense_of_the_Alt-Right","324299825_Distinction_A_Social_Critique_of_the_Judgement_of_Taste","324055041_The_Geometry_of_Culture_Analyzing_Meaning_through_Word_Embeddings","321241613_Word_Embeddings_Quantify_100_Years_of_Gender_and_Ethnic_Stereotypes","318739013_community2vec_Vector_representations_of_online_communities_encode_semantic_relationships"]}