{"id":"356761809_A_robust_approach_for_industrial_small-object_detection_using_an_improved_faster_regional_convolutional_neural_network","abstract":"With the increasing pace in the industrial sector, the need for a smart environment is also increasing and the production of industrial products in terms of quality always matters. There is a strong burden on the industrial environment to continue to reduce impulsive downtime, concert deprivation, and safety risks, which needs an efficient solution to detect and improve potential obligations as soon as possible. The systems working in industrial environments for generating industrial products are very fast and generate products rapidly, sometimes leading to faulty products. Therefore, this problem needs to be solved efficiently. Considering this problem in terms of faulty small-object detection, this study proposed an improved faster regional convolutional neural network-based model to detect the faults in the product images. We introduced a novel data-augmentation method along with a bi-cubic interpolation-based feature amplification method. A center loss is also introduced in the loss function to decrease the inter-class similarity issue. The experimental results show that the proposed improved model achieved better classification accuracy for detecting our small faulty objects. The proposed model performs better than the state-of-the-art methods.","authors":["Faisal Saeed","Ahmed Muhammad Jamal","Malik Junaid Gul","Kim Jeong Hong"],"meta":["December 2021Scientific Reports 11(1)","DOI:10.1038/s41598-021-02805-y"],"references":["350073832_Mid-term_electricity_load_prediction_using_CNN_and_Bi-LSTM","339912963_A_CNN-LSTM_model_for_gold_price_time_series_forecasting","338141403_Tackling_Faults_in_the_Industry_40_Era-A_Survey_of_Machine-Learning_Solutions_and_Key_Aspects","333912990_Convolutional_neural_network_based_early_fire_detection","333645418_Machine_learning_based_approach_for_multimedia_surveillance_during_fire_emergencies","327631726_Enabling_Technologies_for_Operator_40_A_Survey","354690846_DFPN_Deformable_Frame_Prediction_Network","352701668_Blockchain_based_healthcare_system_with_Artificial_Intelligence","328246030_Improving_Tiny_Vehicle_Detection_in_Complex_Scenes","327640234_Position_Detection_and_Direction_Prediction_for_Arbitrary-Oriented_Ships_via_Multitask_Rotation_Region_Convolutional_Neural_Network"]}