{"id":"356790681_A_Comprehensive_Competitive_Swarm_Optimizer_for_Large-Scale_Multiobjective_Optimization","abstract":"Competitive swarm optimizers (CSOs) have shown very promising search efficiency in large-scale decision space. However, they face difficulties when solving large-scale multi-/many-objective optimization problems (LMOPs), as their winner particles are selected by random pairwise competition based on only a single evaluation criterion, which does not provide diverse guidance for LMOPs. To alleviate this issue, this paper proposes a comprehensive competitive learning strategy for CSOs using three competition mechanisms to guide the particle search. Specifically, environmental competition classifies winner and loser particles from the swarm, while cognitive competition and social competition select one winner particle as the cognitive component and the social component, respectively, to guide the search for loser particles. This competitive learning strategy aims to enhance the search capability of loser particles and provides diverse search directions for solving LMOPs. When compared with eight competitive optimizers, the experimental results validate the high efficiency and effectiveness of our method in solving nine LMOPs with 2 to 10 objectives and 100 to 5000 variables.","authors":["Songbai Liu","Qiuzhen Lin","Qing Li","Kay Chen Tan"],"meta":["December 2021IEEE Transactions on Systems, Man, and Cybernetics: Systems PP(99)","DOI:10.1109/TSMC.2021.3131312"],"references":["354003658_Evolutionary_Multi_and_Many-objective_Optimization_via_Clustering_for_Environmental_Selection","353357838_Evolutionary_Large-Scale_Multiobjective_Optimization_Benchmarks_and_Algorithms","353285914_A_Variable_Importance-Based_Differential_Evolution_for_Large-Scale_Multiobjective_Optimization","342852786_Adaptive_Offspring_Generation_for_Evolutionary_Large-Scale_Multiobjective_Optimization","334780822_Large-Scale_Evolution_Strategy_Based_on_Search_Direction_Adaptation","332662596_A_Distributed_Swarm_Optimizer_With_Adaptive_Communication_for_Large-Scale_Optimization","339505626_Enhancing_MOEAD_with_Information_Feedback_Models_for_Large-Scale_Many-Objective_Optimization","333156437_A_Variable_Search_Space_Strategy_Based_on_Sequential_Trust_Region_Determination_Technique","332582385_Ranking-based_Biased_Learning_Swarm_Optimizer_for_Large-Scale_Optimization","332366862_A_novel_multi-objective_evolutionary_algorithm_with_dynamic_decomposition_strategy"]}