{"id":"356731964_WOAIP_Wireless_Optimization_Algorithm_for_Indoor_Placement_Based_on_Binary_Particle_Swarm_Optimization_BPSO","abstract":"Optimizing the Access Point (AP) deployment has a great role in wireless applications due to the need for providing an efficient communication with low deployment costs. Quality of Service (QoS), is a major significant parameter and objective to be considered along with AP placement as well the overall deployment cost. This study proposes and investigates a multi-level optimization algorithm called Wireless Optimization Algorithm for Indoor Placement (WOAIP) based on Binary Particle Swarm Optimization (BPSO). WOAIP aims to obtain the optimum AP multi-floor placement with effective coverage that makes it more capable of supporting QoS and cost-effectiveness. Five pairs (coverage, AP deployment) of weights, signal thresholds \nand received signal strength (RSS) measurements simulated using Wireless InSite (WI) software were considered in the test case study by comparing the results collected from WI with the present wireless \nsimulated physical AP deployment of the targeted building - Computer Science Department at University of Baghdad. The performance evaluation of WOAIP shows an increase in terms of AP placement and \noptimization distinguished in order to increase the wireless coverage ratio to 92.93% compared to 58.5% of present AP coverage (or 24.5% coverage enhancement on average).","authors":["Omar S Naif","Imad J. Mohammed"],"meta":["November 2021Baghdad Science Journal 19(3):0605-","DOI:10.21123/bsj.2022.19.3.0605"],"references":["335510509_Edge_Computing_in_5G_A_Review","332595657_Optimal_access_point_location_algorithm_based_real_measurement_for_indoor_communication","332394570_Taxonomy_of_Memory_Usage_in_Swarm_Intelligence-Based_Metaheuristics","313816052_A_Survey_on_Wireless_Transmitter_Localization_Using_Signal_Strength_Measurements","348614360_A_Comparative_Study_of_Particle_Swarm_Optimization_and_Genetic_Algorithm","346238387_WiFi_based_Indoor_Positioning_System_using_Machine_Learning_and_Multi-Node_Triangulation_Algorithms","312485935_Positioning_WiFi_access_points_using_Particle_Swarm_Optimization","312425025_Summary_of_available_indoor_location_techniques"]}