{"id":"356781638_kfat_altlym_alaly_wdwrha_fy_tzyz_slwk_almstdam","abstract":"AbstractThe study aimed to identify the impact of higher education efficiency through three dimensions, (learning outcomes, institutional support and community support) As an explanatory variable, in sustainable behavior as a response variable, and the field of study was in some colleges of the University of Kufa (Administration and Economics, Arts and Faculty of Computer Science and Mathematics).The research community consisted of professors and workers in the aforementioned colleges, either the research sample was a random sample, the electronic questionnaire was distributed, and (217) statistical questionnaires were retrieved for statistical analysis. The research included two main hypotheses for the test of the correlation and impact relationship between the research variables.The results were extracted using the statistical program (SPSS). The study reached a set of conclusions, the most important of which was adopting the efficiency of higher education in order to achieve clear differentiation, help in finding new processes and services, support the university’s reputation and achieve benefits for society. The research came out with a set of recommendations, the most important of which was working on developing approaches concerned with sustainable behavior and following procedures to confront these problems to understand understanding pro-environment behavior.Key words: Efficiency of higher education, sustainable behavior, University of Kufa.","authors":["Mohanad Hameed Yasir","Haydar Jasim"],"meta":["December 2021"],"references":["309515677_Sustainability_behaviors_among_college_students_an_application_of_the_VBN_theory","278412223_Assessing_Sustainable_Behavior_and_its_Correlates_A_Measure_of_Pro-Ecological_Frugal_Altruistic_and_Equitable_Actions","337814096_The_relative_importance_of_material_and_non-material_incentives_for_community_health_workers_Evidence_from_a_discrete_choice_experiment_in_Western_Kenya","337659489_Students'_perceptions_of_assessment_quality_related_to_their_learning_approaches_and_learning_outcomes","337479070_Ask_Me_What_Want_Community-Based_Participatory_Research_to_Explore_Transition-Age_Foster_Youth's_Use_of_Support_Services","336183737_The_link_between_educational_expenditures_and_student_learning_outcomes_Evidence_from_Cyprus","286377093_Happiness_as_Correlate_of_Sustainable_Behavior_A_Study_of_Pro-Ecological_Frugal_Equitable_and_Altruistic_Actions_That_Promote_Subjective_Wellbeing","279602128_Promoting_sustainable_behavior_An_introduction_to_community-based_social_marketing","264437530_Sustainable_behaviour_at_work_and_in_private_life_The_contribution_of_enterprises","257244524_Communities_of_Public_Service_Support_Citizens_engage_in_social_learning_in_peer-to-peer_networks"]}