{"id":"356743013_System_of_quasi-professional_tasks_in_the_process_of_training_future_primary_school_teachers_for_modeling_and_conducting_computer_science_lessons","abstract":"У статті окреслено актуальність проблеми використання квазіпрофесійних завдань у процесі професійної підготовки майбутніх учителів інформатики до моделювання та проведення уроків в умовах варіативності початкової освіти.\nЗдійснено короткий огляд сучасних наукових досліджень з означеної теми, що вказує на ефективність технології контекстного навчання здобувачів вищої освіти, механізмом реалізації якої виступає процес розв`язання ними квазіпрофесійних завдань. Визначено, що такими завданнями можуть бути проблемні (рефлексивні) лекції, дискусії, моделювання й аналіз педагогічних ситуацій, ділові ігри та ін.\nУ роботі презентовано авторську систему квазіпрофесійних завдань, яку було використано під час експериментальної підготовки майбутніх учителів інформатики до моделювання та проведення уроків в умовах варіативності початкової освіти. Дидактичні квазіпрофесійні завдання пропоновано студентам для усвідомлення ними педагогічного моделювання як особистісно значущого процесу для професійної діяльності та формування основ його цілісного бачення. Методичні квазіпрофесійні завдання впроваджено для оволодіння майбутніми вчителями загальним алгоритмом педагогічного моделювання, а саме: формування вмінь планувати, здійснювати вибір ресурсного забезпечення, конструювати моделі уроків інформатики в умовах варіативності початкової освіти. Технологічні квазіпрофесійні завдання спрямовано на становлення в студентів здатності моделювати, реалізовувати й аналізувати урок інформатики (систему уроків) на основі впровадження сучасних навчальних технологій в умовах варіативності початкової освіти.\nВизначено, що включення авторської системи квазіпрофесійних завдань до змісту експериментального навчання дозволило майбутнім учителям якісно тренуватися в моделюванні та проведенні уроків інформатики в умовах варіативності початкової освіти, що значно підвищило рівень їхньої готовності до такої діяльності в реаліях Нової української школи та суттєво розвинуло педагогічне мислення.\nThe urgency of the problem of using quasi-professional tasks in the process of professional training of future computer science teachers for modeling and conducting lessons in the conditions of variability of primary education is outlined in the article.\nA brief review of modern scientific research on this topic has been carried out, which proved the effectiveness of the technology of contextual learning of higher education, the mechanism of which is the process of solving various quasi-professional problems. It is determined that such tasks can be problematic (reflective) lectures, discussions, modeling and analysis of pedagogical situations, business games, etc.\nThe author 's system of quasi-professional tasks is presented in the work, which was used during the experimental preparation of future computer science teachers for modeling and conducting lessons in the conditions of variability of primary education. Didactic quasi-professional tasks are offered to students for their awareness of pedagogical modeling as a personally significant process for professional activity and the formation of the foundations of its holistic vision. Methodical quasi-professional tasks have been introduced for mastering by future teachers the general algorithm of pedagogical modeling, namely: formation of skills to plan, to choose resource provision, to construct models of computer science lessons in the conditions of variability of primary education. Technological quasi-professional tasks are aimed at developing students' ability to model, implement and analyze the lesson of computer science (lesson system) based on the introduction of modern educational technologies in terms of variability of primary education.\nIt is determined that the inclusion of the author's system of quasi-professional tasks in the content of experimental training allowed future teachers to train in modeling and conducting computer science lessons in conditions of variability of primary education, which significantly increased their readiness for such activities in the realities of the New Ukrainian School.","authors":["Marina Nesterenko"],"meta":["January 2021Humanities Science Current Issues 2(42):190-195","DOI:10.24919/2308-4863/42-2-32"],"references":["334283406_Practice-Oriented_Direction_of_Professional_Preparation_of_Future_Teachers_of_Primary_Education_in_the_Context_of_European_Integration_Processes"]}