{"id":"356835176_Qualidade_de_dados_em_gestao_de_dados_de_pesquisa_um_estudo_bibliometrico","abstract":"Resumo: A gestão dos dados de pesquisa é reconhecida pela comunidade científica como parte importante das boas práticas de pesquisa. Desta maneira, acredita-se que os mesmos devem estar sempre disponíveis para acesso e reuso. Neste contexto, a curadoria e a qualidade de dados são entendidas como elementos estratégicos. Este trabalho tem como objetivo caracterizar e especificar a produção científica existente sobre o tema \"qualidade de dados em gestão de dados de pesquisa\", por meio da aferição de indicadores bibliométricos. Em termos metodológicos, esta pesquisa possui natureza quantitativa e qualitativa, é de tipo exploratória quanto a seus objetivos e utiliza-se das bases de dados Web of Science e Scopus para a composição do corpus do estudo bibliométrico. Como resultado, identificou-se, a partir de um corpus de 77 artigos, um período de publicações relevantes entre os anos de 1984 e 2020, sendo o ano de 2019 aquele com mais trabalhos publicados. Adicionalmente, 7 veículos de publicação apresentaram mais de um artigo no tópico pesquisado, sendo os Estados Unidos o país com mais trabalhos publicados, totalizando 34. A área da Ciência da Computação foi a que mais produziu nesse tema e constitui uma tendência em sua interdisciplinaridade com as ciências biológicas, sociais aplicadas e da saúde. Finalmente, conclui-se que, a partir da consciência de que","authors":["Daiane Marcela Piccolo","Antonio Victor Wolf Tadini","Heytor Diniz Teixeira","Leonardo Castro Botega"],"meta":["December 2021Em Questão 28(1):159-184","DOI:10.19132/1808-5245281.159-184"],"references":["337600508_Gestion_de_datos_de_investigacion_y_bibliotecas_preservando_los_nuevos_bienes_cientificos","334403730_SUBSIDIOS_PARA_A_CONTRUCAO_DE_UM_MODELO_DE_AVALIACAO_DE_SISTEMAS_DE_GESTAO_DE_DADOS_DE_PESQUISA","311850385_Algumas_consideracoes_sobre_os_repositorios_digitais_de_dados_de_pesquisa","300012605_Information_Quality_Data_and_Philosophy","298345883_The_FAIR_Guiding_Principles_for_scientific_data_management_and_stewardship","291945846_Ha_Futuro_para_as_Bibliotecas_de_Pesquisa_no_Ambiente_de_eScience","333360838_Towards_a_Content_Agnostic_Computable_Knowledge_Repository_for_Data_Quality_Assessment","326213812_The_Data_Librarian's_Handbook","310083448_Data_Governance_Data_Literacy_and_the_Management_of_Data_Quality","303602756_Erratum_to_Data_and_Information_Quality_Dimensions_Principles_and_Techniques"]}