{"id":"356838369_Embedding_knowledge_on_ontology_into_the_corpus_by_topic_to_improve_the_performance_of_deep_learning_methods_in_sentiment_analysis","abstract":"Sentiment classification, which uses deep learning algorithms, has achieved good results when tested with popular datasets. However, it will be challenging to build a corpus on new topics to train machine learning algorithms in sentiment classification with high confidence. This study proposes a method that processes embedding knowledge in the ontology of opinion datasets called knowledge processing and representation based on ontology (KPRO) to represent the significant features of the dataset into the word embedding layer of deep learning algorithms in sentiment classification. Unlike the methods that lexical encode or add information to the corpus, this method adds presentation of raw data based on the expert’s knowledge in the ontology. Once the data has a rich knowledge of the topic, the efficiency of the machine learning algorithms is significantly enhanced. Thus, this method is appliable to embed knowledge in datasets in other languages. The test results show that deep learning methods achieved considerably higher accuracy when trained with the KPRO method’s dataset than when trained with datasets not processed by this method. Therefore, this method is a novel approach to improve the accuracy of deep learning algorithms and increase the reliability of new datasets, thus making them ready for mining","authors":["Duy Ngoc Nguyen","Tuoi Thi Phan","Phuc Do"],"meta":["December 2021Scientific Reports 11(1):18","DOI:10.1038/s41598-021-03011-6"],"references":["353260368_An_Integrated_Deep_Learning_and_Belief_Rule-Based_Expert_System_for_Visual_Sentiment_Analysis_under_Uncertainty","346344310_Preprocessing_Improves_CNN_and_LSTM_in_Aspect-Based_Sentiment_Analysis_for_Vietnamese","343846800_Bi-LSTM_Model_to_Increase_Accuracy_in_Text_Classification_Combining_Word2vec_CNN_and_Attention_Mechanism","341586726_Aggregating_Customer_Review_Attributes_for_Online_Reputation_Generation","336868525_ALBERT_A_LITE_BERT_FOR_SELF-SUPERVISED_LEARNING_OF_LANGUAGE_REPRESENTATIONS","335634737_Mining_patient_opinion_to_evaluate_the_service_quality_in_healthcare_a_deep-learning_approach","356684440_Security_issues_and_defensive_approaches_in_deep_learning_frameworks","354283288_A_multitask_multiview_neural_network_for_end-to-end_aspect-based_sentiment_analysis","352030887_Deep_learning-based_classification_of_the_polar_emotions_of_moe-style_cartoon_pictures","346886823_Multi-attention_fusion_modeling_for_sentiment_analysis_of_educational_big_data"]}