{"id":"356865506_Fabric-Based_Computing_Reexamining_the_Materiality_of_Computer_Science_Learning_Through_Fiber_Crafts","abstract":"Fiber crafts, such as weaving and sewing, occupy a tension-filled space within computing. While associated with domestic practices, fiber crafts have been recognized as a precursor of the earliest computers and continue to present sources of computational inspiration. The connections between fiber crafts and computing have the potential to uncover possibilities for computing to become more diversified in terms of materials, cultural practices, and ultimately people. To explore the promises of fiber crafts for STEM education, this qualitative dissertation built on constructionist and posthumanist perspectives to examine two fiber crafts (i.e., weaving and fabric manipulation) as contexts for computer science learning. Collectively, the dissertation effectively aligned fiber crafts with computational concepts and showed their potential as a promising context for computer science learning. The work further showed that materials used for STEM learning are non-neutral. Materials matter in what can be learned computationally. Lastly, guided by posthumanist perspectives, the dissertation uncovered computational learning as the process of producing physical expansions and highlighted learning as the process of how computational concepts physically change. The work has implications for theorizing learning, designing for learning, and educational practice. For example, the dissertation presents the utility of posthumanist perspectives as an additional theoretical approach to the study of learning that can surface and help address ongoing relational deficit orientations.","authors":["Anna Keune"],"meta":["December 2021KI - Ku_nstliche Intelligenz","DOI:10.1007/s13218-021-00747-1"],"references":["331481609_The_New_Materialisms_and_Indigenous_Theories_of_Non-Human_Agency_Making_the_Case_for_Respectful_Anti-Colonial_Engagement","317575527_Why_a_paradigm_shift_of_'more_than_human_ontologies'_is_needed_putting_to_work_poststructural_and_posthuman_theories_in_writers'_studio","315533472_Digital_Youth_Divas_Exploring_Narrative-Driven_Curriculum_to_Spark_Middle_School_Girls'_Interest_in_Computational_Activities","277928108_Electronic_Textiles_as_Disruptive_Designs_Supporting_and_Challenging_Maker_Activities_in_Schools","264274001_Hands_On_Hands_Off_Gendered_Access_in_Crafting_and_Electronics_Practices","319087283_The_literacies_of_things_Reconfiguring_the_material-discursive_production_of_race_and_class_in_an_informal_learning_centre","316909238_Textility_of_Code_A_Catalogue_of_Errors","316909090_Weaving_as_Binary_Art_and_the_Algebra_of_Patterns","269461785_Women's_Work_The_First_20000_Years_Women_Cloth_and_Society_in_Early_Times","249686279_The_Future_Looms_Weaving_Women_and_Cybernetics"]}