{"id":"356956330_Content_and_Structure_of_Subject_Competence_on_Computer_Architecture_and_Configuration_of_Computer_Systems_of_Future_Teachers_of_Computer_Science","abstract":"Content and structure of subject competence on computer architecture and configuration of computer systems of future teachers of Computer Science (CA CCS) was studied in the article. Concept of subject competence on computer architecture and configuration of computer systems of future teachers of Computer Science was grounded. Subject competence on computer architecture and configuration of computer systems of a future teacher of Computer Science is defined as an integral quality of a personality based on the system of knowledge, abilities, skills and a complex of professionally important qualities which formation allows a specialist to implement effectively a professional activity concerning mastering software and hardware components of computer equipment. Scientific search was aimed at specifying the elements to characterize subject competence on CA CCS. The structure of subject competence on CA CCS is formed by knowledge and personal components, their content was determined on the basis of activity approach, implementation of which allowed to distinguish the system of knowledge, abilities, skills of computer use and implementation of the process of professional activity by a teacher of Computer Science (knowledge component); conditions and result of activity implementation in the form of a complex of professionally important qualities of a technology teacher (personal component). The main components in the structure of subject competence on CA CCS are: motivational-and-valuable, organizational-and-meaningful, cognitive-and-operational and person-and-reflexive.","authors":["O. Avramenko","O. Zhmud"],"meta":["July 2017Zhytomyr Ivan Franko State University Journal Рedagogical Sciences","DOI:10.35433/pedagogy.3(89).2017.12-16"],"references":["38320769_Teoreticni_ta_metodicni_zasadi_profesijnoi_pidgotovki_majbutnih_uciteliv_informatiki_za_kreditno-modulnou_sistemou"]}