{"id":"356909263_PERBANDINGAN_ALGORITMA_KLASIFIKASI_SUPPORT_VECTOR_MACHINE_DAN_NAIVE_BAYES_PADA_IMBALANCE_DATA","abstract":"Question classification is a computer science system, which aims to analyze questions and can label each question based on existing categories. Questions can be collected from several materials or topics that are many and different. Therefore, the researcher intends to create a classification system for quiz questions Data Warehouse and Business Intelligence which can be grouped into topics Data Warehouse, Business Intelligence, Data Analytics, and Performance Measurement. One way to solve this problem is by approach machine learning. In this study, researchers used a comparison of machine learning algorithms, namely the algorithm Na誰veBayes and SupportVectorMachine using SMOTE and methods Cross-Validation The results of this study show the best accuracy results and are very helpful. The results obtained in the method cross-validation before SMOTE resulted in an accuracy rate of 82.02% for the results after going through the SMOTE stage of 94.79% on the algorithm Na誰ve Bayes, while the algorithm SupportVectorMachine get accuracy of 81.39% in the process before SMOTE for the results after going through SMOTE of 96.52%. Keywords: Cross-Validation; Machine Learning; Naive Bayes; Support Vector Machine; Question Classification Abstrak: Klasifikasi pertanyaan merupakan sebuah sistem ilmu komputer, yang bertujuan untuk menganalisis pertanyaan serta dapat memberi label pada setiap pertanyaan berdasarkan kategori yang ada. Pertanyaan soal dapat dikumpulkan dari beberapa materi atau topik yang banyak dan berbeda. Oleh karena itu, bermaksud untuk membuat sistem klasifikasi pertanyaan soal kuis Data Warehouse dan Business Intelligence yang dapat dikelompokkan menjadi topik Data Warehouse, Business Intelligence, Data Analitik, dan Pengukuran Kinerja. Cara yang dapat dilakukan untuk permasalahan ini dengan menggunakan pendekatan MachineLearning. Pada penelitian kali ini menggunakan perbandingan algoritma MachineLearning yaitu algoritma Na誰veBayes dan SupportVectorMachine menggunakan metode SMOTE dan Cross-Validation. Hasil penelitian ini menunjukkan hasil akurasi yang terbaik dan sangat membantu. Hasil yang diperoleh pada metode cross-validation sebelum SMOTE menghasilkan tingkat akurasi sebesar 82.02% untuk hasil sesudah melalui tahap SMOTE sebesar 94.79 % pada algoritma Na誰ve Bayes, sedangkan pada algoritma Support Vector Machine menghasilkan akurasi sebesar pada proses sebelum SMOTE 81.39% untuk hasil sesudah melalui SMOTE sebesar 96.52%. Kata kunci: Klasifikasi Pertanyaan; Pembelajaran Mesin; Naive Bayes; Support Vector Machine; Cross-Validation","authors":["Chika Enggar Puspita","Oktariani Nurul Pratiwi","Edi Sutoyo"],"meta":["December 2021JURTEKSI 8(1):11-18","DOI:10.33330/jurteksi.v8i1.1185"],"references":["357089372_Penerapan_SMOTE_untuk_Mengatasi_Imbalance_Class_dalam_Klasifikasi_Television_Advertisement_Performance_Rating_Menggunakan_Artificial_Neural_Network","343871020_Twitter_sentiment_analysis_of_the_relocation_of_Indonesia's_capital_city","337601632_Analisis_dan_Penerapan_Algoritma_Support_Vector_Machine_SVM_dalam_Data_Mining_untuk_Menunjang_Strategi_Promosi","304412750_Automatic_Indonesia's_questions_classification_based_on_bloom's_taxonomy_using_Natural_Language_Processing_a_preliminary_study","303497391_Big_Data_Classification_Using_the_SVM_Classifiers_with_the_Modified_Particle_Swarm_Optimization_and_the_SVM_Ensembles","339093747_Text_Mining_Approach_Using_TF-IDF_and_Naive_Bayes_for_Classification_of_Exam_Questions_Based_on_Cognitive_Level_of_Bloom's_Taxonomy","333793397_Performance_Analysis_of_ANN_and_Naive_Bayes_Classification_Algorithm_for_Data_Classification","329937692_An_alternative_SMOTE_oversampling_strategy_for_high-dimensional_datasets","271155683_Question_Classification_using_Machine_Learning_Approaches"]}