{"id":"356912934_A_deep_generative_model_for_molecule_optimization_via_one_fragment_modification","abstract":"Molecule optimization is a critical step in drug development to improve the desired properties of drug candidates through chemical modification. We have developed a novel deep generative model, Modof, over molecular graphs for molecule optimization. Modof modifies a given molecule through the prediction of a single site of disconnection at the molecule and the removal and/or addition of fragments at that site. A pipeline of multiple, identical Modof models is implemented into Modof-pipe to modify an input molecule at multiple disconnection sites. Here we show that Modof-pipe is able to retain major molecular scaffolds, allow controls over intermediate optimization steps and better constrain molecule similarities. Modof-pipe outperforms the state-of-the-art methods on benchmark datasets. Without molecular similarity constraints, Modof-pipe achieves 81.2% improvement in the octanol–water partition coefficient, penalized by synthetic accessibility and ring size, and 51.2%, 25.6% and 9.2% improvement if the optimized molecules are at least 0.2, 0.4 and 0.6 similar to those before optimization, respectively. Modof-pipe is further enhanced into Modof-pipem to allow modification of one molecule to multiple optimized ones. Modof-pipem achieves additional performance improvement, at least 17.8% better than Modof-pipe. To improve desired properties of drugs or other molecules, deep learning can be used to guide the optimization process. Chen et al. present a method that optimizes molecules one fragment at a time and requires fewer parameters and training data while still improving optimization performance.","authors":["Ziqi Chen","Martin Renqiang Min","Srinivasan Parthasarathy","Xia Ning"],"meta":["December 2021Nature Machine Intelligence 3(12):1-10","DOI:10.1038/s42256-021-00410-2"],"references":["353275939_Highly_accurate_protein_structure_prediction_with_AlphaFold","346175796_PubChem_in_2021_New_data_content_and_improved_web_interfaces","339335167_In_silico_Strategies_to_Support_Fragment-to-Lead_Optimization_in_Drug_Discovery","337727084_Scaffold-based_molecular_design_with_a_graph_generative_model","356147868_Learning_multimodal_graph-to-graph_translation_for_molecular_optimization","354593536_Graph_Polish_A_Novel_Graph_Generation_Paradigm_for_Molecular_Optimization","343779486_MoFlow_An_Invertible_Flow_Model_for_Generating_Molecular_Graphs","340465787_The_Synthesizability_of_Molecules_Proposed_by_Generative_Models","339438659_A_Deep_Learning_Approach_to_Antibiotic_Discovery","338096463_Grammar_variational_autoencoder"]}