{"id":"357019831_Research_on_Methods_of_English_Text_Detection_and_Recognition_Based_on_Neural_Network_Detection_Model","abstract":"With the rapid development of computer science, a large number of images and an explosive amount of information make it difficult to filter and effectively extract information. This article focuses on the inability of effective detection and recognition of English text content to conduct research, which is useful for improving the application of intelligent analysis significance. This paper studies how to improve the neural network model to improve the efficiency of image text detection and recognition under complex background. The main research work is as follows: (1) An improved CTPN multidirectional text detection algorithm is proposed, and the algorithm is applied to the multidirectional text detection and recognition system. It uses the multiangle rotation of the image to be detected, then fuses the candidate text boxes detected by the CTPN network, and uses the fusion strategy to find the best area of the text. This algorithm solves the problem that the CTPN network can only detect the text in the approximate horizontal direction. (2) An improved CRNN text recognition algorithm is proposed. The algorithm is based on CRNN and combines traditional text features and depth features at the same time, making it possible to recognize occluded text. The algorithm was tested on the IC13 and SVT data sets. Compared with the CRNN algorithm, the recognition accuracy has been improved, and the detection and recognition accuracy has increased by 0.065. This paper verifies the effectiveness of the improved algorithm model on multiple data sets, which can effectively detect various English texts, and greatly improves the detection and recognition performance of the original algorithm.","authors":["Chunlan Li"],"meta":["December 2021Scientific Programming 2021:1-11","DOI:10.1155/2021/6406856"],"references":["335425398_Mask_TextSpotter_An_End-to-End_Trainable_Neural_Network_for_Spotting_Text_with_Arbitrary_Shapes","329747237_AON_Towards_Arbitrarily-Oriented_Text_Recognition","329313345_Fused_Text_Segmentation_Networks_for_Multi-oriented_Scene_Text_Detection","322782308_ICDAR2017_Robust_Reading_Challenge_on_COCO-Text","322060101_Deep_TextSpotter_An_End-to-End_Trainable_Scene_Text_Localization_and_Recognition_Framework","322059745_Focusing_Attention_Towards_Accurate_Text_Recognition_in_Natural_Images","320971439_Deep_Matching_Prior_Network_Toward_Tighter_Multi-oriented_Text_Detection","320968040_Detecting_Oriented_Text_in_Natural_Images_by_Linking_Segments","320726852_Total-Text_A_Comprehensive_Dataset_for_Scene_Text_Detection_and_Recognition","319770431_PhotoOCR_Reading_Text_in_Uncontrolled_Conditions"]}