{"id":"357040856_Corpus-based_analysis_of_semi-automatically_extracted_artificial_intelligence-related_terminology","abstract":"Artificial Intelligence (AI), as a multidisciplinary field, combines computer science, robotics and cognitive science, with increasingly growing applications in many diverse areas, such as engineering, business, medicine, weather forecasting, industry, translation, natural language, linguistics, etc. In Europe, interest in AI has been rising in the last decade. One of the greatest hurdles for researchers in automated processing of technical documentation is large amounts of specific terminology. The aim of this research is to analyse the semi-automatically extracted artificial intelligence-related terminology and the most common phrases related to artificial intelligence in English and Lithuanian in terms of their structure, multidisciplinarity and connotation. For selection and analysis of terms, two programmes were chosen in this study, namely SynchroTerm and SketchEngine . The paper presents the outcomes of an AI terminological project carried out with SynchroTerm and provides an analysis of a special corpus compiled in the field of artificial intelligence using the SketchEngine platform. The analysis of semi-automatic term extraction use and corpus-based techniques for artificial intelligence-related terminology revealed that AI as a specialized domain contains multidisciplinary terminology, and is complex and dynamic. The empiric data shows that the context is essential for the evaluation of the concept under analysis and reveals the different connotation of the term.","authors":["Jurgita Mikelionienė","Jurgita Motiejuniene"],"meta":["March 2021Journal of Language and Cultural Education 9(1):30-38","DOI:10.2478/jolace-2021-0003"],"references":["329972799_Corpus-Driven_Analysis_of_Multi-Word_Terms_Including_the_Word_'Risk'_in_English_French_and_Lithuanian","326604080_A_Corpus-based_Analysis_of_the_Terminology_of_the_Social_Sciences_and_Humanities","267987423_Computational_Terminology_Exploring_Bilingual_and_Monolingual_Term_Extraction","338179837_COMPARISON_OF_AUTOMATIC_SYSTEMS_OF_TERMS'_EXTRACTION","328626723_Collocations_of_Terms_in_EU_Competition_Law_A_Corpus_Analysis_of_EU_English_Collocations_The_Role_of_Language_and_Translation_in_EU_Competition_Law","300854597_Experimental_evaluation_of_ranking_and_selection_methods_in_term_extraction","2560230_Terminological_Acquaintance_The_Importance_of_Contextual_Information_in_Terminology"]}