{"id":"357092437_Boundedness_of_Convex_Polytopes_Networks_via_Local_Fractional_Metric_Dimension","abstract":"Metric dimension is one of the distance-based parameter which is frequently used to study the structural and chemical properties of the different networks in the various fields of computer science and chemistry such as image processing, pattern recognition, navigation, integer programming, optimal transportation models, and drugs discovery. In particular, it is used to find the locations of robots with respect to shortest distance among the destinations, minimum consumption of time, and lesser number of the utilized nodes and to characterize the chemical compounds having unique presentation in molecular networks. The fractional metric dimension being a latest developed weighted version of the metric dimension is used in the distance-related problems of the aforementioned fields to find their nonintegral optimal solutions. In this paper, we have formulated the local resolving neighborhoods with their cardinalities for all the edges of the convex polytopes networks to compute their local fractional metric dimensions in the form of exact values and sharp bounds. Moreover, the boundedness of all the obtained results is also proved.","authors":["Muhammad Javaid","Hassan zafar Zafar","Amer Aljaedi","Abdulaziz Mohammad Alanazi"],"meta":["December 2021Mathematical Problems in Engineering 2021(2)","DOI:10.1155/2021/2058662"],"references":["353825080_On_Constant_Metric_Dimension_of_Some_Generalized_Convex_Polytopes","352807089_Characterization_of_Molecular_Graphs_with_Fractional_Metric_Dimension_as_Unity","352434492_Bounds_of_Fractional_Metric_Dimension_and_Applications_with_Grid-Related_Networks","351591629_Improved_Lower_Bound_of_LFMD_with_Applications_of_Prism-Related_Networks","350028331_Computing_Bounds_of_Fractional_Metric_Dimension_of_Metal_Organic_Graphs","346894724_Sharp_Bounds_of_Local_Fractional_Metric_Dimensions_of_Connected_Networks","337110100_On_the_Families_of_Graphs_With_Unbounded_Metric_Dimension","332301859_On_the_local_fractional_metric_dimension_of_corona_product_graphs","330490436_Fractional_Metric_Dimension_of_Generalized_Jahangir_Graph","346975875_On_sharp_bounds_of_the_Partition_Dimension_of_Convex_Polytoes"]}