{"id":"357013729_Lindstrom's_theorem_both_syntax_and_semantics_free","abstract":"Lindström’s theorem characterizes first-order logic in terms of its essential model theoretic properties. One cannot gain expressive power extending first-order logic without losing at least one of compactness or downward Löwenheim–Skolem property. We cast this result in an abstract framework of institution theory, which does not assume any internal structure either for sentences or for models, so it is more general than the notion of abstract logic usually used in proofs of Lindström’s theorem; indeed, it can be said that institutional model theory is both syntax and semantics free. Our approach takes advantage of the methods of institutional model theory to provide a structured proof of Lindström’s theorem at a level of abstraction applicable to any logical system that is strong enough to describe its own concept of isomorphism and its own concept of elementary equivalence. We apply our results to some logical systems formalized as institutions and widely used in computer science practice.","authors":["Daniel Găină","Tomasz Kowalski"],"meta":["December 2021Journal of Logic and Computation","DOI:10.1093/logcom/exab073","Project: The relationship between gaining expressive power in extending first-order logics and losing “control” over the extension"],"references":["344124150_Fraisse-Hintikka_Theorem_in_institutions","343492312_Forcing_and_Calculi_for_Hybrid_Logics","333345941_Specification_and_Verification_of_Invariant_Properties_of_Transition_Systems","316529434_Foundations_of_logic_programming_in_hybrid_logics_with_user-defined_sharing","312093559_Birkhoff_style_calculi_for_hybrid_logics","276384653_Downward_Lowenheim-Skolem_Theorem_and_interpolation_in_logics_with_constructors","321509003_Monographs_in_Theoretical_Computer_Science_An_EATCS_Series","301846899_Implicit_Kripke_Semantics_and_Ultraproducts_in_Stratified_Institutions","265443817_Subsystems_of_Second_Order_Arithmetic","265351411_Mathematical_logic_Transl_from_the_German_by_Ann_S_Ferebee"]}