{"id":"357068580_Digitaliser_le_doigt_Les_ecrans_tactiles_revent-ils_de_viande_humaine","abstract":"Cet article propose de dénaturaliser la notion de « tactile » et le vocabulaire métaphorique qui l’accompagne – telle que la « fluidité », l’« interactivité » ou la « reponsivité » – qui engagent un rapport fasciné à l’écran contemporain. Nous nous intéressons pour cela au coup de doigt sur l’écran, c’est-à-dire au moment où l’usager manipule du bout du doigt l’interface : c’est dans cette rencontre entre du technique et du corporel que se joue la continuité entre le corps et l’écran. Il s’agit d’observer les manières dont ce doigt est digitalisé, traité par l’écran ; d’interroger le tactile à la fois comme processus technique, informatique ; humain, sémiotique et anthropologique ; et économique, typique d’une industrie nouvelle. Dans un premier temps, nous reviendrons sur les conditions d’élaboration de la critique de la notion de « tactile » et l’outillage conceptuel qu’elle demande, celui de l’écriture. Nous proposons de réinscrire l’écran d’abord dans sa dimension technique, ergonomique et interprétative. Puis, nous analysons les pratiques de conception qui participent à produire l’illusion d’une continuité entre le corps et l’écran. Enfin, il s’agit de montrer que, alors que les écrans dépassent largement la frontière du doigt pour produire de la donnée à partir du corps entier, ses discours et ses imaginaires contribuent à faire diversion des enjeux économiques et de pouvoir qui les traversent.","authors":["Inès Garmon"],"meta":["January 2021SHS Web of Conferences 130(39):01002","DOI:10.1051/shsconf/202113001002"],"references":["356178210_L'Oeil_et_l'esprit","345291961_La_liberation_de_la_main_d'Andre_Leroi-Gorhan","330439732_Le_numerique_comme_ecriture_Theorie_et_methode_d'analyse","323778438_FORCES_ET_SENSATIONS_DANS_LA_PEINTURE_DE_FRANCIS_BACONREFERENCE_FRANCIS_BACON_LOGIQUE_DE_LA_SENSATION_SKIRA","302192240_La_saveur_du_monde_Une_anthropologie_des_sens","290182918_Contribution_aux_avancees_de_la_connaissance_en_Information_-_Communication","274784082_La_memoire_de_l'oubli_eloge_de_l'alienation_Pour_une_poetique_de_l'infra-ordinaire","274784071_La_lettrure_a_l'ecran_Lire_ecrire_au_regard_des_medias_informatises","274550681_Phenomenologie_de_la_Perception","271151802_L'_experience_de_la_chair_chez_le_dernier_Merleau-Ponty","270270968_Le_geste_et_la_parole","250375768_Memoires_-_outils_-_langages_Vers_une_societe_du_texte","250375557_L'ecrit_d'ecran_pratiques_d'ecriture_informatique","238454135_Pour_une_anthropologie_des_sens"]}