{"id":"357070151_Physics-based_machine_learning_for_subcellular_segmentation_in_living_cells","abstract":"Segmenting subcellular structures in living cells from fluorescence microscope images is a ground truth (GT)-deficient problem. The microscopes’ three-dimensional blurring function, finite optical resolution due to light diffraction, finite pixel resolution and the complex morphological manifestations of the structures all contribute to GT-hardness. Unsupervised segmentation approaches are quite inaccurate. Therefore, manual segmentation relying on heuristics and experience remains the preferred approach. However, this process is tedious, given the countless structures present inside a single cell, and generating analytics across a large population of cells or performing advanced artificial intelligence tasks such as tracking are greatly limited. Here we bring modelling and deep learning to a nexus for solving this GT-hard problem, improving both the accuracy and speed of subcellular segmentation. We introduce a simulation-supervision approach empowered by physics-based GT, which presents two advantages. First, the physics-based GT resolves the GT-hardness. Second, computational modelling of all the relevant physical aspects assists the deep learning models in learning to compensate, to a great extent, for the limitations of physics and the instrument. We show extensive results on the segmentation of small vesicles and mitochondria in diverse and independent living- and fixed-cell datasets. We demonstrate the adaptability of the approach across diverse microscopes through transfer learning, and illustrate biologically relevant applications of automated analytics and motion analysis.","authors":["Arif Ahmed Sk","Ida Opstad","Gustav Godtliebsen","Asa Birna Birgisdottir"],"meta":["December 2021Nature Machine Intelligence 3(12)","DOI:10.1038/s42256-021-00420-0"],"references":["342053448_Learning_Nanoscale_Motion_Patterns_of_Vesicles_in_Living_Cells","339255158_Imaging_of_macrophage_mitochondria_dynamics_in_vivo_reveals_cellular_activation_phenotype_for_diagnosis","327430203_Automatic_Cell_Segmentation_by_Adaptive_Thresholding_ACSAT_for_Large-Scale_Calcium_Imaging_Datasets","324574642_UNet_A_Nested_U-Net_Architecture_for_Medical_Image_Segmentation","343456623_EfficientDet_Scalable_and_Efficient_Object_Detection","343269882_Feedback_U-net_for_Cell_Image_Segmentation","340774356_Quantitative_analysis_of_interactive_behavior_of_mitochondria_and_lysosomes_using_structured_illumination_microscopy","340552296_Cell_Image_Segmentation_Using_Generative_Adversarial_Networks_Transfer_Learning_and_Augmentations","337638949_KUnet_Microscopy_Image_Segmentation_With_Deep_Unet_Based_Convolutional_Networks","327806139_Unsupervised_Image_Segmentation_by_Backpropagation"]}