{"id":"357067500_Toucher_l'interface_interfacer_le_toucher","abstract":"Cet article vise à monter l’importance de l’interface dans la compréhension du toucher. Nous commencerons tout d’abord par le décrire selon une approche phénoménologique. Le toucher est spécifiquement le sens de la proximité, de la solidité, et de la forme, faisant de celui-ci le sens de la présence immédiate. Ensuite, nous montrerons que le numérique est intouchable, car d’une part, il n’est pas une chose que l’on peut saisir avec les mains, d’autre part, il est constitué de signes formels abstraits, enfin, il est inaccessible car protégé par un copyright . Nous démontrerons alors que l’interface permet de résoudre cette difficulté. En tant que sousface constituée de symboles informatiques, elle touche la couche matérielle de l’ordinateur; en tant qu’interface homme/machine, c’est-à-dire surface , elle est touchable. Nous conclurons alors que nous ne touchons pas immédiatement le numérique, et que le toucher est nécessairement médiat, remettant en cause la conception première du toucher. Nous substituerons alors au terme de toucher celui de contact qui conserve l’idée de médiation. Nous distinguerons enfin le contact opéré par l’interface homme/machine qui capture, du contact humain qui caresse, c’est-à-dire qui prend soin de maintenir autrui intouchable.","authors":["Guillaume Giroud"],"meta":["January 2021SHS Web of Conferences 130(2):01003","DOI:10.1051/shsconf/202113001003"],"references":["356110246_Surface_Interface_Subface_Three_Cases_of_Interaction_and_One_Concept","322643713_Archaeologies_of_Touch_Interfacing_with_Haptics_from_Electricity_to_Computing","349774506_La_crise_de_la_representation","342167559_The_Skin_of_the_Film_Intercultural_Cinema_Embodiment_and_the_Senses","330317833_La_mutation_infinie_du_sens","329952674_HereThere_Telepresence_Touch_and_Art_at_the_Interface","324935633_Downcast_Eyes_The_Denigration_of_Vision_in_Twentieth-Century_French_Thought","321876284_Autrement_qu'etre_ou_au-dela_de_l'essence","320182224_Idees_directrices_pour_une_phenomenologie","320182035_Fudo_Le_milieu_humain","320181918_La_voix_et_le_phenomene","320181575_Anthropologie_du_point_de_vue_pragmatique","316997945_The_Stack_On_Software_and_Sovereignty","305222409_On_the_Existence_of_Digital_Objects","281885198_Le_sens_de_la_technique_le_numerique_et_le_calcul"]}