{"id":"357132459_QUAIS_OS_LIMITES_E_DESAFIOS_ETICOS_NOS_NEGOCIOS_DIGITAIS_A_ECONOMIA_DO_CONHECIMENTO_E_A_INTANGIBILIDADE","abstract":"Nos últimos 50 anos, o desenvolvimento da ciência da computação e suas consequentes tecnologias contribuiu fortemente para uma transformação da vida humana. Particularmente, o surgimento da web nos anos 1990 e a crescente utilização de tecnologias como a Inteligência Artificial (IA) levaram a mudanças paradigmáticas na sociedade (Brynjolfsson & McAfee, 2014; O'Neil, 2016; Sperling, 2020). Se, no passado industrial, gestores e empreendedores avaliavam a tecnologia como uma \"ferramenta\" de auxílio aos negócios, recentemente a percepção da sociedade (e de pesquisadores) é de que a tecnologia é central a qualquer atividade econômica. A crescente relevância das tecnologias digitais também tem levado pesquisadores a repensarem, inclusive, como incluir novas riquezas, bens ou conhecimentos intangíveis no cálculo de produtividade das organizações, bem como os leva a introduzir (ou pelo menos analisar a possibilidade de incluí-los) nos próprios indicadores de produto interno bruto. Em uma publicação recente, Brynjolfsson et. al., 2019 refletem sobre a possibilidade (ou necessidade) de incluir no cômputo do produto interno bruto dos países o valor intangível dos bens digitais. Na atualidade, muitos destes bens digitais são construídos de forma a incrementar a produtividade de pessoas e organizações. Os autores descrevem experimentos nos quais os consumidores voluntários avaliam o preço dos bens digitais que consomem diariamente (mídias sociais, enciclopédias online como a wikipedia, entre outros). No artigo, os resultados indicam que os consumidores atribuiriam preços mensais que estariam dispostos a pagar. Uma das prováveis hipóteses a considerar em pesquisas futuras, sobre este tema, é como computar o valor agregado que estes bens digitais geram na economia contemporânea, pois esse valor ainda não é adequadamente considerado, conforme os autores.","authors":["Luís C. Lamb"],"meta":["December 2021","DOI:10.52959/2021535411","Project: Human and Social-Problem Solving in Complex Networks"],"references":["332048909_GDP-B_Accounting_for_the_Value_of_New_and_Free_Goods_in_the_Digital_Economy","332030363_Assessing_gender_bias_in_machine_translation_a_case_study_with_Google_Translate"]}