{"id":"357173533_Light_diacritic_restoration_to_disambiguate_homographs_in_modern_Arabic_texts","abstract":"Diacritic restoration (also known as diacritization, vowelization) is the process of inserting the correct diacritical markings into a text. Modern Arabic is typically written without diacritics, e.g., newspapers. This lack of diacritical markings often causes ambiguity, and though natives are adept at resolving, there are times they may fail. Diacritic restoration is a classical problem in computer science. Still, as most of the works tackle the full (heavy) diacritization of text, we, however, are interested in diacritizing the text using a fewer number of diacritics. Studies have shown that a fully diacritized text is visually displeasing and slows down the reading. This paper proposes a system to diacritize homographs using the least number of diacritics, thus the name \"light\". There is a large class of words that fall under the homograph category, and we will be dealing with the class of words that share the spelling but not the meaning. With fewer diacritics, we do not expect any effect on reading speed while eye strain is reduced. The system contains morphological analyzer and context similarities. The morphological analyzer is used to generate all word candidates for diacritics. Then, through a statistical approach and context similarities, we resolve the homographs. Experimentally, the system shows very promising results, and our best accuracy is 85.6%.","authors":["Aqil Azmi","Rehab M Alnefaie","Hatim A Aboalsamh"],"meta":["May 2022ACM Transactions on Asian and Low-Resource Language Information Processing 21(3):60:1-60:14","DOI:10.1145/3486675"],"references":["334438695_Automatic_Diacritics_Restoration_for_Tunisian_Dialect","331848759_Computational_and_natural_language_processing_based_studies_of_hadith_literature_a_survey","318170624_Urdu_word_sense_disambiguation_using_machine_learning_approach","313252268_Universal_web_accessibility_and_the_challenge_to_integrate_informal_Arabic_users_a_case_study","308672285_Automatic_diacritics_restoration_for_modern_standard_arabic_text","303836091_MADAMIRA_A_Fast_Comprehensive_Tool_for_Morphological_Analysis_and_Disambiguation_of_Arabic","335038223_Open_Vocabulary_Arabic_Diacritics_Restoration","327000565_Hybrid_LSTMMaxEnt_Networks_for_Arabic_Syntactic_Diacritics_Restoration","322516492_Investigating_hybrid_approaches_for_Arabic_text_diacritization_with_recurrent_neural_networks","316184399_Aspects_of_word_and_sentence_processing_during_reading_Arabic_evidence_from_eye_movements"]}