{"id":"357139607_Comparing_different_nonlinearities_in_readout_systems_for_optical_neuromorphic_computing_networks","abstract":"Nonlinear activation is a crucial building block of most machine-learning systems. However, unlike in the digital electrical domain, applying a saturating nonlinear function in a neural network in the analog optical domain is not as easy, especially in integrated systems. In this paper, we first investigate in detail the photodetector nonlinearity in two main readout schemes: electrical readout and optical readout. On a 3-bit-delayed XOR task, we show that optical readout trained with backpropagation gives the best performance. Furthermore, we propose an additional saturating nonlinearity coming from a deliberately non-ideal voltage amplifier after the detector. Compared to an all-optical nonlinearity, these two kinds of nonlinearities are extremely easy to obtain at no additional cost, since photodiodes and voltage amplifiers are present in any system. Moreover, not having to design ideal linear amplifiers could relax their design requirements. We show through simulation that for long-distance nonlinear fiber distortion compensation, using only the photodiode nonlinearity in an optical readout delivers BER improvements over three orders of magnitude. Combined with the amplifier saturation nonlinearity, we obtain another three orders of magnitude improvement of the BER.","authors":["Chonghuai Ma","Joris Lambrecht","Floris Laporte","Xin Yin"],"meta":["December 2021Scientific Reports 11(1)","DOI:10.1038/s41598-021-03594-0"],"references":["332349199_Highly_parallel_simulation_and_optimization_of_photonic_circuits_in_time_and_frequency_domain_based_on_the_deep-learning_framework_PyTorch","324745055_All-Optical_Machine_Learning_Using_Diffractive_Deep_Neural_Networks","323861000_Numerical_demonstration_of_neuromorphic_computing_with_photonic_crystal_cavities","316915793_Advances_in_photonic_reservoir_computing","312872606_Digital_signal_processing_for_fiber_nonlinearities_Invited","340343276_Experimental_Realization_of_Arbitrary_Activation_Functions_for_Optical_Neural_Networks","339035112_Photonic_neuromorphic_information_processing_and_reservoir_computing","331236389_A_Neuromorphic_Silicon_Photonics_Nonlinear_Equalizer_For_Optical_Communications_With_Intensity_Modulation_and_Direct_Detection","329127558_All-optical_nonlinear_activation_function_for_photonic_neural_networks_Invited","308965117_Deep_Learning_with_Coherent_Nanophotonic_Circuits"]}