{"id":"357158163_ANALYSE_DU_DISCOURS_LIES_A_L'EFFET_DE_LA_TRADUCTION_EN_LIGNE_SUR_L'ENVIRONNEMENT_EDUCATIF_FOCUS_SUR_LES_DEPARTEMENTS_DE_LANGUE_ETRANGERE","abstract":"ABSTRAIT La rédaction d'articles dans cette revue vise à analyser un texte argumentatif. C'est là que s'effectue cette analyse comme condition pour accomplir la tâche finale de l'analyse du discours. Qui est à l'ère des développements technologiques de plus en plus sophistiqués, une partie de l'ère de la mondialisation facilitée par les ordinateurs et Internet est devenue une nécessité qui aide les activités humaines dans leur vie. Pour que les avancées technologiques et la commodité apportée puissent donner lieu à une traduction Google qui peut se faire sentir par les bénéfices de la communauté, notamment pour les étudiants qui sont déjà familiers à leurs oreilles et même du monde entier sont devenus une partie indissociable du monde de l'éducation. Sa présence facilite la tâche des utilisateurs en regroupant les avancées technologiques dans le domaine informatique de plus en plus sophistiqué et en permettant aux utilisateurs de traduire facilement la langue qu'ils recherchent en accédant à des applications ou au Web connectés à Internet. Ceci est soutenu par le rôle important d'Internet dans le monde numérique, ce qui nous permet de trouver plus facilement ce que nous voulons et de faire beaucoup de choses avec Internet pour être connecté largement ou globalement avec Internet. Mais surtout parmi les nombreux avantages offerts par la traduction Google, il y a des inconvénients à la traduction Google. Même avec les nombreuses perceptions ou points de vue de ses utilisateurs qui sont toujours pour et contre, il devient alors urgent d'explorer et d'examiner la qualité et l'influence de ses utilisateurs, qui sont aussi pour la plupart des étudiants qui étudient les langues et littératures étrangères.","authors":["Bernadus Wahyudi","Joko Santoso","Fakultas Bahasa","Dan Seni"],"meta":["December 2021Argumentation et Analyse du Discours","Project: Jurnal Linguistik Bahasa dan Sastra"],"references":[]}