{"id":"357180483_The_Structural_Relationship_between_Service_Quality_and_Sustainable_Use_Intention_of_Voice_Search_Technology_in_Korea","abstract":"Voice search based on artificial intelligence is the fastest means of searching for information and can be easily used in a very familiar way by ordinary users without separate education or learning. Voice bot’s voice search can interact on the same level as face-to-face communication and provide customized services optimized for users. It is most important for these new technologies to develop from a non-face-to-face social structure caused by COVID-19 to a long-term sustainable technology rather than short-term development. Therefore, the purpose of this study is to empirically verify the structural relationship between the quality, interactivity, and consumers’ sustainable use intentions for voice search services called ‘voice bots’ in Korea, an advanced country of computer science and technology. A survey was conducted on Korean consumers aged 20 or older who use voice search services, and the following main results were derived. First, the playfulness, certainty, and empathy of the ‘voice bot’ have a positive effect on the interactivity with the ‘voice bot’. Second, interactivity with the ‘voice bot’ has a positive effect on consumers’ sustainable use intention. Third, the playfulness and certainty of ‘voice bot’ have a positive effect on consumers’ sustainable use intention. Fourth, the playfulness, certainty, and empathy of the ‘voice bot’ have a positive effect on consumers’ sustainable use intention through interactivity with the ‘voice bot’. This study is meaningful in that it empirically identified the importance of interactivity by deriving the service quality factors required for sustainable use of voice search services, one of the new innovative technologies.","authors":["Jaepil Yoo"],"meta":["December 2021Sustainability 13(24):14026","DOI:10.3390/su132414026"],"references":["347860111_Examining_User_Perception_and_Usage_of_Voice_Search","346263493_Untact_Customer's_Acceptance_Intention_toward_Robot_Barista_in_Coffee_Shop","335148344_Industry_50-A_Human-Centric_Solution","330744852_The_Effect_of_Market_Orientation_on_Performance_of_Sharing_Economy_Business_Focusing_on_Marketing_Innovation_and_Sustainable_Competitive_Advantage","342710269_User_Experience_Analysis_and_Management_Based_on_Text_Mining_A_Smart_Speaker_Case","342176267_A_Study_on_the_Key_Design_Trends_of_the_Company_Campuses_for_Organizational_Innovation_in_a_New_Era_of_Sustainability_-_Focusing_on_the_Recent_Cases_of_Global_IT_Organizations_-","341208163_Implementation_of_IoT_Smart_Blackout_Curtain_Including_Voice_Recognition_Function","334766081_Usability_Evaluation_of_Artificial_Intelligence_Search_Services_Using_the_Naver_App","334502422_Effect_of_machine_stiffness_on_interpreting_contact_force-indentation_depth_curves_in_adhesive_elastic_contact_experiments","330302188_What's_up_with_Privacy_User_Preferences_and_Privacy_Concerns_in_Intelligent_Personal_Assistants"]}