{"id":"357230621_Sistematizacao_de_tecnicas_de_visualizacao_da_informacao_para_a_modelagem_de_dominios","abstract":"Objetivo: Busca elencar e caracterizar técnicas de visualização de informação aplicáveis a sistemas e softwares relacionados com a modelagem de domínios do conhecimento que sejam voltados para representação e recuperação da informação.Metodologia: Utiliza abordagem qualitativa, com objetivo exploratório e procedimento bibliográfico de natureza aplicada para identificar técnicas de visualização da informação presentes na literatura da Ciência da Informação e Ciência da Computação e estabelecer categorias de análise para realizar a sistematização dessas técnicas. Resultados:Na categoria Estrutura linear foram alocadas as técnicas Fish-eye e Perspective Wall. Na segunda categoria, temos as técnicas Coordenadas Paralelas e Table Lens classificadas como Estruturas multidimensionais. Na categoria em que consistem as Estruturas hierárquicas, foram classificadas as técnicas Cone Tree, Treemap e Árvore Hiperbólica. A quarta e última categoria abordada é a de Estrutura em redes na qual consiste a técnica de Grafos. Conclusões: Quando o tratamento, a representação e a recuperação da informação com os SOCs não são pensados em conjunto com as formas de representação gráfica, torna-se costumeiro encontrarmos sistemas falhos que não apresentam subordinações e relações entre os conceitos de forma clara e coesa para seu usuário. As técnicas de visualização da informação manifestam-se como recursos que permitem uma representação interativa das informações, de modo que haja melhoria no seu processo cognitivo, busca e recuperação em um sistema.","authors":["Tainá Regly","Maria Luiza de Almeida Campos","Linair Campos"],"meta":["October 2021Informação & Informação 26(3):327","DOI:10.5433/1981-8920.2021v26n3p327"],"references":["281214279_A_contribuicao_da_organizacao_e_da_visualizacao_da_informacao_para_os_sistemas_de_recuperacao_de_informacao","270487490_Representacoes_visuais_para_recuperacao_de_informacao_na_BDTD-UFPE","267403645_Visualizacao_de_Informacoes_-_Uma_Abordagem_Pratica","250987869_Modelizacao_de_dominios_de_conhecimento_uma_investigacao_de_principios_fundamentais","224285723_Information_Visualization_Perception_for_Design_Second_Edition","242411475_Readings_in_Information_Visualization_-_Using_Vision_to_Think","241156481_Studies_on_the_Visualization_for_Web_Information_Retrieval","220693727_Interactive_Data_Visualization_-_Foundations_Techniques_and_Applications","220689482_Introduction_to_Information_Visualization","3651286_The_Eyes_Have_It_A_Task_by_Data_Type_Taxonomy_for_Information_Visualizations"]}