{"id":"357296924_Investigating_the_Effect_of_Traffic_Sampling_on_Machine_Learning-Based_Network_Intrusion_Detection_Approaches","abstract":"Machine Learning (ML) based Network Intrusion Systems (NIDSs) operate on flow features which are obtained from flow exporting protocols (i.e., NetFlow). Recent success of ML and Deep Learning (DL) based NIDS solutions assume such flow information (e.g., avg. packet size) is obtained from all packets of the flow. However, often in practice flow exporter is deployed on commodity devices where packet sampling is inevitable. As a result, applicability of such ML based NIDS solutions in the presence of sampling (i.e., when flow information is obtained from sampled set of packets instead of full traffic) is an open question. In this study, we explore the impact of packet sampling on the performance and efficiency of ML-based NIDSs. Unlike previous work, our proposed evaluation procedure is immune to different settings of flow export stage. Hence, it can provide a robust evaluation of NIDS even in the presence of sampling. Through sampling experiments we established that malicious flows with shorter size (i.e., number of packets) are likely to go unnoticed even with mild sampling rates such as 1/10 and 1/100. Next, using the proposed evaluation procedure we investigated the impact of various sampling techniques on NIDS detection rate and false alarm rate. Detection rate and false alarm rate is computed for three sampling rates (i.e., 1/10, 1/100, 1/1000), for four different sampling techniques and for three (two tree-based, one deep learning based) classifiers. Experimental results show that systematic linear sampler - SketFlow performs better compared to non-linear samplers such as Sketch Guided and Fast Filtered sampling. We also found that random forest classifier with SketchFlow sampling was a better combination. The combination showed higher detection rate and lower false alarm rate across multiple sampling rates compared to other sampler-classifier combinations. Our results are consistent in multiple sampling rates, exceptional case is observed for Sketch Guided Sampling (SGS) as it caused a drastic performance drop when sampling rate was changed from 1/100 to 1/1000. Our results provide valuable insights for network practitioners and researchers regarding on how packet sampling effects ML-based NIDS in the presence of sampling.","authors":["Jumabek Alikhanov","Rhongho Jang","Mohammed Abuhamad","David Mohaisen"],"meta":["December 2021IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2021.3137318"],"references":["352182522_Adversarial_Attack_and_Defence_through_Adversarial_Training_and_Feature_Fusion_for_Diabetic_Retinopathy_Recognition","352107893_Botnet_Attack_Detection_Using_Local_Global_Best_Bat_Algorithm_for_Industrial_Internet_of_Things","344667545_Intelligent_Detection_of_IoT_Botnets_Using_Machine_Learning_and_Deep_Learning","344076571_A_Hierarchical_Hybrid_Intrusion_Detection_Approach_in_IoT_Scenarios","336278268_MIMETIC_Mobile_Encrypted_Traffic_Classification_using_Multimodal_Deep_Learning","332203589_Deep_Learning_Approach_for_Intelligent_Intrusion_Detection_System","351108353_Proactive_Scheduling_and_Resource_Management_for_Connected_Autonomous_Vehicles_A_Data_Science_Perspective","343434247_SketchFlow_Per-Flow_Systematic_Sampling_Using_Sketch_Saturation_Event","336946367_InstaMeasure_Instant_Per-flow_Detection_Using_Large_In-DRAM_Working_Set_of_Active_Flows","333894962_Deep_Learning_Techniques_for_Cyber_Security_Intrusion_Detection_A_Detailed_Analysis"]}