{"id":"357280821_Special_Issue_of_The_2_nd_International_Conference_on_Computer_Science's_Complex_Systems_and_their_Applications_ICCSA'2021_Norm_Regularization_Method_for_Additive_Noise_Removal","abstract":"It is widely acknowledged that image denoising problem has been studied in the areas of image processing. The denoising problem is to recover original image u from the observed image f. In this paper, 1 l and 2 l-norm regularization are studied, developed and implemented in order to restore images contaminated by additive noise. To solve these two approaches problems, the discretization finite difference method is employed before applying the gradient descent algorithm to optimize the noised signal. According to experiment results, the two methods are applied to some test images with different level noise then compared by using the quality metrics Signal Noise to Ratio SNR , Peak-Signal-to-Noise-Ratio(PSNR) and Structural Similarity Index(SSIM). Through this study, the algorithm which minimizes 2 l-norm of gradient of image has a unique solution and it's easy to implement, but it doesn't accept contour discontinuities, causing the obtained solution to be smooth. The 2 l-norm will blur the edges of the image. In order to preserve sharp edges, 1 l-norm is introduced. So, we can confirm that 1 l regularization encourages image smoothness while allowing for presence of jumps and discontinuities, a key feature for image processing because of the importance of edges in human vision.","authors":["Nacira Diffellah","Rabah Hamdini","Tewfik Bekkouche"],"meta":["January 2022"],"references":["222469583_Nonlinear_total_variation_based_noise_removal_algorithms","336826226_Adaptive_Total_Variation_L1_Regularization_for_Salt_and_Pepper_Image_Denoising","312771295_Image_quality_assessment_From_error_visibility_to_structural_similarity","259300565_Noise_over_water_surfaces_in_Landsat_TM_images","259267556_The_normal_distribution_Characterizations_with_applications","255608821_ALGORITHMS_FOR_TOTAL_VARIATION_MINIMIZATION","243119416_Evolution_of_characteristic_functions_of_convex_sets_in_the_plane_by_the_minimizing_total_variation_flow","234815620_High_speed_pipeline_architecture_for_adaptive_median_filter","44241018_A_First-Order_Primal-Dual_Algorithm_for_Convex_Problems_with_Applications_to_Imaging"]}