{"id":"357348172_Patch_individual_filter_layers_in_CNNs_to_harness_the_spatial_homogeneity_of_neuroimaging_data","abstract":"Convolutional neural networks (CNNs)—as a type of deep learning—have been specifically designed for highly heterogeneous data, such as natural images. Neuroimaging data, however, is comparably homogeneous due to (1) the uniform structure of the brain and (2) additional efforts to spatially normalize the data to a standard template using linear and non-linear transformations. To harness spatial homogeneity of neuroimaging data, we suggest here a new CNN architecture that combines the idea of hierarchical abstraction in CNNs with a prior on the spatial homogeneity of neuroimaging data. Whereas early layers are trained globally using standard convolutional layers, we introduce patch individual filters (PIF) for higher, more abstract layers. By learning filters in individual latent space patches without sharing weights, PIF layers can learn abstract features faster and specific to regions. We thoroughly evaluated PIF layers for three different tasks and data sets, namely sex classification on UK Biobank data, Alzheimer’s disease detection on ADNI data and multiple sclerosis detection on private hospital data, and compared it with two baseline models, a standard CNN and a patch-based CNN. We obtained two main results: First, CNNs using PIF layers converge consistently faster, measured in run time in seconds and number of iterations than both baseline models. Second, both the standard CNN and the PIF model outperformed the patch-based CNN in terms of balanced accuracy and receiver operating characteristic area under the curve (ROC AUC) with a maximal balanced accuracy (ROC AUC) of 94.21% (99.10%) for the sex classification task (PIF model), and 81.24% and 80.48% (88.89% and 87.35%) respectively for the Alzheimer’s disease and multiple sclerosis detection tasks (standard CNN model). In conclusion, we demonstrated that CNNs using PIF layers result in faster convergence while obtaining the same predictive performance as a standard CNN. To the best of our knowledge, this is the first study that introduces a prior in form of an inductive bias to harness spatial homogeneity of neuroimaging data.","authors":["Fabian Eitel","Jan Philipp Albrecht","Martin Weygandt","Friedemann Paul"],"meta":["December 2021Scientific Reports 11(1)","DOI:10.1038/s41598-021-03785-9"],"references":["341088633_Convolutional_Neural_Networks_for_Classification_of_Alzheimer's_Disease_Overview_and_Reproducible_Evaluation","337857733_Understanding_3D_CNN_Behavior_for_Alzheimer's_Disease_Diagnosis_from_Brain_PET_Scan","337711490_Classification_and_Visualization_of_Alzheimer's_Disease_using_Volumetric_Convolutional_Neural_Network_and_Transfer_Learning","336706651_Accurate_and_robust_segmentation_of_neuroanatomy_in_T1-weighted_MRI_by_combining_spatial_priors_with_deep_convolutional_neural_networks","335667468_Different_linear_and_nonlinear_scaling_in_UK_Biobank_brain_images_vs_machine-learning_datasets","354759407_MRI_Image_Registration_Considerably_Improves_CNN-Based_Disease_Classification","336816826_Testing_the_Robustness_of_Attribution_Methods_for_Convolutional_Neural_Networks_in_MRI-Based_Alzheimer's_Disease_Classification","336393187_Predicting_Fluid_Intelligence_in_Adolescent_Brain_MRI_Data_An_Ensemble_Approach","336377853_Unsupervised_Deep_Learning_for_Bayesian_Brain_MRI_Segmentation","335683439_Exploring_uncertainty_measures_in_deep_networks_for_Multiple_Sclerosis_lesion_detection_and_segmentation"]}