{"id":"357438301_Understanding_Population_Dynamics_in_Multi-_and_Many-Objective_Evolutionary_Algorithms_for_High-Resolution_Approximations","abstract":"Achieving a high-resolution approximation and hitting the Pareto optimal set with some if not all members of the population is the goal for multi- and many-objective optimization problems, and more so in real-world applications where there is also the desire to extract knowledge about the problem from this set. The task requires not only to reach the Pareto optimal set but also to be able to continue discovering new solutions, even if the population is filled with them. Particularly in many-objective problems where the population may not be able to accommodate the full Pareto optimal set. In this work, our goal is to investigate some tools to understand the behavior of algorithms once they converge and how their population size and particularities of their selection mechanism aid or hinder their ability to keep finding optimal solutions. Through the use of features that look into the population composition during the search process, we will look into the algorithm’s behavior and dynamics and extract some insights. Features are defined in terms of dominance status, membership to the Pareto optimal set, recentness of discovery, and replacement of optimal solutions. Complementing the study with features, we also look at the approximation through the accumulated number of Pareto optimal solutions found and its relationship to a common metric, the hypervolume. To generate the data for analysis, the chosen problem is MNK-landscapes with settings that make it easy to converge, enumerable for instances with 3 to 6 objectives. Studied algorithms were selected from representative multi- and many-objective optimization approaches such as Pareto dominance, relaxation of Pareto dominance, indicator-based, and decomposition.","authors":["Hugo Monzón Maldonado","Hernan Eduardo Aguirre","Sebastien Verel","Arnaud Liefooghe"],"meta":["December 2021Advances in Operations Research 2021:1-16","DOI:10.1155/2021/6699277"],"references":["325469720_An_overview_on_evolutionary_algorithms_for_many-objective_optimization_problems","318067642_Optimizing_one_million_variable_NK_landscapes_by_hybridizing_deterministic_recombination_and_local_search","282530911_Many-Objective_Evolutionary_Algorithms","266204260_An_Analysis_on_Selection_for_High-Resolution_Approximations_in_Many-Objective_Optimization","261460603_Space_trajectory_design_Analysis_of_a_real-world_many-objective_optimization_problem","320181465_The_origins_of_order_self-organization_and_selection_in_evolution","317219370_A_fast_elitist_non-dominated_sorting_genetic_algorithm_for_multi-objective_optimization_NSGA-II","305865273_On_the_low-discrepancy_sequences_and_their_use_in_MOEAD_for_high-dimensional_objective_spaces","290742104_A_Real-World_Application_of_a_Many-Objective_Optimisation_Complexity_Reduction_Process","290742100_Adaptive_e-Sampling_and_e-Hood_for_Evolutionary_Many-Objective_Optimization"]}