{"id":"357435167_Peer_tutoring_of_computer_programming_increases_exploratory_behavior_in_children","abstract":"There is growing interest in teaching computer science and programming skills in schools. Here we investigated the efficacy of peer tutoring, which is known to be a useful educational resource in other domains but never before has been examined in such a core aspect of applied logical thinking in children. We compared (a) how children (N = 42, age range = 7 years 1 month to 8 years 4 months) learn computer programming from an adult versus learning from a peer and (b) the effect of teaching a peer versus simply revising what has been learned. Our results indicate that children taught by a peer showed comparable overall performance—a combination of accuracy and response times—to their classmates taught by an adult. However, there was a speed–accuracy trade-off, and peer-taught children showed more exploratory behavior, with shorter response times at the expense of lower accuracy. In contrast, no tutor effects (i.e., resulting from teaching a peer) were found. Thus, our results provide empirical evidence in support of peer tutoring as a way to help teach computer programming to children. This could contribute to the promotion of a widespread understanding of how computers operate and how to shape them, which is essential to our values of democracy, plurality, and freedom.","authors":["Diego Pablo de la Hera","María B. Zanoni","Mariano Sigman","Cecilia Calero"],"meta":["April 2022Journal of Experimental Child Psychology 216(6):105335","DOI:10.1016/j.jecp.2021.105335"],"references":["354428785_Learning-by-Teaching_Approach_Improves_Dengue_Knowledge_in_Children_and_Parents","341481715_Computer-supported_Collaborative_Learning_in_Programming_Education_A_Systematic_Literature_Review","336535950_Young_children_consider_the_expected_utility_of_others'_learning_to_decide_what_to_teach","335452218_Social_interaction_and_conceptual_change_pave_the_way_away_from_children's_misconceptions_about_the_Earth","333481200_The_Language_of_Programming_A_Cognitive_Perspective","323384039_The_Teaching_Instinct","328527684_The_Cognitive_Benefits_of_Learning_Computer_Programming_A_Meta-Analysis_of_Transfer_Effects","324539123_The_learning_benefits_of_teaching_A_retrieval_practice_hypothesis","319278052_A_Meta-Analysis_of_Pair-Programming_in_Computer_Programming_Courses_Implications_for_Educational_Practice","316369653_Building_coding_and_programming_3D_models_via_a_visual_programming_environment"]}