{"id":"357482672_Relationship_between_Korean_Informatics_Curriculum_and_Textbook_Learning_Element_Considering_Compound_Word","abstract":"With the development of information and communication technology, countries around the world have strengthened their computer science curriculums. Korea also revised the informatics curriculum(The name of a subject related to computer science in Korea is informatics.) in 2015 with a focus on computer science. The purpose of this study was to automatically extract and analyze whether textbooks reflected the learning elements of the informatics curriculum in South Korea. Considering the forms of terms of the learning elements mainly comprised of compound words and the characteristics of Korean language, which makes natural language processing difficult due to various transformations, this study pre-processed textbook texts and the learning elements and derived their reflection status and frequencies. The terms used in the textbooks were automatically extracted by using the indexes in the textbooks and the part-of-speech compositions of the indexes. Moreover, this study analyzed the relevance between the terms by deriving confidence of other terms for each learning element used in the textbooks. As a result of the analysis, this study revealed that the textbooks did not reflect some learning elements in the forms presented in the curriculum, suggesting that the textbooks need to explain the concepts of the learning elements by using the forms presented in the curriculum at least once. This study is meaningful in that terms were automatically extracted and analyzed in Korean textbooks based on the words suggested by the curriculum. Also, the method can be applied equally to textbooks of other subjects.","authors":["Jaehong Kim","Hosung Woo","Jamee Kim","Wongyu Lee"],"meta":["December 2021","DOI:10.30630/joiv.5.4.731"],"references":["347579594_Presenting_Basic_CS_Concepts_A_Content_Analysis_of_AP_CSA_Textbooks","346276007_Neural_Relation_Extraction_on_Wikipedia_Tables_for_Augmenting_Knowledge_Graphs","344023842_Exploring_the_AI_Topic_Composition_of_K-12_Using_NMF-based_Topic_Modeling","339098802_Analysis_of_Core_Concepts_in_Problem_Solving_and_Programming_Unit_of_Informatics_Subject_Textbooks_in_Middle_School_Revised_in_2015","220808488_Analysis_of_computer_science_related_curriculum_on_LDA_and_Isomap"]}