{"id":"357406774_TURKIYE'DE_YONETIM_BILISIM_SISTEMLERI_ALANINDAKI_ARASTIRMACILARIN_GENEL_DOKUSU_UZERINE_BIR_DEGERLENDIRME_AN_ASSESSMENT_ON_THE_GENERAL_PROFILE_OF_MANAGEMENT_INFORMATION_SYSTEMS_RESEARCHERS_IN_TURKEY","abstract":"Yönetim Bilişim Sistemleri, insan, teknoloji ve örgüt arasındaki ilişkiyi bütünsel bir bakış açısı ile inceleyen disiplinler arası bir bilim dalıdır. Yönetim Bilişim Sistemlerinin fen, mühendislik ve sosyal bakış açılarını kapsayan bu yapısı lisans veya lisansüstü eğitimlerini bilgisayar bilimi, işletme bilimi veya yönetim bilimi alanlarında tamamlayan birçok araştırmacının Yönetim Bilişim Sistemleri alanına yönelmesine neden olmuştur. Bu çalışmada farklı disiplinlerden beslenen ve hızla gelişen Yönetim Bilişim Sistemleri disiplininin Türkiye’deki araştırmacı dokusu ele alınmıştır. Bu kapsamda YÖKAKADEMİK sistemi üzerinden elde edilen veri seti ile toplam Yönetim Bilişim Sistemleri bilim dalında çalışan 401 akademisyen-araştırmacı incelenmiştir. Araştırmada elde edilen bulgular ışığında Yönetim Bilişim Sistemleri disiplinin çok yönlü olmasının getirdiği durumun anomalilere sebep olup olmadığı, yükseköğretim kurumlarında görev yaptıkları yerler de dikkate alınarak tartışılmıştır.\nAnahtar Kelimeler: Yönetim Bilişim Sistemleri, Akademisyen, Araştırmacı, Türkiye, Araştırmacı Profili\n---------------------------------------------------------------------------------------------\nManagement Information Systems is an interdisciplinary field that examines the relationship between people, technology and organization with a holistic perspective. Thanks to its interdisciplinary perspective, has led many researchers who have completed their undergraduate or graduate education in computer science, business science or management science to turn to the field of Management Information Systems. In this study, researchers discuss the general aspects of Management Information Systems discipline in Turkey. In this regard, a total of 401 academicians-researchers working in the field of Management Information Systems were examined with the data set obtained through the YÖKAKADEMİK system. The study discussed whether the situation caused by the interdisciplinary nature of the Management Information Systems discipline causes anomalies, taking into account the places where researchers work in higher education institutions.\nKeywords: Management Information Systems, Academician, Researcher, Turkey, Researcher Profile","authors":["Muhammet Damar","Mehmet Cem Bölen"],"meta":["December 2021"],"references":["334586262_SCIENTOMETRICS-BASED_STUDY_OF_COMPUTER_SCIENCE_AND_INFORMATION_SYSTEMS_RESEARCH_COMMUNITY_MACRO_LEVEL_PROFILES","297544086_The_relative_importance_of_technical_and_interpersonal_skills_for_new_information_systems_personnel","266347907_Trends_in_names_of_undergraduate_computer-related_majors_in_AACSB-accredited_schools_of_business_in_the_USA","290230097_Transition_of_knowledgeskills_requirement_for_entry-level_is_professionals_An_exploratory_study_based_on_recruiters'_perception","289884867_Entry-level_IS_job_skills_A_survey_of_employers","286969199_Knowledge_and_skill_requirements_for_entry-level_IT_workers_A_longitudinal_study","270591664_Information_Systems_as_a_Reference_Discipline","249668522_US_Transnationals_and_the_Irish_Software_IndustryAssessing_the_Nature_Quality_and_Stability_of_a_New_Wave_of_Foreign_Direct_Investment","243477122_Research_in_Management_Information_Systems_1980-1984_Points_of_Work_and_Reference","242622467_The_Supply_of_Information_Technology_Workers_in_the_United_States"]}