{"id":"357516169_Inter-Territorial_Collaboration_in_the_Context_of_Strengthening_Its_Economic_SecurityOleksandr_Hlazov_Khrystyna_Kalashnikova_Volodymyr_Zolotarov_Iaroslava_Levchenko_Igor_Britchenko_Peter_Losonczi_-_IJ","abstract":"An article is devoted to developing the concept of inter-territorial collaboration in the context of strengthening its economic security. This concept is based on the study of international experience and successful OTG functioning in Ukraine. The idea includes directions, forms, tools, procedures, and financial sources for joint projects that strengthen territorial associations' economic security. The research consists of assessing the state of economic development of territorial communities and forms of their cooperation with other territorial communities. Analysis, synthesis, induction, and deduction are the main methods of scientific knowledge used to summarize statistical information, normative and legal support, and global experience of cooperation of territorial communities. The study results include the main areas of cooperation of territorial communities in Ukraine, including long-term collaboration. The study also contains successful examples of collaboration between different territorial communities, applying practical aspects and tools to form effective interaction. The main points of discussion concern various forms of interaction between territorial communities, which allow achieving the economic goal more quickly and effectively.","authors":["Oleksandr Hlazov","Khrystyna Kalashnikova","Volodymyr Zolotarov","Yaroslava Sergiivna Levchenko"],"meta":["December 2021","DOI:10.22937/IJCSNS.2021.21.12.92"],"references":["322015500_Models_of_governance_in_the_urban_functional_areas_Policy_lessons_from_the_implementation_of_integrated_territorial_investments_ITIs_in_Poland","305109936_Rurban_Centres_The_New_Dimension_of_Urbanism","354699227_Place_of_Clusters_and_Cluster_Policy_in_the_Economic_Policy_in_Germany_and_Poland","226125112_Inter-Municipal_Cooperation_A_Widespread_Phenomenon"]}