{"id":"357537989_COMPUTATIONAL_THINKING_TRAINING_USING_PICTOBLOX_EXPLORATORY_STUDY_WITH_STUDENTS_OF_PRIMARY_DEGREE","abstract":"PictoBlox is a graphical programming software based on Scratch, where interactive games, animations, or program robots and projects can be made. This paper presents an exploratory study on artificial intelligence context using PictoBlox to support the development of computational thinking and the ability to solve problems in primary degree students. The study involved twenty primary school students from a private school in northern Portugal on a didactic proposal that explores problem-solving using PictoBlox. The study was a qualitative and quantitative investigation which aimed to understand how artificial intelligence with PictoBlox can promote students' engagement in solving real situation problems using concepts and ideas from computer science. Findings suggest that students are receptive to exploring artificial intelligence with PictoBlox, get involved in solving problems using concepts and ideas from computer science, admit advantages using PictoBlox to express solutions to those problems. Furthermore, the initiative positively impacted participants' computational thinking skills, which was significant for those learners who initially showed less familiarity with this topic. Moreover, it was an enriching activity for the students that led them to solve problems in a fun way. A didactic proposal that promotes problem-solving using concepts and ideas from computer science and computational thinking in primary degree students based on graphical programming software.","authors":["Sara Cruz","Marco Bento","José Alberto Lencastre"],"meta":["January 2022Future Internet"],"references":["354869100_Who's_making_the_decisions_How_managers_can_harness_artificial_intelligence_and_remain_in_charge","339698305_Developing_computational_thinking_with_a_module_of_solved_problems","338407076_Project_Based_Learning_to_Enhance_Environmental_Education_through_Automobile_Mechanics","352295332_Development_Of_Geobot_Games_in_Teaching_and_Facilitation_of_Form_Four_Geographical_Skills_Topics","346366503_From_Gaming_to_Computational_Thinking_An_Adaptive_Educational_Computer_Game-Based_Learning_Approach","342046668_Putting_PjBL_to_the_Test_The_Impact_of_Project-Based_Learning_on_Second_Graders'_Social_Studies_and_Literacy_Learning_and_Motivation_in_Low-SES_School_Settings","328325177_Experiences_in_Learning_Problem-Solving_through_Computational_Thinking","220041541_Technological_Pedagogical_Content_Knowledge_A_Framework_for_Teacher_Knowledge"]}