{"id":"357671520_Toward_implementing_efficient_image_processing_algorithms_on_quantum_computers","abstract":"Quantum information science is an interdisciplinary subject spanning physics, mathematics, and computer science. It involves finding new ways to apply natural quantum-mechanical effects, particularly superposition and entanglement, to information processing in an attempt to exceed the limits of traditional computing. In addition to promoting its mathematical and physical foundations, scientists and engineers have increasingly begun studying cross-disciplinary fields in quantum information processing, such as quantum machine learning, quantum neural networks, and quantum image processing (QIMP). Herein, we present an overview of QIMP consisting of a succinct review of state-of-the-art techniques along with a critical analysis of several key issues important for advancing the field. These issues include improving current models of quantum image representations, designing quantum algorithms for solving sophisticated operations, and developing physical equipment and software architecture for capturing and manipulating quantum images. The future directions identified in this work will be of interest to researchers working toward the greater realization of QIMP-based technologies.","authors":["Fei Yan","Salvador E. Venegas-Andraca","Kaoru Hirota"],"meta":["January 2022Soft Computing","DOI:10.1007/s00500-021-06669-2"],"references":["354329886_Interpolation-Based_High_Capacity_Quantum_Image_Steganography","342125794_Quantum_Dilation_and_Erosion","340083455_New_look_on_quantum_representation_of_images_Fourier_transform_representation","339954593_Quantum_image_steganography_algorithm_based_on_modified_exploiting_modification_direction_embedding","352857113_QHSL_A_Quantum_Hue_Saturation_and_Lightness_Color_Model","352535662_Implementing_bilinear_interpolation_with_quantum_images","341996081_Efficient_quantum_arithmetic_operation_circuits_for_quantum_image_processing","340865968_Quantum_image_scrambling_algorithm_based_on_discrete_Baker_map","340468426_Quantum_image_processing_algorithm_using_edge_extraction_based_on_Kirsch_operator","338366582_Quantum_Image_Processing"]}