{"id":"357665282_Discovering_cell_types_using_manifold_learning_and_enhanced_visualization_of_single-cell_RNA-Seq_data","abstract":"Identifying relevant disease modules such as target cell types is a significant step for studying diseases. High-throughput single-cell RNA-Seq (scRNA-seq) technologies have advanced in recent years, enabling researchers to investigate cells individually and understand their biological mechanisms. Computational techniques such as clustering, are the most suitable approach in scRNA-seq data analysis when the cell types have not been well-characterized. These techniques can be used to identify a group of genes that belong to a specific cell type based on their similar gene expression patterns. However, due to the sparsity and high-dimensionality of scRNA-seq data, classical clustering methods are not efficient. Therefore, the use of non-linear dimensionality reduction techniques to improve clustering results is crucial. We introduce a method that is used to identify representative clusters of different cell types by combining non-linear dimensionality reduction techniques and clustering algorithms. We assess the impact of different dimensionality reduction techniques combined with the clustering of thirteen publicly available scRNA-seq datasets of different tissues, sizes, and technologies. We further performed gene set enrichment analysis to evaluate the proposed method’s performance. As such, our results show that modified locally linear embedding combined with independent component analysis yields overall the best performance relative to the existing unsupervised methods across different datasets.","authors":["Akram Vasighizaker","Saiteja Danda","Luis Rueda"],"meta":["January 2022Scientific Reports 12(1)","DOI:10.1038/s41598-021-03613-0"],"references":["349099949_Transcriptomic_profiling_of_SARS-CoV-2_infected_human_cell_lines_identifies_HSP90_as_target_for_COVID-19_therapy","340097343_Dimension_Reduction_and_Clustering_Models_for_Single-Cell_RNA_Sequencing_Data_A_Comparative_Study","333883979_Current_best_practices_in_single-cell_RNA-seq_analysis_a_tutorial","331759067_Recurrent_herpes_simplex_virus-1_infection_induces_hallmarks_of_neurodegeneration_and_cognitive_deficits_in_mice","329381074_Dimensionality_reduction_for_visualizing_single-cell_data_using_UMAP","326867979_Single-cell_RNA_sequencing_technologies_and_bioinformatics_pipelines","322973402_SCANPY_Large-scale_single-cell_gene_expression_data_analysis","330218138_Challenges_in_unsupervised_clustering_of_single-cell_RNA-seq_data","329323892_Comprehensive_review_of_the_identification_of_essential_genes_using_computational_methods_focusing_on_feature_implementation_and_assessment","317073300_Adaptive_community_detection_in_complex_networks_using_genetic_algorithms"]}