{"id":"357636428_Mapeamento_Sistematico_Metodologias_e_Ferramentas_para_a_Formacao_de_Professores_em_Pensamento_Computacional_Systematic_Mapping_Methodologies_and_Tools_for_Training_Teachers_in_Computational_Thinking","abstract":"Resumo: O Pensamento Computacional é uma estratégia para resolução de problemas através da utilização de habilidades cognitivas na área da Ciência da Computação. Neste contexto, o artigo apresenta um mapeamento sistemático visando a identificação de contextos metodológicos e ferramentas usadas para aprendizagem do Pensamento Computacional para a formação de professores no mundo entre os anos de 2010 a 2021, publicados em periódicos e anais de congressos da área da computação. Como resultado, verificou-se que a ferramenta Scratch e a computação desplugada são as estratégias mais utilizadas por meio de oficinas e cursos. Além disso, buscou-se elencar as instituições e países que mais publicaram sobre o tema, foram identificadas as principais dificuldades e as conclusões reportadas pelos autores dos 22 estudos mapeados. Palavras-chave: Pensamento computacional, formação de professor, ciência da computação. Abstract: Computational Thinking is a strategy for problem solving through the use of cognitive skills in the area of Computer Science. In this context, the article presents a systematic mapping aiming to identify methodological contexts and tools used for learning Computational Thinking for teacher training around the world between the years 2010 and 2021, published in journals and conference proceedings in the area of computing. As a result, it was found that Scratch and unplugged computing are the most used strategies through workshops and courses. In addition, the institutions and countries that most published on the subject were listed, and the main difficulties and conclusions reported by the authors of the 22 mapped studies were identified","authors":["Adrianne Almeida","Fabíola Pantoja","Oliveira Araújo -Ufpa"],"meta":["January 2022RENOTE","DOI:10.22456/1679-1916.121365"],"references":["316076375_Improving_the_Computational_Thinking_Pedagogical_Capabilities_of_School_Teachers","302924724_Guidelines_for_performing_Systematic_Literature_Reviews_in_Software_Engineering","300237263_Pensamento_Computacional_sob_a_visao_dos_profissionais_da_computacao_uma_discussao_sobre_conceitos_e_habilidades","274309848_Computational_Thinking","268206941_Um_modelo_colaborativo_para_a_aprendizagem_do_pensamento_computacional_aliado_a_autorregulacao","234825132_Computer_science_teacher_preparation_is_critical","275156960_Guidelines_for_conducting_systematic_mapping_studies_in_software_engineering_An_update","250750529_If_You_Build_Teachers_Will_Students_Come_The_Role_of_Teachers_in_Broadening_Computer_Science_Learning_for_Urban_Youth"]}