{"id":"357680286_Solutions_to_the_routing_problem_towards_trustworthy_autonomous_vehicles","abstract":"The general expectation is that the traffic in the cities will be almost optimal when the collective behaviour of autonomous vehicles will determine the traffic. Each member of the collective of autonomous vehicles tries to adapt to the changing environment, therefore together they execute decentralised autonomous adaptation by exploiting real-time information about their environment. The routing of these vehicles needs proper computer science models to be able to develop the best information technology for their control. We review different traffic flow models in computer science, and we evaluate their usefulness and applicability to autonomous vehicles. The classical game theory model implies flow level decision making in route selection. Non-cooperative autonomous vehicles may produce unwanted traffic patterns. Improved decentralised autonomous adaptation techniques try to establish some kind of coordination among autonomous vehicles, mainly through intention awareness. The aggregation of the intentions of autonomous vehicles may help to predict future traffic situations. The novel intention-aware online routing game model points out that intention-awareness helps to avoid that the traffic generated by autonomous vehicles be worse than the traffic indicated by classical traffic flow models. The review helps to make the first steps towards research on global level control of autonomous vehicles by highlighting the strengths and weaknesses of the different formal models. The review also highlights the importance of research on intention-awareness and intention-aware traffic flow prediction methods.","authors":["László Z Varga"],"meta":["January 2022Artificial Intelligence Review","DOI:10.1007/s10462-021-10131-y"],"references":["339945831_Control_Design_Stability_Analysis_and_Traffic_Flow_Implications_of_CACC_Systems_with_Compensation_of_Communication_Delay","338830662_Simulation_Strategies_for_Mixed_Traffic_Conditions_A_Review_of_Car-Following_Models_and_Simulation_Frameworks","337454173_On_finding_optimum_commuting_path_in_a_road_network_A_computational_approach_for_smart_city_traveling","336719194_Experimental_investigation_of_ant_traffic_under_crowded_conditions","336597354_Urban_Traffic_Routing_Using_Weighted_Multi-Map_Strategies","334343152_a-_Rank_Multi-Agent_Evaluation_by_Evolution","339004553_Multiplicative_Weights_Update_with_Constant_Step-Size_in_Congestion_Games_Convergence_Limit_Cycles_and_Chaos","336245455_P-DACCA_A_Probabilistic_Direction-Aware_Cooperative_Collision_Avoidance_scheme_for_VANETs","335111216_Agent-Environment_Interactions_in_Large-Scale_Multi-Agent_Based_Simulation_Systems","333592047_On_Identification_of_Driving-Induced_Stress_Using_Electroencephalogram_Signals_A_Framework_Based_On_Wearable_Safety-Critical_Scheme_and_Machine_Learning"]}