{"id":"357717019_Opinion_mining_in_online_social_media_A_Survey","abstract":"With the emergence of social networks, opinion detection has become an active research area with different applications and several opinionated resources such as product reviews, social media posts and online blogs. Many social actors (e.g., companies, government departments, journalists) seek to understand people’s opinions for various purposes such as analyzing consumer reactions to certain products’ promotion (Marketing). In this regard, the last decade has witnessed a steady growth in opinion mining and sentiment analysis mainly explained by the scientific challenges and it bears such as natural language processing ambiguity, spam opinion detection, sarcasm, and using abbreviations. As a result, an extended survey focusing on the different aspects of those challenges is required. In this work, we present the problem statement and preliminaries, as well as the data sources and acquisition techniques. We then propose a thorough examination of well-cited, classical and recent opinion mining approaches, with an emphasis on the techniques employed in each of the sub-tasks of opinion mining.","authors":["Chaima Messaoudi","Zahia Guessoum","Lotfi Ben Romdhane"],"meta":["December 2022Social Network Analysis and Mining 12(1)","DOI:10.1007/s13278-021-00855-8"],"references":["355025737_A_fuzzy_approach_for_sarcasm_detection_in_social_networks","348605584_A_Study_on_Classification_Techniques_based_on_Opinions","338433279_OMLML_a_helpful_opinion_mining_method_based_on_lexicon_and_machine_learning_in_social_networks","337857393_Limitations_of_information_extraction_methods_and_techniques_for_heterogeneous_unstructured_big_data","326812212_UO-UPV_Deep_Linguistic_Humor_Detection_in_Spanish_Social_Media","324739720_Social_media_metrics_and_sentiment_analysis_to_evaluate_the_effectiveness_of_social_media_posts","338649312_An_Unsupervised_Neural_Model_for_Aspect_Based_Opinion_Mining","333687016_Deep_Learning_for_NLP_and_Speech_Recognition","328304906_Sentiment_analysis_and_subjectivity","326205451_Aspect_Sentiment_Classification_with_both_Word-level_and_Clause-level_Attention_Networks"]}