{"id":"357715698_Regional-CNN-based_enhanced_Turkish_sign_language_recognition","abstract":"Hearing impaired people use sign language for communication. Considering the spoken languages, the most widely spread ones have their own sign languages. Thus, sign languages are spoken language dependent. In this paper, the focus is on Turkish Sign Language (TSL). In parallel with the developments in computer science and artificial intelligence, the human computer interaction is now possible and it is a definite field of computer science. Automatically detecting and recognizing sign languages by computers are also possible applications. The improvements in machine learning field in the last decade made it possible to improve systems that can automatically detect and recognize sign language from still images. On the other hand, using a robust algorithm that is recognizing a sign language may not be applicable to another language as signs and linguistic properties may differ between languages. In this paper, we propose a novel method of recognizing characters of Turkish Sign Language (TSL). The method is tested on captured images containing signs, which are extracted from video files. Alexnet is employed as a pre-trained network in this system. Region-based Convolutional Neural Network (R-CNN) object detector is used to train the new model. The knowledge of the neural network is transferred using transfer learning method and tuned for recognizing TSL. The system achieves 99.7% average precision that is acceptable and comparable to conventional methods applied on TSL. Furthermore, the study is significant since it is one of the first successful application of transfer learning approach to TSL. The system is open to further improvements by improving the representations of the sign images.","authors":["Tolga Yirtici","Kamil Yurtkan"],"meta":["January 2022Signal Image and Video Processing","DOI:10.1007/s11760-021-02082-2"],"references":["333595093_Application_of_Deep_Learning_in_Neuroradiology_Brain_Haemorrhage_Classification_Using_Transfer_Learning","329790469_Fault_Classification_of_Axial_and_Radial_Roller_Bearings_Using_Transfer_Learning_through_a_Pretrained_Convolutional_Neural_Network","289842286_ChaLearn_Looking_at_People_Challenge_2014_Dataset_and_Results","252016411_Automatic_recognition_of_Turkish_fingerspelling","322058545_Revisiting_Unreasonable_Effectiveness_of_Data_in_Deep_Learning_Era","319770430_Rich_feature_hierarchies_for_accurate_object_detection_and_semantic_segmentation","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","313650445_Sign_Language_Recognition_using_3D_convolutional_neural_networks","277722488_Faster_R-CNN_Towards_Real-Time_Object_Detection_with_Region_Proposal_Networks","258374356_Rich_Feature_Hierarchies_for_Accurate_Object_Detection_and_Semantic_Segmentation"]}