{"id":"357720100_INOVACAO_E_CONTRIBUICAO_DO_DESIGN_THINKING_MAPEAMENTO_BIBLIOMETRICO_SOBRE_A_PRODUCAO_ACADEMICA_NAS_BASES_SCOPUS_E_WEB_SCIENCE","abstract":"Começam a despontar, nas diversas áreas de conhecimento, diferentes tipos de inovação, oriundos de metodologias como Design Thinking, que desempenham um papel importante nas organizações, funcionando como facilitadoras na apresentação de novas soluções que possibilitam melhores resultados. Este artigo tem o objetivo de apresentar a relação entre Inovação e metodologias para o despertar criativo, alinhada ao Design Thinking, por meio da produção acadêmica no período de 2015 a 2020, utilizando a bibliometria. Para o alcance do objetivo deste estudo, utilizaram-se indicadores bibliométricos na análise e avaliação dos artigos nas bases de dados Scopus e Web of Science. Obtiveram-se, na base Scopus, 92 artigos e, na Web of Science, 83, no período de 2015 a 2020, mostrando um espaço para as pesquisas neste contexto. Destaca-se pela quantidade de artigos o ano de 2018. Observou-se, por fim, que este tema é de interesse de várias áreas de conhecimentos, apesar de a maior concentração ser nas áreas administração de negócios, engenharia, ciência da computação e ciências sociais, outras áreas também têm contribuído com artigos, caracterizando que este é um tema multidisciplinar.","authors":["Elisangela De Menezes Aragão","Vania De Jesus","Ramon Santos Carvalho","Mario Jorge Campos dos Santos"],"meta":["December 2021Revista Gestão em Análise 10(3):191","DOI:10.12662/2359-618xregea.v10i3.p191-203.2021"],"references":["271267386_O_Modelo_de_Design_Thinking_como_Indutor_da_Inovacao_nas_Empresas_Um_Estudo_Empirico","264821222_Innovation_activities_sources_of_innovation_and_RD_cooperation_Evidence_from_firms_in_Hong_Kong_and_Guangdong_Province_China","257715769_Explaining_failures_in_innovative_thought_processes_in_engineering_design","273354145_Design_Thinking_for_Social_Innovation_By","259691653_Thinking_Outside_the_Box_Applying_Design_Theory_to_Public_Policy","256720451_Interpreting_and_envisioning_-_A_hermeneutic_framework_to_look_at_radical_innovation_of_meanings","233595627_Providing_Clarity_and_Common_Language_to_the_Fuzzy_Front_End","232382843_The_core_of_'design_thinking'_and_its_application"]}