{"id":"36379282_Une_analyse_critique_de_l'initiation_a_l'informatique_quelsapprentissages_et_quels_transferts","abstract":"Si l'on analyse les rapports établis ces dix dernières années entre l'enseignement et l'informatique, il est curieux de constater que si les discours sur l'E.A.A.O. se sont multipliés à une allure vertigineuse, sa pratique est restée relativement rare sans doute à cause du manque évident de matériel et de didacticiel de qualité.\nA l'inverse, on parle peu de l'initiation à l'informatique ; or, cette activité s'est répandue à une vitesse impressionnante à tel point que son bien-fondé est en général reconnu par tous. En Belgique, par exemple, il existe désormais des cours à option d'initiation à l'informatique dans le secondaire ; le décret RISOPOULOS recommande la mise au point d'une alphabétisation informatique dès l'enseignement primaire. Les parents, soucieux de ne pas rater le \"train du progrès\" recommandent une formation à l'informatique. Enfin, les enseignants eux-mêmes semblent se rallier à cet avis : une enquête réalisée auprès des enseignants du fondamental de l'Etat montre, par exemple, que 82 % d'entre eux marquent leur accord pour la proposition suivante \"Promouvoir l'informatique dans l'enseignement fondamental est indispensable.\"\nEt l'on pourrait ainsi multiplier les exemples ; l'essentiel est de montrer qu'il se réalise une certaine unanimité quant au bien-fondé de cette initiation générale. \nNous avons voulu rassembler dans cette communication quelques réflexions critiques concernant cette vague d'alphabétisation informatique. L'objectif est d'en montrer les leurres et les difficultés et de tenter d'aller plus loin dans la définition des contenus et des méthodes liés à cette initiation.","authors":["Marc Romainville"],"meta":[],"references":["222449750_On_the_cognitive_effects_of_computer_programming","32231262_On_the_Cognitive_Prerequisites_of_Learning_Computer_Programming","272445078_L'analyse_psychologique_des_activites_de_programmation_chez_l'enfant_de_CMI_et_CM2","272344772_De_faire_a_faire_faire_planification_d'actions_dans_la_situation_de_programmation","272333142_Genese_du_concept_d'iteration_une_approche_experimentale","269535986_Procedure_d'enfants_de_CEI_dans_une_tache_de_construction_de_parcours","229794216_Making_programming_instruction_cognitively_demanding_An_intervention_study","223413389_The_Black_Box_Inside_the_Glass_Box_Presenting_Computing_Concepts_to_Novices","220566515_The_Psychology_of_How_Novices_Learn_Computer_Programming"]}