{"id":"36443375_Structural_Equation_Modeling_Assessment_of_Key_Causal_Factors_in_Computer_Crime_Victimization","abstract":"This dissertation empirically assesses a computer-crime victimization model by applying Routine activities theory. Routine activities theory is arguably, as presented in detail in the main body of this study, merely an expansion of Hindelang, Gottfredson, and Garofalo’s lifestyle exposure theory. The components of routine activities theory were tested via structural equation modeling to assess the existence of any statistical significance between individual online lifestyles, the levels of computer security, and levels of individual computer-crime victimization. A self-report survey, which contained multiple measures of computer security, online lifestyles, and computer-crime victimization, was administered to 204 college students to gather data to test the model. This study was designed to convey two specific significant contributions to the empirical literature in criminology. First, this study is the first empirical test focusing on individual computer-crime victimization via a theoretical approach using routine activities theory. Second, utilizing structural equation modeling facilitates the assessment of the new theoretical model by conveying an overall picture of the relationship among the causal factors in the proposed model. The findings from this study provide empirical supports for the components of routine activities theory by delineating patterns of computer-crime victimization. This study is limited in that (a) it does not delineate individual computer crime victimization based on public computer use; (b) it needs to provide more precise scales to measure computer security and online users’ behaviors for delineating a true crime victimization model; (c) it just considers computer criminals’ motivation as a given situation. Future research should include and test another set of questionnaires that are primarily focused on public computer usage in order to differentiate the victimization levels on those computers. In addition, future research must develop more refined survey instruments to estimate computer security and online lifestyle measures. Furthermore, adding computer criminals’ motivational factors in the victimization model would substantially contribute to delineate true computer-crime victimization. This research is an initial step toward building a solid computer-crime victimization model. Hence, considering stated the limitations in the future study would produce a refined computer victimization model based on routine activities theory. Dissertation Chair: Dr. Dennis Giever Dissertation Committee Members: Dr. Daniel Lee, Dr. Randy Martin and Dr. Thomas Short","authors":["Kyung-Shick Choi"],"meta":[],"references":["349859769_Cybercrime_Investigating_High-Technology_Computer_Crime","318710175_Home_office_victims_of_crime_The_dimensions_of_risk","313399349_Closed_circuit_television_Its_role_in_reducing_burglaries_and_the_fear_of_crime_in_sheltered_accommodation_for_the_elderly","308698192_Latent_Variable_Models_An_Introduction_to_Factor_Path_and_Structural_Equation_Analysis","303919046_Principles_and_Practice_of_Structural_Equation_Modeling","292701711_Situational_crime_prevention_in_two_parking_facilities","289963030_Estimates_and_tests_in_structural_equation_modeling","288958783_Factor_Analysis_Statistical_Methods_and_Practical_Issues","288951378_Operation_identification_or_the_power_of_publicity","288482834_Computer_crime_An_emerging_challenge_for_law_enforcement","285797889_2008_CSIFBI_computer_crime_and_security_survey","284694289_Social_inequality_and_criminal_victimization_An_exposition_and_test_of_a_formal_theory","281154126_Bars_blocks_and_crimes_revisited_Linking_the_theory_of_routine_activities_to_the_empiricism_of_'hot_spots'","279747573_City_of_Bits_Space_Place_and_the_Infobahn","272562304_Social_Inequality_and_Predatory_Criminal_Victimization_An_Exposition_and_Test_of_a_Formal_Theory"]}