{"id":"37454736_TraCI_An_Interface_for_Coupling_Road_Traffic_and_Network_Simulators","abstract":"Vehicular Ad-Hoc Networks (VANETs) enable communication among vehicles as well as between vehicles and roadside infrastructures. Currently available software tools for VANET research still lack the ability to asses the usability of vehicular applications. In this article, we present Traffic Control Interface (TraCI) a technique for interlinking road traffic and network simulators. It permits us to control the behavior of vehicles during simulation runtime, and consequently to better understand the influence of VANET applications on traffic patterns. In contrast to the existing approaches, i.e., generating mobility traces that are fed to a network simulator as static input files, the online coupling allows the adaptation of drivers' behavior during simulation runtime. This technique is not limited to a special traffic simulator or to a special network simulator. We introduce a general framework for controlling the mobility which is adaptable towards other research areas. We describe the basic concept, design decisions and the message format of this open-source architecture. Additionally, we provide implementations for non-commercial traffic and network simulators namely SUMO and ns2, respectively. This coupling enables for the first time systematic evaluations of VANET applications in realistic settings.","authors":["Axel Wegener","Michal Piorkowski","Maxim Raya","Horst Hellbrück"],"meta":["April 2008","DOI:10.1145/1400713.1400740"],"references":["224985263_The_open_source_traffic_simulation_package_SUMO","220926428_VanetMobiSim_generating_realistic_mobility_patterns_for_VANETs","255565406_IEEE_INTELLIGENT_TRANSPORTATION_SYSTEMS_SOCIETY","236569380_TRANSIMS_Transportation_analysis_and_simulation_system","224795177_Microscopic_Modeling_of_Traffic_Flow_Investigation_of_Collision_Free_Vehicle_Dynamics","224290763_NCTUns_40_An_Integrated_Simulation_Platform_for_Vehicular_Traffic_Communication_and_Network_Researches","224290740_AutoCast_An_Adaptive_Data_Dissemination_Protocol_for_Traffic_Information_Systems","221628518_An_evaluation_of_inter-vehicle_ad_hoc_networks_based_on_realistic_vehicular_traces","220926600_An_integrated_mobility_and_traffic_model_for_vehicular_wireless_networks","220926469_Multiple_simulator_interlinking_environment_for_IVC"]}