{"id":"3758723_Action_recognition_using_probabilistic_parsing","abstract":"A new approach to the recognition of temporal behaviours and\nactivities is presented. The fundamental idea, inspired by work in\nspeech recognition, is to divide the inference problem into two levels.\nThe lower level is performed using standard independent probabilistic\ntemporal event detectors such as hidden Markov models (HMMs) to propose\ncandidate detections of low level temporal features. The outputs of\nthese detectors provide the input stream for a stochastic context-free\ngrammar parsing mechanism. The grammar and parser provide longer range\ntemporal constraints, disambiguate uncertain low level detections, and\nallow the inclusion of a priori knowledge about the structure of\ntemporal events in a given domain. To achieve such a system we provide\ntechniques for generating a discrete symbol stream from continuous low\nlevel detectors and for enforcing temporal exclusion constraints during\nparsing. We demonstrate the approach in several experiments using both\nvisual and other sensing data","authors":["Aaron Bobick","Yuri Ivanov"],"meta":["July 1998Proceedings / CVPR, IEEE Computer Society Conference on Computer Vision and Pattern Recognition. IEEE Computer Society Conference on Computer Vision and Pattern Recognition","DOI:10.1109/CVPR.1998.698609","SourceIEEE Xplore","Conference: Computer Vision and Pattern Recognition, 1998. Proceedings. 1998 IEEE Computer Society Conference on"],"references":["242394905_Basic_Methods_of_Probabilistic_Context_Free_Grammars","319770489_Pfinder_Real-time_tracking_of_the_human_body","317646318_Statistical_Language_Learning","286374034_PatternrecognitionStatistical_structural_and_neural_approaches","270819508_The_Grammar_of_Conducting_A_comprehensive_guide_to_baton_technique_and_interpretation","224667731_Space-time_gestures","222779526_Automatic_video_indexing_via_object_motion_analysis","221111746_A_State-Based_Technique_for_the_Summarization_and_Recognition_of_Gesture","220692142_Pattern_Recognition_Statistical_Structural_and_Neural_Approaches","220691539_Fundamentals_of_Speech_Recognition"]}