{"id":"37650511_Auto-eficacia_academica_e_atribuicoes_causais_em_Portugues_e_Matematica","abstract":"Academic self-efficacy and causal attributions are motivational constructs related to academic achievement which give us useful information about students self-perceptions of competence and their strategies to deal with academic settings and to cope with their school marks. This study aims to evaluate academic self-efficacy of 207 students (101 attending 9th grade and 106 attending 10th grade) and their causal attributions to Portuguese and Mathematics marks, using the Academic Self-Efficacy Scale and the Causal Attributions and Dimensions Questionnaire (Pina Neves & Faria, 2005a, 2005b). The differential results suggest that either 10th graders and students with higher marks have more positive self-efficacy expectancies for future performances in Portuguese, Mathematics, and school results in general than the other students, attributing also their marks to more internal causes and presenting perceptions of higher causal internality and stability. Moreover, the studies of correlation find a strong and positive association between academic self-efficacy dimensions and school marks. Finally, linear regression analyses show that self-efficacy expectancies and causal controllability are important determinants of academic achievement, stressing that the two specific dimensions of academic self-efficacy are the major predictors of achievement in both school subjects.","authors":["Sílvia Pina-Neves","Luísa Faria"],"meta":["October 2007Analise Psicologica 25(4)","DOI:10.14417/ap.472"],"references":["285722198_An_Attributional_Theory_of_Achievement_Motivation_and_Emotion","234564878_An_Exploratory_Factor_Analysis_of_the_Mathematics_Self-Efficacy_Scale_Revised_MSES-R","316823281_Self-efficacy_the_exercise_of_control","304551188_Attributions_causales_de_la_reussite_et_de_l'echec_effets_de_l'explication_d'une_performance_sur_l'evaluation_de_la_qualite_formelle_d'une_copie_d'examen","289678326_Ability_versus_effort_attributional_feedback_Differential_effects_on_self-efficacy_and_achievement","285912762_Modeling_and_attributional_feedback_effects_on_children's_achievement_A_self-efficacy_analysis","283884839_Relation_of_Self-Efficacy_Beliefs_to_Academic_Outcomes_A_Meta-Analytic_Investigation","279538975_Motivation_as_an_Enabler_for_Academic_Success","247498670_The_role_of_self-efficacy_beliefs_in_student_engagement_and_learning_in_the_classroom","239060654_Self-Efficacy_Beliefs_in_Academic_Settings"]}