{"id":"37689240_Drawing_Theories_Apart_The_Dispersion_of_Feynman_Diagrams_in_Postwar_Physics","abstract":"Winner of the 2007 Pfizer Prize from the History of Science Society. Feynman diagrams have revolutionized nearly every aspect of theoretical physics since the middle of the twentieth century. Introduced by the American physicist Richard Feynman (1918-88) soon after World War II as a means of simplifying lengthy calculations in quantum electrodynamics, they soon gained adherents in many branches of the discipline. Yet as new physicists adopted the tiny line drawings, they also adapted the diagrams and introduced their own interpretations. Drawing Theories Apart traces how generations of young theorists learned to frame their research in terms of the diagrams—and how both the diagrams and their users were molded in the process. Drawing on rich archival materials, interviews, and more than five hundred scientific articles from the period, Drawing Theories Apart uses the Feynman diagrams as a means to explore the development of American postwar physics. By focusing on the ways young physicists learned new calculational skills, David Kaiser frames his story around the crafting and stabilizing of the basic tools in the physicist's kit—thus offering the first book to follow the diagrams once they left Feynman's hands and entered the physics vernacular.","authors":["David I. Kaiser"],"meta":["January 2006","DOI:10.7208/chicago/9780226422657.001.0001"],"references":["226123222_Richard_Feynman_and_the_History_of_Superconductivity","225917191_On_a_two-pomeron_description_of_the_F_2_structure_function","2155151_Nonlinear_Regge_trajectories_and_glueballs","2005567_Spectrum_and_Regge_Trajectories_in_QCD","249215259_An_Unacknowledge_Revolution_Revisited","243755841_Cold_War_requisitions_scientific_manpower_and_the_production_of_American_physicists_after_World_War_II","240698880_Book_Reviews_Mario_Biagioli_Galileo_Courtier_The_Practice_of_Science_in_the_Culture_of_Absolutism","238804888_The_Death_of_the_Author","235575925_Multipole_amplitudes_of_pion_photoproduction_on_nucleons_up_to_2_GeV_using_dispersion_relations_and_the_unitary_isobar_model","11711124_Tacit_Knowledge_and_School_Formation"]}