{"id":"37703526_A_General_Theory_of_Crime","abstract":"By articulating a general theory of crime and related behavior, the authors present a new and comprehensive statement of what the criminological enterprise should be about. They argue that prevalent academic criminology—whether sociological, psychological, biological, or economic—has been unable to provide believable explanations of criminal behavior. The long-discarded classical tradition in criminology was based on choice and free will, and saw crime as the natural consequence of unrestrained human tendencies to seek pleasure and to avoid pain. It concerned itself with the nature of crime and paid little attention to the criminal. The scientific, or disciplinary, tradition is based on causation and determinism, and has dominated twentieth-century criminology. It concerns itself with the nature of the criminal and pays little attention to the crime itself. Though the two traditions are considered incompatible, this book brings classical and modern criminology together by requiring that their conceptions be consistent with each other and with the results of research. The authors explore the essential nature of crime, finding that scientific and popular conceptions of crime are misleading, and they assess the truth of disciplinary claims about crime, concluding that such claims are contrary to the nature of crime and, interestingly enough, to the data produced by the disciplines themselves. They then put forward their own theory of crime, which asserts that the essential element of criminality is the absence of self-control. Persons with high self-control consider the long-term consequences of their behavior; those with low self-control do not. Such control is learned, usually early in life, and once learned, is highly resistant to change. In the remainder of the book, the authors apply their theory to the persistent problems of criminology. Why are men, adolescents, and minorities more likely than their counterparts to commit criminal acts? What is the role of the school in the causation of delinquincy? To what extent could crime be reduced by providing meaningful work? Why do some societies have much lower crime rates than others? Does white-collar crime require its own theory? Is there such a thing as organized crime? In all cases, the theory forces fundamental reconsideration of the conventional wisdom of academians and crimina justic practitioners. The authors conclude by exploring the implications of the theory for the future study and control of crime.","authors":["Michael R. Gottfredson","Travis Hirschi"],"meta":["January 1990American Political Science Association 71(2)","DOI:10.2307/1964276"],"references":[]}