{"id":"37986944_Understanding_linear_algebra_concepts_through_the_embodied_symbolic_and_formal_worlds_of_mathematical_thinking","abstract":"Linear algebra is one of the first advanced mathematics courses that students encounter at university level. The transfer from a primarily procedural or algorithmic school approach to an abstract and formal presentation of concepts through concrete definitions, seems to be creating difficulty for many students who are barely coping with procedural aspects of the subject. This research proposes applying APOS theory, in conjunction with Tall’s three worlds of embodied, symbolic and formal mathematics, to create a framework in order to examine the learning of a variety of linear algebra concepts by groups of first and second year university students. The aim is to investigate the difficulties in understanding some linear algebra concepts and to propose potential paths for preventing them. As part of this research project several case studies were conducted where groups of first and second year students were exposed to teaching and learning some introductory linear algebra concepts based on the framework and expressed their thinking through their involvements in tests, interviews and concept maps. The results suggest that the students had limited understanding of the concepts, they struggled to recognise the concepts in different registers, and their lack of ability in linking the major concepts became apparent. However, they also revealed that those with more representational diversity had more overall understanding of the concepts. In particular the embodied introduction of the concept proved a valuable adjunct to their thinking. Since difficulties with learning linear algebra by average students are universally acknowledged, it is anticipated that this study may provide suggestions with the potential for widespread positive consequences for learning.","authors":["Sepideh Stewart"],"meta":[],"references":["337648301_Complex_calculators_in_the_classroom_theoretical_and_practical_reflections_on_teaching_pre-calculus","317598070_Knowledge_Construction_and_Diverging_Thinking_in_Elementary_Advanced_Mathematics","324633939_Mathematical_Education_Notes","322882356_Surprises_from_Mathematics_Education_Research_Student_Misuse_of_Mathematical_Definitions","322810488_The_Linear_Algebra_Curriculum_Study_Group_Recommendations_for_the_First_Course_in_Linear_Algebra","322809762_Teaching_Linear_Algebra_Must_the_Fog_Always_Roll_in","317953507_Learning_and_teaching_with_understanding","313343383_Instrumental_and_relational_understanding","294694768_What_is_a_sign","292674802_The_graphics_calculator_in_mathematics_education_A_critical_review_of_recent_research","292524692_Success_and_Understanding","288819642_The_three_worlds_of_mathematics","285970920_Linear_Algebra_and_Its_Applications","285347004_The_linear_algebra_study_group_recommendations_Moving_beyond_concept_definition_in_Resources_for_Teaching_Linear_Algebra","285327517_Evaluation_of_a_teaching_design_in_linear_algebra_The_case_of_linear_transformations"]}