{"id":"38011789_An_Anatomical_Signature_for_Literacy","abstract":"Language is a uniquely human ability that evolved at some point in the roughly 6,000,000 years since human and chimpanzee lines diverged. Even in the most linguistically impoverished environments, children naturally develop sophisticated language systems. In contrast, reading is a learnt skill that does not develop without intensive tuition and practice. Learning to read is likely to involve ontogenic structural brain changes, but these are nearly impossible to isolate in children owing to concurrent biological, environmental and social maturational changes. In Colombia, guerrillas are re-integrating into mainstream society and learning to read for the first time as adults. This presents a unique opportunity to investigate how literacy changes the brain, without the maturational complications present in children. Here we compare structural brain scans from those who learnt to read as adults (late-literates) with those from a carefully matched set of illiterates. Late-literates had more white matter in the splenium of the corpus callosum and more grey matter in bilateral angular, dorsal occipital, middle temporal, left supramarginal and superior temporal gyri. The importance of these brain regions for skilled reading was investigated in early literates, who learnt to read as children. We found anatomical connections linking the left and right angular and dorsal occipital gyri through the area of the corpus callosum where white matter was higher in late-literates than in illiterates; that reading, relative to object naming, increased the interhemispheric functional connectivity between the left and right angular gyri; and that activation in the left angular gyrus exerts top-down modulation on information flow from the left dorsal occipital gyrus to the left supramarginal gyrus. These findings demonstrate how the regions identified in late-literates interact during reading, relative to object naming, in early literates.","authors":["Manuel Carreiras","Mohamed L Seghier","Silvia Baquero Castellanos","Adelina Estévez"],"meta":["October 2009Nature 461(7266):983-6","DOI:10.1038/nature08461","SourcePubMed"],"references":["305381230_Neuroplasticity_changes_in_grey_matter_induced_by_training","305381022_Neuroplasticity_changes_in_grey_matter_induced_by_training","316991409_Mini-Mental_State_A_practical_method_for_grading_the_cognitive_state_of_patients_for_the_clinician","310604226_A_compendium_of_neuropsychological_tests_1991","279986719_The_Nature_of_Phonological_Processing_and_Its_Causal_Role_in_the_Acquisition_of_Reading_Skills","277684999_A_Standardized_Set_of_260_Pictures_Norms_for_Name_Agreement_Image_Agreement_Familiarity_and_Visual_Complexity","254222797_Sublexical_representations_and_the_'front_end'_of_visual_word_recognition","246396517_Contribution_a_l'etude_anatomoclinique_et_clinique_des_differentes_varietes_de_cecite_verbal","244953992_A_Compendium_of_Neurological_Tests","243782275_Wechsler_Memory_Scale_-_Revised"]}