{"id":"38027158_Beta-Adrenergic_Blockade_and_Voice_A_Double-Blind_Placebo-Controlled_Trial","abstract":"This study investigated the effects of laboratory-induced stress and beta-adrenergic blockade on acoustic and aerodynamic voice measures. In a double-blind, placebo-controlled trial, 12 participants, six males and six females, underwent cold pressor-induced sympathetic activation followed by placebo or treatment with 40 mg propranolol. Aerodynamic and acoustic parameters of voice were collected at baseline, during cold pressor and after treatment with propranolol or placebo. Fundamental frequency, jitter, shimmer, maximum airflow declination rate, voice onset time, speaking rate, and subglottal pressure were measured at baseline, during cold pressor-induced stress, and after treatment with propranolol or placebo. Cardiovascular measures served as indicators of sympathetic nervous system (SNS) activation by cold pressor and antagonism by propranolol, and were collected during all conditions. Cold pressor appeared to adequately agonize the SNS as indicated by significant increases in resting systolic and diastolic blood pressure and heart rate. Propranolol appeared to adequately antagonize the SNS for the participants. Jitter ratio demonstrated a statistically significant increase in the participants treated with propranolol. Speaking rate demonstrated a small but significant increase in the placebo control group during cold pressor. Gender differences were observed in a few measures. Cold pressor adequately agonized and propranolol adequately antagonized the SNS. No statistically significant differences across subjects were observed in the voice parameters during cold pressor-induced stress before treatment. Jitter ratio increased significantly during propranolol treatment and cold pressor. Speaking rate demonstrated a statistically significant increase during cold pressor in the placebo control group. Gender differences were observed, but were few.","authors":["Cheryl L Giddens","Kirk W Barron","Keith F Clark","William D Warde"],"meta":["October 2009Journal of voice: official journal of the Voice Foundation 24(4):477-89","DOI:10.1016/j.jvoice.2008.12.002","SourcePubMed"],"references":["227273200_A_new_method_for_the_determination_of_absolute_abundance_of_diatoms_and_other_silt-sized_sedimentary_particles","308523606_Goodman_and_Gilman's_the_pharmacologic_basis_of_therapeutics","297030839_NEW_INVERSE_FILTERING_TECHNIQUE_FOR_DERIVING_GLOTTAL_AIR-FLOW_WAVEFORM_DURING_VOICING","284396474_A_principal_components_assessment_of_performance_anxiety_among_musicians","277549377_Glottal_airflow_and_transglottal_air_pressure_measurements_for_male_and_female_speakers_in_soft_normal_and_loud_voice","272315725_Acoustic_and_perceptual_indicators_of_emotional_stress","246022551_Acoustic_analysis_of_induced_vocal_stress_by_means_of_cognitive_workload_tasks","239959449_The_effect_of_low-dose_b-blockade_on_performance_anxiety_in_singers","235763371_Glottal_airflow_and_transglottal_air_pressure_measurements_for_male_and_female_speakers_in_low_normal_and_high_pitch","232487084_Musicians_A_neglected_working_population_in_crisis"]}