{"id":"38036684_The_Myth_of_Language_Universals_Language_Diversity_and_Its_Importance_for_Cognitive_Science","abstract":"Talk of linguistic universals has given cognitive scientists the impression that languages are all built to a common pattern. In fact, there are vanishingly few universals of language in the direct sense that all languages exhibit them. Instead, diversity can be found at almost every level of linguistic organization. This fundamentally changes the object of enquiry from a cognitive science perspective. This target article summarizes decades of cross-linguistic work by typologists and descriptive linguists, showing just how few and unprofound the universal characteristics of language are, once we honestly confront the diversity offered to us by the world's 6,000 to 8,000 languages. After surveying the various uses of “universal,” we illustrate the ways languages vary radically in sound, meaning, and syntactic organization, and then we examine in more detail the core grammatical machinery of recursion, constituency, and grammatical relations. Although there are significant recurrent patterns in organization, these are better explained as stable engineering solutions satisfying multiple design constraints, reflecting both cultural-historical factors and the constraints of human cognition.\nLinguistic diversity then becomes the crucial datum for cognitive science: we are the only species with a communication system that is fundamentally variable at all levels. Recognizing the true extent of structural diversity in human language opens up exciting new research directions for cognitive scientists, offering thousands of different natural experiments given by different languages, with new opportunities for dialogue with biological paradigms concerned with change and diversity, and confronting us with the extraordinary plasticity of the highest human skills.","authors":["Nicholas Evans","Stephen C Levinson"],"meta":["October 2009Behavioral and Brain Sciences 32(5):429-48; discussion 448-494","DOI:10.1017/S0140525X0999094X","SourcePubMed"],"references":["354049737_Linguistic_Theory_in_America_Second_Edition","350228041_The_Method_of_Universal_Grammar","349585233_Recent_Developments_in_Dependency_Theory","348861513_The_Resilience_of_Language_What_Gesture_Creation_in_Deaf_Children_Can_Tell_Us_About_How_All_Children_Learn_Language","346677524_Patterns_of_Sounds","346673668_Grammatical_categories_and_the_development_of_classification_preferences_a_comparative_approach","346671544_Tense","346626435_Escaping_Eurocentrism_fieldwork_as_a_process_of_unlearning","345972699_Deiktikon_Artikel_Nominalphrase_Zur_Emergenz_syntaktischer_Struktur","344828783_A_Grammar_of_Lezgian"]}