{"id":"38041721_Key_Concepts_for_Estimating_the_Burden_of_Surgical_Conditions_and_the_Unmet_Need_for_Surgical_Care","abstract":"Surgical care is emerging as a crucial issue in global public health. Methodology is needed to assess the impact of surgical care from a public health perspective.\nA consensus opinion of a group of surgeons, anesthesiologists, and public health experts was established regarding the methodology for estimating the burden of surgical conditions and the unmet need for surgical care.\nFor purposes of analysis, we define surgical conditions as any disease state requiring the expertise of a surgically trained provider. Abnormalities resulting from a surgical condition or its treatment are termed surgical sequelae. Surgical care is defined as any measure that reduces the rates of physical disability or premature death associated with a surgical condition. To measure the burden of surgical conditions and unmet need for surgical care we propose using cumulative disability-adjusted life-year (DALY) curves generated from age-specific population-based data. This conceptual framework is based on the premise that surgically associated disability and death is determined by the incidence of surgical conditions and the quantity and quality of surgical care. The burden of surgical conditions is defined as the total disability and premature deaths that would occur in a population should there be no surgical care; the unmet need for surgical care is defined as the potentially treatable disability and premature deaths due to surgical conditions. Burden of surgical conditions should be expressed as DALYs and unmet need as potential DALYs avertable.\nMethodology is described for estimating the burden of surgical conditions and unmet need for surgical care. Using this approach it will be feasible to estimate the global burden of surgical conditions and help clarify where surgery fits among other global health priorities. These methods need to be validated using population-based data.","authors":["Stephen Bickler","Doruk Ozgediz","Richard Gosselin","Thomas G Weiser"],"meta":["October 2009World Journal of Surgery 34(3):374-80","DOI:10.1007/s00268-009-0261-6","SourcePubMed","Project: Global Surgery Access"],"references":["296941754_A_Crucial_Role_for_Surgery_in_Reaching_the_UN_Millennium_Development_Goals","313716054_The_burden_of_surgical_conditions_and_access_to_surgical_care_in_low-_and_middle-income_countries","299822504_The_Global_Burden_of_Disease_A_Comprehensive_Assessment_of_Mortality_and_Disability_from_Diseases_Injuries_and_Risk_Factors_in_1990_and_Projected_to_2020","297337128_Need_for_paediatric_surgery_care_in_an_urban_area_of_The_Gambia","291838543_Disease_control_priorities_in_developing_countries_second_edition","288025594_Meeting_the_need_for_emergency_obstetric_care_in_Mozambique_work_performance_and_history_of_medical_doctors_and_assistant_medical_officers_trained_for_surgery","285837376_An_estimation_of_the_global_volume_of_surgery_A_modeling_strategy_based_on_available_data","284040568_Disease_control_priorities_in_developing_countries","271002041_Lifetime_Risks_of_Hip_Colles'_or_Vertebral_Fracture_and_Coronary_Heart_Disease_Among_White_Postmenopausal_Women","231315770_The_Global_Burden_of_Disease_A_Comprehensive_Assessment_of_Mortality_and_Disability_From_Disease_Injuries_and_Risk_Factors_In_1990"]}