{"id":"38090981_Emergence_of_a_Cell_Wall_Protease_in_the_Streptococcus_thermophilus_Population","abstract":"Streptococcus thermophilus is perceived as a recently emerged food bacterium that evolved from a commensal ancestor by loss and gain of functions. Here,\nwe provide data allowing a better understanding of this evolutionary scheme. A multilocus sequence typing approach that we\ndeveloped showed that S. thermophilus diverges significantly from its potential ancestors of the salivarius group and displays a low level of allelic variability,\nconfirming its likely recent emergence. An analysis of the origin and dissemination of the prtS gene was carried out within this evolutionary scheme. This gene encodes a protease that allows better growth in milk by facilitating\ncasein breakdown to supply amino acids. The S. thermophilus protease exhibits 95% identity to the animal Streptococcus suis protein PrtS. Genomic analysis showed that prtS is part of an island flanked by two tandem insertion sequence elements and containing three other genes which present the\nbest identities and synteny with the S. suis genome. These data indicate a potential origin for this “ecological” island in a species closely related to S. suis. The analysis of the distribution of the prtS gene in S. thermophilus showed that the gene is infrequent in historical collections but frequent in recent industrial ones. Moreover, this “ecological”\nisland conferring an important metabolic trait for milk adaptation appears to have disseminated by lateral transfer in the\nS. thermophilus population. Taken together, these data support an evolutionary scheme of S. thermophilus where gene acquisition and selection by food producers are determining factors. The source and impact of genes acquired by\nhorizontal gene transfer on the physiology and safety of strains should be addressed.","authors":["Christine Delorme","Claire Bartholini","Alexander Bolotine","S Dusko Ehrlich"],"meta":["November 2009Applied and Environmental Microbiology 76(2):451-60","DOI:10.1128/AEM.01018-09","SourcePubMed"],"references":["295989489_Complete_genome_sequence_and_comparative_genomic_analysis_of_an_emerging_human_pathogen_serotype_V_Streptococcus_agalactiae","242625651_Acquisition_of_Five_High-M_r_Penicillin-Binding_Protein_Variants_during_Transfer_of_High-Level_b-Lactam_Resistance_from_Streptococcus_mitis_to_Streptococcus_pneumoniae","220263635_MEGA2_Molecular_Evolutionary_Genetics_Analysis_Software","24508504_A_Comprehensive_Genetic_Study_of_Streptococcal_Immunoglobulin_A1_Proteases_Evidence_for_Recombination_within_and_between_Species","23963717_Conjugative_Transfer_of_the_Integrative_Conjugative_Elements_ICESt1_and_ICESt3_from_Streptococcus_thermophilus","289507789_Yersinia_pestis_the_cause_of_plague_is_a_recently_emerged_clone_of_Yersinia_pseudotuberculosis_vol_96_pg_14043_1999","288967833_Cheese_Chemistry_Physics_and_Microbiology","286215327_The_Neighbor-Joining_Method_A_New_Method_for_Reconstructing_Phylogenetic_Trees","262032003_Ecological_fitness_genomic_islands_and_bacterial_pathogenicity","257237915_Revival_of_the_Species_Streptococcus_thermophilus_ex_Orla-Jensen_1919_nom_rev"]}