{"id":"3864314_Twenty_dirty_tricks_to_train_software_engineers","abstract":"Many employers find that graduates and sandwich students come to them poorly prepared for the every day problems encountered at the workplace. Although many university students undertake team projects at their institutions, an educational environment has limitations that prevent the participants experiencing the full range of problems encountered in the real world. To overcome this, action was taken on courses at the Plessey Telecommunications company and Loughborough University to disrupt the students' software development progress. These actions appear mean and vindictive, and are labeled `dirty tricks' in the paper, but their value has been appreciated by both the students and their employers. The experiences and learning provided by twenty `dirty tricks' are described and their contribution towards teaching. Essential workplace skills are identified. The feedback from both students and employers has been mostly informal but the universally favourable comments received give strong indications that the courses achieved their aim of preparing the students for the workplace. The paper identifies some limitations on the number and types of `dirty tricks' that can be employed at a university and concludes that companies would benefit if such dirty tricks were employed in company graduate induction programmes, as well as in university courses","authors":["Ray Dawson"],"meta":["February 2000Proceedings - International Conference on Software Engineering","DOI:10.1109/ICSE.2000.870412","SourceIEEE Xplore","Conference: Software Engineering, 2000. Proceedings of the 2000 International Conference on"],"references":["290686960_Can_Quality_Survive_Amidst_Adversity","260649390_Software_Engineering_Education_A_Modest_Proposal","220069632_Components_of_Typical_Undergraduate_Software_Engineering_Courses_Results_from_a_Survey","27295076_Point-SE_Education_We're_on_Our_Own","3420132_Bringing_the_real_world'_of_software_engineering_to_university_undergraduate_courses","3407269_Slick_Systems'_and_Happy_Hackers'_experience_with_group_projects_at_UCL","3407235_Introducing_new_software_engineering_graduates_to_the_real_world'_at_the_GPT_company","3247320_SE_Education_What_Academia_Can_Do","3247114_SE_education_We're_on_our_own","3188637_Components_of_Typical_Undergraduate_Software_Engineering_Courses_Results_from_a_Survey"]}