{"id":"3922803_Safety_critical_avionics_for_the_777_primary_flight_controls_system","abstract":"The new technologies in flight control avionics systems selected\nfor the Boeing 777 airplane program consists of the following:\nFly-By-Wire (FBW), ARINC 629 Bus, Deferred Maintenance. The FBW must\nmeet extremely high levels of functional integrity and availability. The\nheart of the FBW concept is the use of triple redundancy for all\nhardware resources: computing system, airplane electrical power,\nhydraulic power and communication path. The architecture of the 777\nflight controls system follows the earliest Boeing 7J7 design. The\nBoeing designed global DATAC bus, also known as ARINC 629 data bus, is\nused to communicate among all computing systems. Each DATAC bus is\nisolated, both physically and electrically from the other two. The three\nDATAC buses are not synchronized. The control system performance under\nthe autonomous and asynchronous DATAC bus operation has been studied.\nThe primary flight computers (PFCs) form a triple-triple redundant\nsystem; three PFC channels and three computing lanes in each channel.\nEach channel is also isolated, both physically and electrically from the\nother two. The microprocessor hardware for three computing lanes in each\nchannel are dissimilar to facilitate detection of generic design errors\nof the most complicated hardware devices; microprocessors. The Byzantine\ngeneral problem has been considered in the design of the PFC redundancy\nmanagement to cope with functional asymmetry and communication\nasymmetry. The deferred maintenance is to provide hot spare modules\nwithin an LRU such that the airplane dispatchability can be enhanced.\nThis concept is applied to the three major avionics systems, PFC, Air\nData Inertial Reference System (ADIRU) and Airplane Information\nManagement System (AIMS)","authors":["Y.C. Yeh"],"meta":["November 2001","DOI:10.1109/DASC.2001.963311","SourceIEEE Xplore","Conference: Digital Avionics Systems, 2001. DASC. 20th ConferenceVolume: 1"],"references":["2995282_SIFT_Design_and_Analysis_of_a_Fault-Tolerant_Computer_for_Aircraft_Control","303561937_The_Byzantine_general_problem","269227736_An_air_data_inertial_reference_system_for_future_commercial_airplanes","269227572_Commercial_jet_transport_fly-by-wire_architecture_considerations","245431533_Generic_Faults_and_Architecture_Design_Considerations_in_Flight-Critical_Systems","242924950_On_Fly-by-Wire_Control_System_and_statistical_analysis_of_system_performance","3782118_Design_considerations_in_Boeing_777_fly-by-wire_computers","3626737_Triple-triple_redundant_777_primary_flight_computer","2995288_FTMP-A_Highly_Reliable_Fault-Tolerant_Multiprocessor_for_Aircraft","2554993_The_Byzantine_Generals_Problem"]}