{"id":"39492921_La_notion_de_handicap_et_ses_transformations_a_travers_les_classifications_internationales_du_handicap_de_l'OMS_1980_et_2001","abstract":"Dynamis Fecha de recepción: 4 de septiembre de 2007 [0211-9536] 2008; 28: 377-406 Fecha de aceptación: 21 de enero de 2008 SUMARIO: 1.—La Classification Internationale des Handicaps: Deficiences, incapacites, des-avantages. 1.1.–Des causes aux conséquences des maladies. 1.2.—De la maladie à la personne malade. D'un point de vue médical à un point de vue social. 1.2.1.—La maladie. 1.2.2.—La déficience. 1.2.3.—L'incapacité. 1.2.4.—Le désavantage. 1.3.—La personne malade d'un point de vue social. 2.—De la CIH à la Classification Internationale du Fonctionnement, du handicap et de la santé. 2.1.—Controverse autour de la CIH. 2.2.—Les modèles alternatifs. 2.2.1.—Le mo-dèle social du handicap. 2.2.2.—Le modèle interactif québécois. 2.2.3.—Les modèles alternatifs: des conséquences aux causes. 2.3.—Le processus de révision de la CIH. 3.—La Classification Internationale du Fonctionnement, du handicap et de la santé. 3.1.—Des conséquences des maladies à la santé. 3.2.—Un modèle «biopsychosocial» pour décrire la santé, le handicap et le fonctionnement. 3.3.—Le handicap comme «défaut de fonctionnement». 4.—Conclusion. RESUME: Dans cet article, l'auteur analyse l'évolution de la notion de handicap en s'intéressant aux deux classifications du handicap publiées par l'OMS, en 1980 puis en 2001. La «Classifi-cation Internationale du Handicap: déficiences, incapacités et désavantages. Un manuel de classification des conséquences des maladies», de 1980, prolonge la «Classification Interna-tionales des Maladies»; le handicap y désigne les conséquences sociales des maladies. Dans la «Classification Internationale du Fonctionnement, du Handicap et de la Santé», publiée en 2001, le handicap désigne un «défaut de fonctionnement» et est associé à la notion de santé. L'auteur s'intéresse à la question de la norme de référence utilisée dans les classifications pour définir le handicap.","authors":["Myriam Winance"],"meta":["December 2007Dynamis (Granada, Spain) 28","DOI:10.4321/S0211-95362008000100016"],"references":["271027963_L'evolution_conceptuelle_internationale_dans_le_champ_du_handicap_enjeux_socio-politiques_et_contributions_quebecoises","233182639_The_Devils_are_in_the_Details_The_ICIDH2_and_the_disability_movement"]}