{"id":"39578466_Los_Repositorios_de_Objetos_de_Aprendizaje_como_soporte_a_un_entorno_e-learning","abstract":"La gestión de contenidos en los entornos e-learning está generando cambios en diversos sentidos. Entre estos cambios, los contenidos educativos se están construyendo como objetos de aprendizaje y se están recopilando en contenedores, conocidos como Repositorios de Objetos de Aprendizaje, que los organizan y los hacen accesibles para diferentes aplicaciones y perfiles de usuarios. Esto se logra fundamentalmente a través de la comunicación de aplicaciones interoperables y del intercambio de catálogos de metadatos compatibles. Como resultado de las propuestas de importantes grupos de estandarización, se ha dado paso a diferentes tecnologías y métodos de catalogación de recursos digitales, por lo que los proyectos de Repositorios de Objetos de Aprendizaje han ido en aumento. En este trabajo se hace una revisión a los conceptos básicos, a los estándares y a las especificaciones en desarrollo que se relacionan con la interoperabilidad de los Repositorios de Objetos de Aprendizaje y que promueven el crecimiento homogéneo del e-learning. Con base en dichos estándares y especificaciones, se presenta un modelo conceptual para la interoperabilidad de estos repositorios que permita un mejor flujo y la gestión de los contenidos educativos en un entorno e-learning. Asimismo, a través de un caso de estudio se muestra cómo el uso de esquemas estándares de metadatos permiten un intercambio de contenidos entres dos repositorios con distintos objetivos pero con tecnologías flexibles que permiten su comunicación. Content management in e-learning is creating changes in many ways. Among these changes, learning content is being transformed to learning objects and stored into containers, known as Learning Object Repositories, where objects are organized and accessible for different applications. This is essentially possible for interoperable applications communication and the interchange of compatible metadata catalogs. Proposals, made by important agencies of standardization, have had as a result different technologies and cataloguing methods for learning resources, and Learning Object Repositories projects are being increasing. This document presents a review of basic concepts, as well as standards and specifications that are in development, related with both the interoperability of Learning Object Repositories and the homogeneous growing of e-learning. Based on those standards and specifications, it is launched a conceptual model for interoperable repositories that allow better stream and management of learning content into e-learning environments. Also, a case study is exposed to show the possibility, by the use of standardized metadata schemas, of content interchange between repositories with different objectives but with flexible technologies to allow their communication.","authors":["Clara López Gúzman"],"meta":[],"references":["293108043_Dynamic_Courseware_Generation","267222548_Web_Semantica_y_Ontologias","242541077_Ontologies_applied_to_Learning_Objects_Repositories_for_educational_environments_in_the_Semantic_Web","221023617_The_interoperability_of_learning_object_repositories_and_services_Standards_implementations_and_lessons_learned","220497396_Learning_technology_specifications_Semantic_objects_for_adaptive_learning_environments","39696164_Plataformas_para_educacion_basada_en_web_herramientas_procesos_de_evaluacion_y_seguridad","28073053_Propuestas_de_concepto_y_definicion_de_la_biblioteca_digital","26473617_Como_desarrollar_contenidos_para_la_formacion_online_basados_en_objetos_de_aprendizaje","26473553_Desarrollo_de_repositorios_de_objetos_de_aprendizaje_a_traves_de_la_reutilizacion_de_los_metadatos_de_una_coleccion_digital_de_Dublin_Core_a_IMS","4204759_Knowledge_Management_for_E-learning_based_on_Learning_Objects_A_Qualitative_Focus","4024310_Learning_objects_on_the_Semantic_Web","298630140_User_Modelling_and_User-Adapted_Interaction_Editorial","286548403_How_to_Build_a_Digital_Library","276934888_Standard_for_Learning_Object_Metadata","267655835_Object-oriented_programming_Incl_1_disk","265410481_LEARNING_IN_A_CONNECTED_ECONOMY","244437488_A_Translation_Approach_to_Portable_Ontology_Specifications","242546750_Connecting_learning_objects_to_instructional_design_theory_A_definition_a_metaphor_and_a_taxono","239061570_Design_and_reusability_of_learning_objects_in_an_academic_context_A_new_economy_of_education","235310174_Demystifying_e-learning_standards","228328471_Adaptative_Hypermedia","221507634_What_are_Digital_Libraries_Who_is_Buidling_Them_and_Why","221093727_Reflections_on_the_colis_collaborative_online_learning_and_information_systems_demonstrator_project_and_the_learning_object_lifecycle","220711968_Quality_Content_Management_for_E-Learning_General_Issues_for_a_Decision_Support_System","49553066_La_era_de_la_informacion_economia_sociedad_y_cultura","42788791_Keeping_the_learning_in_learning_objects","39698420_Modelo_de_reutilizacion_soportado_por_estructuras_complejas_de_reutilizacion_denominadas_mecanos","39696207_Estandares_educativos_para_la_gestion_del_conocimiento_en_e-learning"]}