{"id":"40721053_System_of_Enterprise-Systems_Integration_Issues_an_Engineering_Perspective","abstract":"Today's needs for more capable enterprise systems in a short timeframe is leading more organizations toward the integration of existing product-systems into broader intra-organizational enterprise-systems and their integration into inter-organizational systems of enterprise-systems. Although important R&D efforts lead to a general consensus that Enterprise Modeling and IT Systems Interoperability are keys to Enterprise Integration to align the human-intensive infrastructure with the information-intensive architecture, these integration issues are not handled well in industrial systems engineering practices. Bridging the gap from an integrated system to a system of interoperable systems for architecting such broader enterprise-systems or complex systems of enterprise-systems requires ‘system thinking' beyond ‘system process'. This survey paper discusses some key problems, trends and accomplishments for Enterprise Integration with a systemic approach before advocating the System of Systems (SoS) paradigm to explore some rationales and forecasts in research and engineering.","authors":["Gérard Morel","Hervé Panetto","Frédérique Mayer","Jean-Philippe Auzelle"],"meta":["October 2007"],"references":["285752337_A_Framework_for_Information_Systems_Architecture","281013414_Proposition_of_a_benchmarking_environment_of_product-driven_control_architectures","285402845_332_How_Should_We_Use_the_Term_System_of_Systems_and_Why_Should_We_Care","282723975_Modeling_collaborations_as_complex_systems","248114875_Topics_in_Interoperability_System-of-Systems_Evolution","237649942_A_Complexity_Model_for_Networks_of_Collaborating_Enterprises","236877913_Pattern_Languages_of_Program_Design","234777203_On_the_System_Engineering_and_Management_of_Systems_of_Systems_and_Federations_of_Systems","229737525_System_of_Systems_SoS_Enterprise_Systems_Engineering_for_Information-Intensive_Organizations","228595306_Organisational_Interoperability_Maturity_Model_for_C2"]}