{"id":"40760232_Students'_perceptions_of_the_effectiveness_of_a_professional_skills_program_in_preparation_for_clerkship_training","abstract":"The goal of the Professional Skills Program at Arabian Gulf University, Bahrain, is to prepare medical students for the clerkship phase. In the six-year integrated problem-based learning (PBL) medical program, the Professional Skills Program is introduced in years two to four. The aim of this study was to evaluate program effectiveness as perceived by the students in the clerkship phase.\nStudents' perceptions were obtained using a mailed questionnaire. Close-ended questions were assessed using a 5-point Likert scale. Students were also asked to comment on areas of strengths or suggestions for improvement. The questionnaire was piloted with a group of students in the clerkship years. Results were analyzed in relation to the different domains of the program.\nStudents were positive about their clinical skills training in preparing them for their clerkship in relation to three levels of Kirkpatrick outcome measures. This was particularly true for the domains of physical examination and procedural skills. However, they indicated some areas in need of program development, particularly in the history-taking domain.\nThe students' opinions generally support the effectiveness of the Professional Skills Program training in preparing them for the clerkship phase. Program evaluation has helped us to plan for further development of the program.","authors":["Emtithal Anwar AL Jishi","N A Khalek","H M Hamdy"],"meta":["August 2009Education for Health Change in Learning & Practice 22(2):57","SourcePubMed"],"references":["298348303_Tomorrow's_doctors_Recommendations_on_undergraduate_medical_education","258215697_Comparative_study_of_medical_education_as_perceived_by_students_at_three_Dutch_Universities","243541346_Training_research_and_practice","201381960_Evaluating_Training_Programs_The_Four_Levels","13087577_The_clinical_skills_resource_A_review_of_current_practice","12161379_Effectiveness_of_basic_clinical_skills_training_programmes_A_cross-sectional_comparison_of_four_medical_schools","11967566_Professional_skills_programme_in_a_problem-based_learning_curriculum_Experience_at_the_College_of_Medicine_Medical_Scences_Arabian_Gulf_University","6793824_Early_Introduction_of_Clinical_Skills_Improves_Medical_Student_Comfort_at_the_Start_of_Third-Year_Clerkships","5948368_A_Sampling_Strategy_for_Promoting_and_Assessing_Medical_Student_Retention_of_Physical_Examination_Skills"]}