{"id":"4082304_Learning_methods_for_generic_object_recognition_with_invariance_to_pose_and_lighting","abstract":"We assess the applicability of several popular learning methods for the problem of recognizing generic visual categories with invariance to pose, lighting, and surrounding clutter. A large dataset comprising stereo image pairs of 50 uniform-colored toys under 36 azimuths, 9 elevations, and 6 lighting conditions was collected (for a total of 194,400 individual images). The objects were 10 instances of 5 generic categories: four-legged animals, human figures, airplanes, trucks, and cars. Five instances of each category were used for training, and the other five for testing. Low-resolution grayscale images of the objects with various amounts of variability and surrounding clutter were used for training and testing. Nearest neighbor methods, support vector machines, and convolutional networks, operating on raw pixels or on PCA-derived features were tested. Test error rates for unseen object instances placed on uniform backgrounds were around 13% for SVM and 7% for convolutional nets. On a segmentation/recognition task with highly cluttered images, SVM proved impractical, while convolutional nets yielded 16/7% error. A real-time version of the system was implemented that can detect and classify objects in natural scenes at around 10 frames per second.","authors":["Yann Lecun","Fu Jie Huang","L. Bottou"],"meta":["January 2004Proceedings / CVPR, IEEE Computer Society Conference on Computer Vision and Pattern Recognition. IEEE Computer Society Conference on Computer Vision and Pattern Recognition 2:II-97- 104 Vol.2","DOI:10.1109/CVPR.2004.1315150","SourceIEEE Xplore","Conference: Computer Vision and Pattern Recognition, 2004. CVPR 2004. Proceedings of the 2004 IEEE Computer Society Conference onVolume: 2"],"references":["226359900_Contour_and_Texture_Analysis_for_Image_Segmentation","221620338_Convergence_Properties_of_the_K-Means_Algorithms","221364881_Neural_Network-Based_Face_Detection","313562430_Learning_a_sparse_representation_for_object_detection","312468236_Convergence_properties_of_the_k-means_algorithm","281496262_Statistical_method_for_3D_object_detection_applied_to_faces_and_cars","245080835_A_statistical_method_for_3_dimensional_object_detection_applied_to_faces_and_cars","240224936_Rapid_object_detection_using_a_boosted_cascade_of_simple_features","221363018_Towards_Automatic_Discovery_of_Object_Categories","221304142_Learning_a_Sparse_Representation_for_Object_Detection"]}