{"id":"4082665_Scratch_A_sneak_preview","abstract":"Scratch is a networked, media-rich programming environment designed to enhance the development of technological fluency at after-school centers in economically-disadvantaged communities. Just as the LEGO MindStorms robotics kit added programmability to an activity deeply rooted in youth culture (building with LEGO bricks), Scratch adds programmability to the media-rich and network-based activities that are most popular among youth at after-school computer centers. Taking advantage of the extraordinary processing power of current computers, Scratch supports programming paradigms and activities that were previously infeasible, making it better positioned to succeed than previous attempts to introduce programming to youth. Our working hypothesis is that, as kids work on personally meaningful Scratch projects such as animated stories, games, and interactive art, they develop technological fluency, mathematical and problem solving skills, and a justifiable self-confidence that serves them well in the wider spheres of their lives.","authors":["John Maloney","Leo Burd","Yasmin B. Kafai","Natalie Rusk"],"meta":["February 2004","DOI:10.1109/C5.2004.1314376","SourceIEEE Xplore","Conference: Proceedings of the Second International Conference on Creating, Connecting and Collaborating through Computing"],"references":["239547294_The_Computer_Clubhouse_Technological_Fluency_in_the_Inner_City","329654173_Changing_Minds_Computers_Learning_and_Literacy","246719788_LogoBlocks_A_Graphical_Programming_Language_for_Interacting_with_the_World","245754188_Computers_Networks_and_Education","245753688_Computers_and_Squeak_as_Environments_for_Learning","243787035_Technically_Speaking_Why_All_Americans_Need_to_Know_More_About_Technology","243785828_Alice_Rapid_Prototyping_System_for_Virtual_Reality","234813926_Behavior_construction_kits","232584349_Changing_minds_Computers_learning_and_literacy","228328529_Mindstorms_Children_Computers_and_Powerful_Ideas"]}