{"id":"40906547_Cross-National_Patterns_of_Gender_Differences_in_Mathematics_A_Meta-Analysis","abstract":"A gender gap in mathematics achievement persists in some nations but not in others. In light of the underrepresentation of women in careers in science, technology, mathematics, and engineering, increasing research attention is being devoted to understanding gender differences in mathematics achievement, attitudes, and affect. The gender stratification hypothesis maintains that such gender differences are closely related to cultural variations in opportunity structures for girls and women. We meta-analyzed 2 major international data sets, the 2003 Trends in International Mathematics and Science Study and the Programme for International Student Assessment, representing 493,495 students 14-16 years of age, to estimate the magnitude of gender differences in mathematics achievement, attitudes, and affect across 69 nations throughout the world. Consistent with the gender similarities hypothesis, all of the mean effect sizes in mathematics achievement were very small (d < 0.15); however, national effect sizes showed considerable variability (ds = -0.42 to 0.40). Despite gender similarities in achievement, boys reported more positive math attitudes and affect (ds = 0.10 to 0.33); national effect sizes ranged from d = -0.61 to 0.89. In contrast to those of previous tests of the gender stratification hypothesis, our results point to specific domains of gender equity responsible for gender gaps in math. Gender equity in school enrollment, women's share of research jobs, and women's parliamentary representation were the most powerful predictors of cross-national variability in gender gaps in math. Results are situated within the context of existing research demonstrating apparently paradoxical effects of societal gender equity and highlight the significance of increasing girls' and women's agency cross-nationally.","authors":["Nicole M Else-Quest","Janet Hyde","Marcia C Linn"],"meta":["January 2010Psychological Bulletin 136(1):103-27","DOI:10.1037/a0018053","SourcePubMed"],"references":["325671732_Gender_differences_in_personality_traits_across_cultures_Robust_and_surprising_findings","303253351_The_relation_between_gender_and_emotion_in_different_cultures","323424582_Statistical_power_analysis_for_the_behavioral_sciences","308468884_Sex_differences_in_intrinsic_aptitude_for_mathematics_and_science","297817643_Comparisons_between_PISA_and_TIMSS-are_we_the_man_with_two_watches","289964044_International_standard_classification_of_occupations_ISCO-88","288976116_I'm_the_best_in_maths_Boys_rule_girls_drool_Masculinities_mathematics_and_primary_schooling","287929985_Gender_differences_in_math_Cognitive_processes_in_an_expanded_framework","286122081_I_can_but_I_don't_want_to_The_Impact_of_Parents_Interests_and_Activities_on_Gender_Differences_in_Math","285943360_Standards_and_Expectancies_Contrast_and_Assimilation_in_Judgments_of_Self_and_Others","280745343_Fixed-_and_Random-Effects_Models_in_Meta-Analysis","275998577_Sex_Differences_in_Social_Behavior_A_Social-Role_Interpretation","272790287_Development_As_Freedom","271795462_Creating_Gender_Equality_Cross-National_Gender_Stratification_and_Mathematical_Performance","264467255_The_Development_and_Assessment_of_a_Course_for_Enhancing_the_3-D_Spatial_Visualization_Skills_of_First_Year_Engineering_Students"]}