{"id":"41169838_Forecasting_for_cruise_line_revenue_management","abstract":"In recent years, the cruise line industry has become an exciting growth category in the leisure travel market. Like airlines and hotels, it reports all characteristics of revenue management (RM). Although RM has attracted widespread research interest in airline and hotel contexts, studies of cruise line revenue management are very limited. Using data from a major North American cruise company, we apply a variety of (24) forecasting methods, which are divided into three categories (non-pickup methods, classical pickup (CP) methods and advanced pickup (AP) methods), to generate forecasts of final bookings for the cruises that have not yet departed at a particular reading point. We use a two-stage framework to test alternative forecasting methods and compare their performance. We found the performance of multiplicative methods to be significantly worse. Among the additive methods, we find that classical methods perform the best, followed by AP and non-pickup methods. All CP methods with the exception of exponential smoothing with trend perform fairly well. Among AP methods, Autoregressive integrated moving average, linear regression and moving average (MA) produce the most accurate forecasts. Within non-pickup methods, MA is the most effective method.","authors":["Xiaodong Sun","Dinesh K. Gauri","Scott Taggart Webster"],"meta":["January 2010Journal of Revenue and Pricing Management 10(4)","DOI:10.1057/rpm.2009.55"],"references":["235291991_Country-of-origin_and_brand_effects_on_consumers'_evaluations_of_cruise_lines","306157547_Time_Series_Analysis_Forecasting_and_Control","279837487_Forecasting_for_airline_network_revenue_management_revenue_and_competitive_impacts","279827293_Airline_revenue_management_sell-up_and_forecasting_algorithms","266708128_The_Theory_and_Practice_of_Revenue_Management","263803987_Open-loop_and_closed-loop_models_of_dynamic_oligopoly_in_the_cruise_line_industry","263306192_A_service_performance_model_of_Hong_Kong_cruise_travelers'_motivation_factors_and_satisfaction","258051743_Time_series_analysis_Forecasting_and_control_Rev_ed","243777111_Forecasting_and_Control_of_Passenger_Bookings","240232951_Forecasting_and_optimisation_for_hotel_revenue_management"]}