{"id":"41393256_LDA_Based_Face_Recognition_by_Using_Hidden_Markov_Model_in_Current_Trends","abstract":"Hidden Markov model (HMM) is a promising method that works well for images with variations in lighting, facial expression, and orientation. Face recognition draws attention as a complex task due to noticeable changes produced on appearance by illumination, facial expression, size, orientation and other external factors. To process images using HMM, the temporal or space sequences are to be considered. In simple terms HMM can be defined as set of finite states with associated probability distributions. Only the outcome is visible to the external user not the states and hence the name Hidden Markov Model. The paper deals with various techniques and methodologies used for resolving the problem .We discuss about appearance based, feature based, model based and hybrid methods for face identification. Conventional techniques such as Principal Component Analysis (PCA), Linear Discriminant Analysis (LDA), Independent Component Analysis (ICA), and feature based Elastic Bunch Graph Matching (EBGM) and 2D and 3D face models are well-known for face detection and recognition.","authors":["S.Sharavanan","M.Azath"],"meta":["October 2009International Journal of Engineering and Technology 1(2)"],"references":["265281052_Low_Resolution_Single_Neural_Network_Based_Face_Recognition","236525541_Image_enhancement_for_face_recognition","279128988_Face_recognition_using_improved_fast_PCA_algorithm","264099763_Robust_Face_Recognition_System_using_AAM_and_Gabor_Feature_Vectors","251843452_An_Improvement_Algorithm_of_Principal_Component_Analysis","238747874_An_Improved_Illumination_Normalization_based_on_Anisotropic_Smoothing_for_Face_Recognition","238743233_3D_Dense_Correspondence_for_3D_Dense_Morphable_Face_Shape_Model","238741596_3D_Face_Modeling_based_on_3D_Dense_Morphable_Face_Shape_Model","238718107_A_new_face_recognition_method_using_PCA_LDA_and_neural_network","228965632_Sub-image_homomorphic_filtering_technique_for_improving_facial_identification_under_difficult_illumination_conditions"]}