{"id":"41395380_Sostenibilidad_y_gobernanza","abstract":"The word «sustainability» is nowadays commonly related to a fuzzy array of concepts, like nature, environment, ecology, preservation or development. The first task of this chapter will be to establish some clear limits to that fuzzy set of ideas, correcting its environmental bias and stressing its moral elements. Once defined, it will be possible to check whether the notion of sustainability could help in achieving good governance, and how. It will be shown that, although sustainability works well as a filter -especially to discard damaging policies-, it has no political content at all. Sustainability could constitute a useful rhetorical resource, but it is absolutely meaningless without being associated to a concrete discourse or proposal.\n\nSi a una persona no especialmente informada se le habla hoy de sostenibilidad, lo más probable es que acuda a su cabeza una serie de ideas comúnmente asociadas al término: naturaleza, medio ambiente, ecología, conservación, desarrollo, etc. La primera tarea de estas páginas consistirá, precisamente, en especificar, filtrar y acaso extender esta serie de ideas. Después se intentará averiguar si puede ayudar a emprender una buena acción de gobierno, y cómo. La conclusión a la que se llegará es que la sostenibilidad resulta eficaz como criterio de selección -especialmente para descartar acciones de gobierno perniciosas- y debe desempeñar el papel de un ideal regulativo, pero no ofrece programas concretos de buen gobierno. La retórica de la sostenibilidad da juego (permite al menos cuatro figuras recurrentes, como se verá), pero no proporcionará resultado alguno si el discurso que recurre a ella no posee su propio contenido.","authors":["Armando Menéndez Viso"],"meta":["October 2005Arbor CLXXXI(715)","DOI:10.3989/arbor.2005.i715.415"],"references":["247568994_Steady_State_Economics","330983004_Economics_and_environment_Essays_on_ecological_economics_and_sustainable_development","286146161_Human_well_being_and_the_natural_environment_a_focus_on_ecosystem_services","284652191_Sustainability_An_economist's_perspective","271506556_Limits_to_Growth-The_30-Year_Update","265310156_DESARROLLO_SOSTENIBLE_LA_LUCHA_POR_LA_INTERPRETACION","254753261_Economy_and_environment_in_search_of_sustainable_development","247910366_The_Entropy_Law_and_the_Economic_Process","240046150_Indicators_for_Sustainable_Developme_nt_Theory_Method_Applications","227650567_Risk_regulation_and_the_right_to_know_Exploring_the_impacts_of_access_to_information_on_the_governance_of_environmental_risk"]}