{"id":"4193571_A_dynamic_compilation_framework_for_controlling_microprocessor_energy_and_performance","abstract":"Dynamic voltage and frequency scaling (DVFS) is an effective technique for controlling microprocessor energy and performance. Existing DVFS techniques are primarily based on hardware, OS time-interrupts, or static-compiler techniques. However, substantially greater gains can be realized when control opportunities are also explored in a dynamic compilation environment. There are several advantages to deploying DVFS and managing energy/performance tradeoffs through the use of a dynamic compiler. Most importantly, dynamic compiler driven DVFS is fine-grained, code-aware, and adaptive to the current microarchitecture environment. This paper presents a design framework of the run-time DVFS optimizer in a general dynamic compilation system. A prototype of the DVFS optimizer is implemented and integrated into an industrial-strength dynamic compilation system. The obtained optimization system is deployed in a real hardware platform that directly measures CPU voltage and current for accurate power and energy readings. Experimental results, based on physical measurements for over 40 SPEC or Olden benchmarks, show that significant energy savings are achieved with little performance degradation. SPEC2K FP benchmarks benefit with energy savings of up to 70% (with 0.5% performance loss). In addition, SPEC2K INT show up to 44% energy savings (with 5% performance loss), SPEC95 FP save up to 64% (with 4.9% performance loss), and Olden save up to 61% (with 4.5% performance loss). On average, the technique leads to an energy delay product (EDP) improvement that is 3×-5× better than static voltage scaling, and is more than 2× (22% vs. 9%) better than the reported DVFS results of prior static compiler work. While the proposed technique is an effective method for microprocessor voltage and frequency control, the design framework and methodology described in this paper have broader potential to address other energy and power issues such as di/dt and thermal control.","authors":["Qiang Wu","Vijay Janapa Reddi","Youfeng Wu","Jin Lee"],"meta":["December 2005","DOI:10.1109/MICRO.2005.7","SourceIEEE Xplore","Conference: Microarchitecture, 2005. MICRO-38. Proceedings. 38th Annual IEEE/ACM International Symposium on"],"references":["232647102_Dynamic_Frequency_and_Voltage_Control_for_a_Multiple_Clock_Domain_Microarchitecture","221005058_Dynamic_frequency_and_voltage_control_for_a_multiple_clock_domain_microarchitecture","280292422_Pin","271451892_Compile-time_dynamic_voltage_scaling_settings","270607967_A_Formal_Approach_to_Frequent_Energy_Adaptations_for_Multimedia_Applications","262493820_Advanced_Compiler_Design_Implementation","243609512_Dynamic_Power_Management_for_Embedded_Systems","221496738_Early_Experiences_with_Olden","220752030_Compile_time_dynamic_voltage_scaling_settings_Opportunities_and_limits","213893387_Intel_Itanium_Architecture_Software_Developer's_Manual_Volumes_1-3"]}