{"id":"4201499_Multi-objective_optimisation_using_S-metric_selection_application_to_three-dimensional_solution_spaces","abstract":"The S-metric or hypervolume measure is a distinguished quality measure for solution sets in Pareto optimisation. Once the aim to reach a high S-metric value is appointed, it seems to be promising to directly incorporate it in the optimisation algorithm. This idea has been implemented in the SMS-EMOA, an evolutionary multi-objective optimisation algorithm (EMOA) using the hypervolume measure within its selection operator. Solutions are rated according to their contribution to the dominated hypervolume of the current population. Up to now, the SMS-EMOA has only been applied to functions with two objectives. The work at hand extends these studies, by surveying the behaviour of the algorithm on three-objective problems. Additionally, a new efficient algorithm for the computation of the contributions to the dominated hypervolume in three-dimensional solution spaces is presented. Different variants of selection operators are proposed. Among these, a new one is presented that rates a solution concerning the number of solutions dominating it. So, solutions in less explored regions are preferred. This rating is an efficient alternative to the S-metric criterion whenever a selection among dominated solutions has to be made. Comparative studies on standard benchmark problems show that the SMS-EMOA clearly outperforms other well established EMOA. First results on a challenging real-world problem have been obtained, namely the multipoint design of an airfoil involving three objectives and nonlinear constraints. Not only a clear improvement of the baseline design but a good coverage of the Pareto front with a small limited number of points has been achieved.","authors":["Boris Naujoks","Nicola (Beume) Hochstrate","Michael Emmerich"],"meta":["October 2005","DOI:10.1109/CEC.2005.1554838","SourceIEEE Xplore","Conference: Evolutionary Computation, 2005. The 2005 IEEE Congress onVolume: 2","Project: Set-Oriented and Indicator-Based Multicriteria Optimization (SIMCO)"],"references":["235960558_Metamodel-Assisted_multiobjective_optimization_with_implicit_constraints_and_its_application_in_airfoil_design","221228384_An_EMO_Algorithm_Using_the_Hypervolume_Measure_as_Selection_Criterion","316799364_Genetic_Algorithms_and_Evolutionary_Computation","277291920_The_Measure_of_Pareto_Optima_Applications_to_Multi-objective_Metaheuristics","266476598_Multi-Objective_Optimization_Using_Evolutionary_Algorithms","235709708_A_Fast_Multi-objective_Evolutionary_Algorithm_for_Finding_Well-Spread_Pareto-Optimal_Solutions","221228621_Towards_a_Quick_Computation_of_Well-Spread_Pareto-Optimal_Solutions","221228450_A_New_Analysis_of_the_LebMeasure_Algorithm_for_Calculating_Hypervolume","216457303_Indicator-Based_Selection_in_Multiobjective_Search","216457263_Lecture_Notes_in_Computer_Science"]}