{"id":"4260737_Preparing_Software_Engineering_Graduates_for_an_Industry_Career","abstract":"The lack of preparedness of software engineering (SE) graduates for a professional career is a common complaint raised by industry practitioners. The career progression of many new graduates is severely impacted due to the lack of well rounded skills. For example, some of the technically stronger graduates lack communication and managerial skills and vise versa. Industry based capstone projects, incorporated as a part of an undergraduate degree, are a well accepted means of preparing students for their professional careers. Software Engineering undergraduates at the University of Melbourne engage in such industry based projects both in the penultimate and final years of their degree. Though aimed at providing students a real-life SE experience and preparing them for industry, we observed these projects to fail in some cases in giving the necessary breadth of skills. We believe this failure to be due to the lack of an objective framework to guide student learning outcomes during projects. To address this problem we developed an objective skill-based framework, focusing on managerial, engineering and personal skills. In this paper we present this framework and share our experiences of using it.","authors":["Shanika Karunasekera","Kunal Bedse"],"meta":["August 2007Software Engineering Education Conference, Proceedings","DOI:10.1109/CSEET.2007.39","SourceIEEE Xplore","Conference: Software Engineering Education & Training, 2007. CSEET '07. 20th Conference on"],"references":["220832269_Evaluating_Student_Teams_Developing_Unique_Industry_Projects","220093079_The_Guide_to_the_Software_Engineering_Body_of_Knowledge","311475581_Beyond_anecdote_towards_real_transfer_using_other_institutions'_experience_of_project_work","271429432_Beyond_anecdote_towards_real_transfer","251180422_Graduate_qualities_employment_and_mass_higher_education","248700517_Guide_to_the_Software_Engineering_Body_of_Knowledge_2004_Version_-_SWEBOK","232621884_What_Should_Graduating_Software_Engineers_Be_Able_To_Do","220808005_Beyond_anecdote_towards_real_transfer_Using_other_institutions'_experience_of_project_work","220631406_Imparting_effective_software_engineering_education","3247324_Developing_an_Accredited_Software_Engineering_Program","3050824_A_Student-Enacted_Simulation_Approach_to_Software_Engineering_Education"]}