{"id":"43131424_The_Importance_of_Measuring_Intraocular_Pressure_Using_a_Tonometer_in_Order_to_Estimate_the_Postmortem_Interval","abstract":"The purpose of this study is to evaluate postmortem eye changes and to investigate the relationship between these changes and time elapsed after death.\nThe eyes of 100 noncriminal cases who had died while being treated at Eskisehir Osmangazi University (ESOGU) hospital were evaluated for corneal turbidity and tache noire macroscopically, and also repeatedly evaluated by ophthalmoscope, pupilometer, and tonometer at intervals until removal from hospital. The postmortem time, corneal turbidity, development of tache noire, pupil size, intraocular pressure (IOP), and fundus findings were recorded. The relationship between these findings and the postmortem interval (PMI) was evaluated.\nNo relationship between tache noire development and postmortem time (P > 0.05) was found. The corneal turbidity ratio increased significantly at 8 hours after decease (P < 0.01). No relationship between right-left pupil size and postmortem time (P > 0.05) was found. There was, however, a significant relationship between the fundus findings and postmortem time. Over time, the first optic disc becomes pale, then vascular clarity decreases and segmentation increases. The right and left IOP related significantly to postmortem time and decreased gradually as time passed (P < 0.05). Application of linear, exponential, and power equations showed that IOP can be used to estimate postmortem time by a 2 hour interval with a 95% probability.\nThis study shows that corneal turbidity and IOP have a significant relationship with postmortem time and can be used to estimate a postmortem interval with other postmortem findings. This study provides data that would support the idea that such examination might be useful in estimating postmortem interval.","authors":["Yasemin Günay","Hikmet Basmak","B Kenan Kocaturk","Afsun Sahin"],"meta":["April 2010The American journal of forensic medicine and pathology: official publication of the National Association of Medical Examiners 31(2):151-5","DOI:10.1097/PAF.0b013e3181dd7933","SourcePubMed"],"references":["22483196_Studies_on_the_estimation_of_the_postmortem_interval_5_The_turbidity_of_the_cornea_author's_transl","22483193_Studies_on_the_estimation_of_the_postmortem_interval_4_Spontaneous_opening_and_closing_of_the_eyelids_after_death_author's_transl","15024351_Examination_of_the_eye_as_a_means_to_determine_the_early_postmortem_period_A_review_of_the_literature","10599638_Usefulness_of_postmortem_ocular_findings_in_forensic_autopsy"]}