{"id":"4350197_Using_Alice_in_Overview_Courses_to_Improve_Success_Rates_in_Programming_I","abstract":"Alice is a software environment in which students learn programming concepts by making animated movies and interactive applications. Monmouth University's Computer Science and Software Engineering departments each introduced the use of Alice in fall 2005 in two newly-created courses. The courses serve as freshman overviews of their respective disciplines and also, using Alice, introduce students to object-oriented programming ideas. Previously the first computer science course for majors in these programs was a traditional C++ Programming I course, which had a success rate of less than 50. This course was retained, but became the second course in these majors. From fall 2003 to spring 2007, 106 students enrolled in the traditional Programming I course in C++. Of these, 37 had previously taken one of the new overview courses including Alice; the remaining students had not. Among students who had not taken either new course, the success rate was 46.4%; among those who had, the success rate was 70.3%. The probability of observing these results if the new introductory courses using Alice had no effect would be less than 0.006. We have concluded that exposure to Alice in these courses has significantly increased students' probability of success in the traditional Programming I course.","authors":["Karin Johnsgard","James McDonald"],"meta":["May 2008Software Engineering Education Conference, Proceedings","DOI:10.1109/CSEET.2008.35","SourceIEEE Xplore","Conference: Software Engineering Education and Training, 2008. CSEET '08. IEEE 21st Conference on"],"references":["242400379_Using_Animated_3D_Graphics_to_Prepare_Novices_for_CS1","221538824_Evaluating_the_effectiveness_of_a_new_instructional_approach","221514864_Storytelling_Alice_motivates_middle_school_girls_to_learn_computer_programming","2551403_Teaching_Objects-first_In_Introductory_Computer_Science","265371443_Computer_science_An_overview","243715937_The_Perceived_Value_of_College_Physics_Textbooks_Students_and_Instructors_May_Not_See_Eye_to_Eye","242393297_Learning_to_Program_with_Alice","238248856_Interest_in_CS_as_a_major_drops_among_incoming_freshmen","231266355_TextRev_A_Window_into_How_General_and_Organic_Chemistry_Students_Use_Textbook_Resources","221537775_Through_the_looking_glass_teaching_CS0_with_Alice","31677958_Engineering_fundamentals_and_problem_solving_Arvid_R_Eide_et_al"]}