{"id":"44064090_Effect_of_Strength_and_Fiber_Reinforcement_on_Fire_Resistance_of_High-Strength_Concrete_Columns","abstract":"In this paper, results from fire resistance experiments on five types of reinforced concrete columns are presented. The variables considered in the study include concrete strength (NSC and HSC), aggregate type (siliceous and carbonate aggregate), and fiber reinforcement (steel and polypropylene fibers). Data from the study is used to determine the structural behaviour of HSC columns at elevated temperatures. A comparison is made of the fire resistance performance of HSC columns with that of normal strength concrete (NSC) and fiber-reinforced HSC columns. The factors that influence the thermal and structural behaviour of HSC concrete columns under fire conditions are discussed. The results show that the fire resistance of a NSC column is higher than that of a HSC column. Also, the addition of polypropylene fibers and the use of carbonate aggregate improve fire resistance. Dans le document, on présente les résultats d'essais de réaction au feu auxquels ont été soumis cinq types de poteaux en béton armé. Les variables considérées dans le cadre de l'étude incluent la résistance du béton (BRO ou BHR), le type de granulat (siliceux ou carbonaté) et le renforcement de fibres (fibres d'acier ou de polypropylène). Les données tirées de l'étude servent à déterminer le comportement structural des poteaux en BHR à haute température. On compare les performances en matière de tenue au feu de ces poteaux avec celles des poteaux en béton à résistance ordinaire (BRO) et des poteaux en BHR renforcés de fibres. Il est question des facteurs qui influencent le comportement thermique ou structural des poteaux en BHR en cas d'incendie. Les résultats montrent que la tenue au feu d'un poteau en BRO est meilleure que celle d'un poteau en BHR. En outre, l'ajout de fibres de polypropylène et l'utilisation d'un granulat carbonaté améliore la réaction au feu. RES","authors":["Venkatesh R. Kodur","Fu-Ping Cheng","Tienchih Wang","M. A. Sultan"],"meta":["February 2003Journal of Structural Engineering 129(2)","DOI:10.1061/(ASCE)0733-9445(2003)129:2(253)"],"references":["44055558_Thermal_propeties_of_high_strength_concrete_at_elevated_temperatures","292733280_Fire_resistance_of_fibre-reinforced_concrete_fibre_reinforced_concrete_present_and_the_future","284886744_Fire_performance_of_high-strength_concrete_A_report_of_the_state_of_the_art","275618795_Critical_Review_of_Fire-Dedicated_Thermal_and_Structural_Computer_Programs","44088069_Fiber_reinforced_concrete_for_enhancing_structural_fire_resistance_of_columns","44084908_New_facility_to_determine_fire_resistance_of_columns","44082849_Performance_of_high_strength_concrete_columns_under_severe_fire_conditions","44071646_A_computer_program_to_calculate_the_fire_resistance_of_rectangular_reinforced_concrete_columns","44071478_Method_to_calculate_the_fire_resistance_of_circular_reinforced_concrete_columns","44065070_Fire_Resistance_of_Reinforced_Concrete_Columns"]}