{"id":"44691308_Cochlea-scaled_entropy_not_consonants_vowels_or_time_best_predicts_speech_intelligibility","abstract":"Speech sounds are traditionally divided into consonants and vowels. When only vowels or only consonants are replaced by noise, listeners are more accurate understanding sentences in which consonants are replaced but vowels remain. From such data, vowels have been suggested to be more important for understanding sentences; however, such conclusions are mitigated by the fact that replaced consonant segments were roughly one-third shorter than vowels. We report two experiments that demonstrate listener performance to be better predicted by simple psychoacoustic measures of cochlea-scaled spectral change across time. First, listeners identified sentences in which portions of consonants (C), vowels (V), CV transitions, or VC transitions were replaced by noise. Relative intelligibility was not well accounted for on the basis of Cs, Vs, or their transitions. In a second experiment, distinctions between Cs and Vs were abandoned. Instead, portions of sentences were replaced on the basis of cochlea-scaled spectral entropy (CSE). Sentence segments having relatively high, medium, or low entropy were replaced with noise. Intelligibility decreased linearly as the amount of replaced CSE increased. Duration of signal replaced and proportion of consonants/vowels replaced fail to account for listener data. CSE corresponds closely with the linguistic construct of sonority (or vowel-likeness) that is useful for describing phonological systematicity, especially syllable composition. Results challenge traditional distinctions between consonants and vowels. Speech intelligibility is better predicted by nonlinguistic sensory measures of uncertainty (potential information) than by orthodox physical acoustic measures or linguistic constructs.","authors":["Christian E Stilp","Keith R Kluender"],"meta":["July 2010Proceedings of the National Academy of Sciences 107(27):12387-92","DOI:10.1073/pnas.0913625107","SourcePubMed"],"references":["243787812_TIMIT_Acoustic-phonetic_Continuous_Speech_Corpus","313755814_Some_informational_aspects_of_visual_perception","311814927_Contribution_of_consonant_versus_vowel_information_to_sentence_intelligibility_for_young_normal-hearing_and_elderly_hearing-impaired_listeners","285727357_Speech_Perception_Within_a_Biologically_Realistic_Information-Theoretic_Framework","285517813_Does_Sonority_Have_a_Phonetic_Basis","278901542_Episodic_encoding_of_voice_attributes_and_recognition_memory","270576780_Shimron_J_1993_The_role_of_vowels_in_reading_A_review_of_studies_of_English_and_Hebrew_Psychological_Bulletin_114_1_52-67","257291993_Sensory_Communication","252478081_Contemporary_Views_on_Architecture_and_Representations_in_Phonology","248067316_The_Written_Language_Bias_in_Linguistics"]}