{"id":"44798215_Medical_student_attitudes_toward_video_games_and_related_new_media_technologies_in_medical_education","abstract":"Studies in K-12 and college students show that their learning preferences have been strongly shaped by new media technologies like video games, virtual reality environments, the Internet, and social networks. However, there is no known research on medical students' game experiences or attitudes towards new media technologies in medical education. This investigation seeks to elucidate medical student experiences and attitudes, to see whether they warrant the development of new media teaching methods in medicine.\nMedical students from two American universities participated. An anonymous, 30-item, cross-sectional survey addressed demographics, game play experience and attitudes on using new media technologies in medical education. Statistical analysis identified: 1) demographic characteristics; 2) differences between the two universities; 3) how video game play differs across gender, age, degree program and familiarity with computers; and 4) characteristics of students who play most frequently.\n217 medical students participated. About half were female (53%). Respondents liked the idea of using technology to enhance healthcare education (98%), felt that education should make better use of new media technologies (96%), and believed that video games can have educational value (80%). A majority (77%) would use a multiplayer online healthcare simulation on their own time, provided that it helped them to accomplish an important goal. Men and women agreed that they were most inclined to use multiplayer simulations if they were fun (97%), and if they helped to develop skill in patient interactions (90%). However, there was significant gender dissonance over types of favorite games, the educational value of video games, and the desire to participate in games that realistically replicated the experience of clinical practice.\nOverall, medical student respondents, including many who do not play video games, held highly favorable views about the use of video games and related new media technology in medical education. Significant gender differences in game play experience and attitudes may represent male video game design bias that stresses male cognitive aptitudes; medical educators hoping to create serious games that will appeal to both men and women must avoid this.","authors":["Frederick W Kron","Craig L Gjerde","Ananda Sen","Michael D Fetters"],"meta":["June 2010BMC Medical Education 10(1):50","DOI:10.1186/1472-6920-10-50","SourcePubMed","Project: MPathic"],"references":["249689679_The_virtual_census_Representations_of_gender_race_and_age_in_video_games","344473976_An_Introduction_to_Digital_Media","313603050_Youth_are_leading_the_transition_to_a_fully_wired_and_mobile_nation","312369677_Boomers_Gen-Xers_and_Millennials_Understanding_the_New_Students","298645764_Gender_differences_in_relationships_and_stress_of_medical_and_law_students","298024559_Leadership's_online_labs","267448280_Sex_and_Cognition","265280485_Leadership'_s_Online_Labs","265092376_Educating_the_Net_Generation","255631550_Teaching_and_Learning_with_the_Net_Generation"]}