{"id":"44807123_Pharmacy_Education_in_India","abstract":"Pharmacy education in India traditionally has been industry and product oriented. In contrast to the situation in developed nations, graduate pharmacists prefer placements in the pharmaceutical industry. To practice as a pharmacist in India, one needs at least a diploma in pharmacy, which is awarded after only 2 years and 3 months of pharmacy studies. These diploma-trained pharmacists are the mainstay of pharmacy practice. The pharmacy practice curriculum has not received much attention. In India, there has been a surge in the number of institutions offering pharmacy degrees at various levels and a practice-based doctor of pharmacy (PharmD) degree program was started in some private institutions in 2008. However, relatively little information has been published describing the current status of complex pharmacy education of India. In this paper we describe pharmacy education in India and highlight major issues in pharmacy practice including deficiencies in curriculum. The changing face of the profession is discussed, including the establishment of the PharmD program. The information presented in this paper may stimulate discussion and critical analysis and planning, and will be of value in further adaptation of the pharmacy education to desired educational outcomes.","authors":["Subal C Basak","Sathyanarayana Dondeti"],"meta":["May 2010American Journal of Pharmaceutical Education 74(4):68","DOI:10.5688/aj740468","SourcePubMed"],"references":["268502467_Pharmacy_practice_and_education_in_India_Current_issues_and_trends","26273622_The_PharmD_Degree_in_Developing_Countries","20838625_Opportunities_and_Responsibilities_in_Pharmaceutical_Care","5528921_A_Decade_of_Pharmacy_Practice_Education_in_India","293628306_D_Pharm_or_Pharm_D_A_Professional_chirality","281543736_Sixth_pay_commission_report-fatal_blow_for_practicing_pharmacists","281526951_History_of_modern_pharmacy_in_India_A_review_of_the_work_of_Professor_Harkishan_Sing","242309174_Pharmaceutical_Education_and_Pharmacy_Practice_A_Historical_Perspective","23778310_Higher_Education_in_India_The_Need_for_Change","7745231_Clinical_pharmacy_education_in_India"]}