{"id":"44843634_A_construcao_da_agenda_de_genero_no_sistema_educacional_brasileiro_1996-2007","abstract":"Dissertação (mestrado)—Universidade de Brasília, Instituto de Ciências Sociais, Departamento de Sociologia, 2008. O trabalho apresenta uma pesquisa exploratória que mapeia o processo de construção da agenda de gênero dentro do sistema educacional brasileiro, no período entre 1996 e 2007. Ao mesmo tempo, propõe um marco teórico desenvolvido a partir das três dimensões da teoria de justiça de Fraser (1997, 2005): redistribuição, reconhecimento e representação, e a partir da adaptação dessas dimensões ao campo da educação primeiro sugerida por Caviedes, Fernández & Barrientos (2006). A proposta é compor um modelo tri-dimensional que, ao analisar ou formular a educação como política pública do Estado, abarque as dimensões econômica, cultural-simbólica e política de maneira integrada (entendendo que cada dimensão dialoga e interfere nas demais) e transversal (entendendo que essa leitura deve perpassar todo o sistema, em todas as suas instâncias e formulações). A pesquisa exploratória foi feita em três níveis: internacional, nacional e local. No plano internacional, foram examinados alguns documentos balizadores da agenda internacional de educação e da agenda internacional de gênero. No plano nacional (Estado Nacional Brasileiro, no nível da União), a pesquisa foi direcionada às instituições (através das entrevistas com técnicas e coordenadoras identificadas e com a Ministra Nilcéa Freire), aos documentos que conformam as bases legais da educação, às políticas nacionais de educação e às políticas de gênero na educação. Finalmente, no plano local (escolas), realizaram-se entrevistas com diretores, professora e alunas, de forma a identificar por que caminhos a agenda de gênero formulada pelo Estado alcança este espaço. Como resultado, identificou-se a co-existência de duas agendas de gênero e educação paralelas: uma primeira inaugurada em 1996, com a nova LDB e com a série de reformas educativas realizadas pelo Estado Brasileiro ao longo dos anos 1990, que responde aos compromissos internacionais assumidos pelo país; e uma segunda, inaugurada em 2004, com a formulação do I PNPM e com a criação da SECAD no Ministério da Educação. O percurso dessas agendas, sua posição no interior do Estado, bem como seu grau de complexidade e seu entendimento do que são e de onde se localizam as desigualdades de gênero, não são os mesmos. Enquanto a primeira, que começa a se desenhar em 1996, parte do centro para as extremidades, ou seja, das bases legais que definem a educação como política pública, para a formulação de políticas nacionais de educação; a segunda circula pelas extremidades, pelas políticas de gênero em educação e pela incidência pontual em algumas políticas nacionais de educação, sem haver conseguido, até agora, chegar ao centro. _________________________________________________________________________________________ ABSTRACT The present work presents an exploratory research that maps the formulating process of a gender agenda for the Brazilian educational system, covering the period from 1996 to 2007. It also proposes a theoretical frame based on Fraser’s (1997, 2005) dimensions of justice – redistribution, recognition and representation – and on the adaptation of this theory to the field of education first suggested by Caviedes, Fernández & Barrientos (2006). The aim is to compose a tri-dimensional model that analyses and/or formulates education as a public policy in view of a perspective that embraces economic, cultural-symbolic and political dimensions in an integrated and crosscutting way. The exploratory research was conducted in three different levels: international, national and local. In the international level, some selected key documents for education and for the promotion of women’s rights were examined. In the national level (National State level), the research addressed both institutions and documents that compose the legal ground of education, the national policies for education, and gender policies in education. Finally, in the local level (schools), interviews were conducted with school staff in order to identify the entry paths of State educational policy in the local space. As a result, the research identified the co-existence of two parallel gender agendas in education: a first one that starts in 1996 with the new LDB e with the series of educational reforms carried out by the Brazilian State throughout the 1990s; and a second one, which starts in 2004 with the formulation of the I PNPM and the creation of SECAD in the Ministry of Education. The course of these two agendas, their position inside the structure of the National State, as well as their complexity levels, and their understanding of the gender inequalities encountered in the educational system are not the same. While the first one goes from the centre to the margins of the system, starting at the legal ground to the national policies on education; the second one circulates in the margins, in the formulation of gender policies for education, and in the eventual incidence in national policies for education, without having managed, so far, to achieve the centre.","authors":["Nina Madsen"],"meta":["August 2008Sociedade e Estado 23(3)","DOI:10.1590/S0102-69922008000300029"],"references":["266274261_Genero_Educacion_y_Politica_Publica","250040569_Producao_do_conhecimento_em_um_mundo_problematico_contribuicoes_de_um_feminismo_dialetico_e_relacional","228374595_O_Plano_de_Desenvolvimento_da_Educacao_analise_do_projeto_do_MEC","28075846_Mujer_y_Educacion_en_America_Latina_hacia_la_igualdad_de_oportunidades","26366591_Mau_aluno_boa_aluna_como_as_professoras_avaliam_meninos_e_meninas","26366566_De_uma_politica_de_ideias_a_uma_politica_de_presenca","26356762_Estado_e_politicas_publicas_sociais","309455663_Interpretando_o_genero","274585952_Justice_Interruptus_Critical_Reflections_on_the_Postsocialist_Condition","237681075_INTRINCADA_TRAMA_DE_MASCULINIDADES_E_FEMINILIDADES_FRACASSO_ESCOLAR_DE_MENINOS"]}