{"id":"44889778_Darling_AE_Mau_B_Perna_NT_progressiveMauve_multiple_genome_alignment_with_gene_gain_loss_and_rearrangement_PLoS_ONE_5_e11147","abstract":"Multiple genome alignment remains a challenging problem. Effects of recombination including rearrangement, segmental duplication, gain, and loss can create a mosaic pattern of homology even among closely related organisms.\nWe describe a new method to align two or more genomes that have undergone rearrangements due to recombination and substantial amounts of segmental gain and loss (flux). We demonstrate that the new method can accurately align regions conserved in some, but not all, of the genomes, an important case not handled by our previous work. The method uses a novel alignment objective score called a sum-of-pairs breakpoint score, which facilitates accurate detection of rearrangement breakpoints when genomes have unequal gene content. We also apply a probabilistic alignment filtering method to remove erroneous alignments of unrelated sequences, which are commonly observed in other genome alignment methods. We describe new metrics for quantifying genome alignment accuracy which measure the quality of rearrangement breakpoint predictions and indel predictions. The new genome alignment algorithm demonstrates high accuracy in situations where genomes have undergone biologically feasible amounts of genome rearrangement, segmental gain and loss. We apply the new algorithm to a set of 23 genomes from the genera Escherichia, Shigella, and Salmonella. Analysis of whole-genome multiple alignments allows us to extend the previously defined concepts of core- and pan-genomes to include not only annotated genes, but also non-coding regions with potential regulatory roles. The 23 enterobacteria have an estimated core-genome of 2.46Mbp conserved among all taxa and a pan-genome of 15.2Mbp. We document substantial population-level variability among these organisms driven by segmental gain and loss. Interestingly, much variability lies in intergenic regions, suggesting that the Enterobacteriacae may exhibit regulatory divergence.\nThe multiple genome alignments generated by our software provide a platform for comparative genomic and population genomic studies. Free, open-source software implementing the described genome alignment approach is available from http://gel.ahabs.wisc.edu/mauve.","authors":["Aaron E Darling","Bob Mau","Nicole T Perna"],"meta":["June 2010PLoS ONE 5(6):e11147","DOI:10.1371/journal.pone.0011147","SourcePubMed"],"references":["253638083_errata_Genome_sequence_of_enterohaemorrhagic_Escherichia_coli_0157H7","221313645_A_Unifying_View_of_Genome_Rearrangements","221313636_Procrastination_Leads_to_Efficient_Filtration_for_Local_Multiple_Alignment","220581350_Thompson_JD_Plewniak_F_Poch_O_A_comprehensive_comparison_of_multiple_sequence_alignment_programs_Nucleic_Acids_Res_27_2682-2690","51424492_Dynamics_of_Genome_Rearrangement_in_Bacterial_Populations","43343281_BioTorrents_A_File_Sharing_Service_for_Scientific_Data","29618753_Sorting_by_Reversals_in_Subquadratic_Time","270051470_Analyses_of_deep_mammalian_sequence_alignments_and_constraint_predictions_for_1_of_the_human_genome","237044495_Biological_Sequence_Analysis","35393907_Computational_analysis_of_genome_evolution","26250101_Fast_Statistical_Alignment","24394351_A_Novel_Heuristic_for_Local_Multiple_Alignment_of_Interspersed_DNA_Repeats","24213383_Simultaneous_Bayesian_gene_tree_reconstruction_and_reconciliation_analysis","23957061_Multiple_whole-genome_alignments_without_a_reference_organism","23479577_Inferring_genomic_flux_in_bacteria"]}