{"id":"45188111_Bridging_the_gulf_between_correlated_random_walks_and_Levy_walks_Autocorrelation_as_a_source_of_Levy_walk_movement_patterns","abstract":"For many years, the dominant conceptual framework for describing non-oriented animal movement patterns has been the correlated random walk (CRW) model in which an individual's trajectory through space is represented by a sequence of distinct, independent randomly oriented 'moves'. It has long been recognized that the transformation of an animal's continuous movement path into a broken line is necessarily arbitrary and that probability distributions of move lengths and turning angles are model artefacts. Continuous-time analogues of CRWs that overcome this inherent shortcoming have appeared in the literature and are gaining prominence. In these models, velocities evolve as a Markovian process and have exponential autocorrelation. Integration of the velocity process gives the position process. Here, through a simple scaling argument and through an exact analytical analysis, it is shown that autocorrelation inevitably leads to Lévy walk (LW) movement patterns on timescales less than the autocorrelation timescale. This is significant because over recent years there has been an accumulation of evidence from a variety of experimental and theoretical studies that many organisms have movement patterns that can be approximated by LWs, and there is now intense debate about the relative merits of CRWs and LWs as representations of non-orientated animal movement patterns.","authors":["Andy Reynolds"],"meta":["December 2010Journal of The Royal Society Interface 7(53):1753-8","DOI:10.1098/rsif.2010.0292","SourcePubMed"],"references":["243390071_Beyond_Brownian_Motion","318392949_Quantitative_Analysis_of_Movement_Measuring_and_Modeling_Population_Redistribution_in_Animals_and_Plants","312818332_On_the_fluctuations_of_sums_of_random_variables","289754826_Correlation_Analysis_of_Two-Dimensional_Locomotion_Paths","266192575_Modelling_of_motility_in_biological_systems","265682220_On_the_fluctuations_of_sums_of_random_variables_II","252809019_On_the_Theory_of_the_Brownian_Motion_II","252643401_Levy_Walks_Versus_Levy_Flights","252525010_The_Brownian_Movement_and_Stochastic_Equations","243075013_On_Distributions_of_Certain_Wiener_Functionals","231137447_Levy_flights_and_random_searches","243051023_On_Fluctuations_of_Sums_of_Random_Variables","241704544_Sampling_rate_and_misidentification_of_Levy_and_non-Levy_movement_paths_Reply","232806618_Behavioral_intermittence_LEvy_patterns_and_randomness_in_animal_movement","231981006_Criteria_for_the_selection_of_stochastic_models_of_particle_trajectories_in_turbulent_flows"]}