{"id":"45284327_Reassuring_the_medical_students'_disease_-_Health_related_anxiety_among_medical_students","abstract":"Studying a specific illness could lead medical students to an incorrect interpretation of certain physical symptoms, so that symptoms which were previously considered normal are now regarded as a true sign of an illness.\nTo examine the appraisal of self-health state, the existing fear of morbidity and the level of health-related anxiety among medical students throughout medical school.\nAnonymous questionnaires were distributed to first through sixth year medical students at the Tel-Aviv University Medical School. The questionnaires were distributed to all the students who were present on the study days.\nWe observed a significant rise in the emotional-distress process with entering the clinical years followed by a significant decrease later on. Similar pattern was seen in health anxiety and in preoccupation with and fear of illness and death. While the perceptual-cognitive process increased gradually, there was no change in interference with life scores.\n\"Medical student's disease\" should be regarded as a phenomenon depending on the years of learning. By breaking it down into its components, one can better characterize it and predict its onset. By defining it as a normal process, one can assist in guiding medical students to reduce their level of anxiety and distress.","authors":["Joseph Azuri","Nissim Ackshota","Shlomo Vinker"],"meta":["July 2010Medical Teacher 32(7):e270-5","DOI:10.3109/0142159X.2010.490282","SourcePubMed"],"references":["20776636_Transient_Hypochondriasis","314104219_A_cognitive-behavioural_approach_to_hypochondriasis_and_health_anxiety","284037392_Training_for_detached_concern_in_medical_students","277706837_Hypochondriacal_Fears_and_Beliefs_in_Medical_and_Law_Students","273961764_Teaching_Learning_in_Medical_School","234025773_The_Health_Anxiety_Questionnaire","232140831_The_Student-Physician","232108107_The_Student-Physician","229761429_Teaching_and_Learning_in_Medical_School","20533890_A_cognitive-behavioural_approach_to_hypochondriasis_and_health_anxiety","14763977_The_course_of_transient_hypochondriasis","20070057_Levels_and_sources_of_stress_in_medical_school","19197969_Hypochondriacal_fears_and_beliefs_in_medical_and_law_students","18784588_Medical_Students'_Disease_Hypochondriasis_in_Medical_Education","18613479_Social_Psychologic_Factors_Affecting_the_Presentation_of_Bodily_Complaints"]}