{"id":"45363297_A_teoria_subjacente_aos_mapas_conceituais_e_como_elabora-los_e_usa-los","abstract":"Este texto apresenta a origem da ferramenta de mapas conceituais e descreve brevemente o início do seu desenvolvimento. Apresentam-se algumas das ideias da Teoria da Assimilação de Ausubel (1963, 1968) que serviram como base para a criação dos mapas conceituais, destacando-se a importância da assimilação de novos conceitos e proposições na estrutura cognitiva prévia do aprendiz para a construção de significados. Apresentam-se ainda as bases epistemológicas dessa teoria de aprendizagem cognitiva, incluindo-se a ideia de que a produção criativa de um novo conhecimento pode ser entendida como um nível bastante avançado de aprendizagem significativa, processo que pode ser facilitado pela utilização de mapas conceituais. Busca-se ilustrar a larga variedade das ferramentas disponíveis no programa gratuito CmapTools, cujas várias aplicações incluem o auxílio ao desenvolvimento da aprendizagem significativa e do currículo, a captura e retenção de conhecimento especializado tácito e explícito e o fortalecimento da produção criativa. O uso do programa CmapTools, de fontes da internet e de outros recursos digitais prepara um poderoso Novo Modelo de Educação, levando à criação de portfólios de conhecimento individual, capazes de registrar a aprendizagem significativa e embasar qualquer futura aprendizagem afim. O programa CmapTools oferece ainda amplo suporte para colaboração, bem como para a publicação e compartilhamento de modelos de conhecimento.AbstractThe theory underlying concept maps and how to construct and use themThis text presents the origin of the concept map tool and some of the early history in the development of this tool. Some of the ideas from Ausubel’s (1963; 1968) assimilation theory of cognitive learning that served as a foundation for concept mapping are presented, including the important role that assimilating new concepts and propositions into a learner’s existing cognitive framework plays in meaning making. Epistemological foundations are also presented including the idea that creative production of new knowledge can be seen as a very high level of meaningful learning, and concept mapping can facilitate the process. The wide range of tools available in free CmapTools software and some applications are illustrated, including application for facilitating meaningful learning, better curriculum development, capturing and archiving tacit and explicit expert knowledge, and enhancing creative production. Using CmapTools, WWW resources, and other digital resources provide for a powerful New Model for Education leading to the creation of individual knowledge portfolios that can document significant learning and serve as a foundation for future related learning. CmapTools also provides extensive support for collaboration, publishing and sharing of knowledge models.","authors":["Joseph D. Novak","Alberto J. Cañas"],"meta":["July 2010Praxis Educativa 5(1)","DOI:10.5212/PraxEduc.v.5i1.009029"],"references":["267403415_Support_for_Constructing_Knowledge_Models_in_CmapTools","259703561_Knowledge_Maps_as_Scaffolds_for_Cognitive_Processing","258842056_Online_Concept_Maps_Enhancing_collaborative_learning_by_using_technology_with_concept_maps","252642478_The_Theory_Underlying_Concept_Maps_and_How_to_Construct_Them","288319337_Portfolios_in_Science_Assessment_A_Knowledge-_Based_Model_for_Classroom_Practice","287225305_Seeing_the_invisible_Perceptual_-_Cognitive_aspects_of_expertise","285380003_Scaffolding_children's_learning_Vygotsky_and_early_childhood_education","258944945_Alternative_instructional_systems_and_the_development_of_problem-solving_skills_in_physics","257925990_How_People_Learn_Mind_Brain_Experience_and_School","248742371_Concept_maps_and_Vee_diagrams_two_metacognitive_tools_for_science_and_mathematics_education"]}