{"id":"45825700_A_Comparative_Study_Ontology_Building_Tools_for_Semantic_Web_Applications","abstract":"Ontologies have recently received popularity in the area of knowledge management and knowledge sharing,especially after the evolution of the Semantic Web and its supporting technologies. An ontology defines the termsand concepts (meaning) used to describe and represent an area of knowledge.The aim of this paper is to identify allpossible existing ontologies and ontology management tools (Protégé 3.4, Apollo, IsaViz & SWOOP) that are freelyavailable and review them in terms of: a) interoperability, b) openness, c) easiness to update and maintain, d)market status and penetration. The results of the review in ontologies are analyzed for each application area, suchas transport, tourism, personal services, health and social services, natural languages and other HCI-relateddomains. Ontology Building/Management Tools are used by different groups of people for performing diverse tasks.Although each tool provides different functionalities, most of the users just use only one, because they are not ableto interchange their ontologies from one tool to another. In addition, we considered the compatibility of differentontologies with different development and management tools. The paper is also concerns the detection ofcommonalities and differences between the examined ontologies, both on the same domain (application area) andamong different domains.","authors":["Bhaskar Kapoor","Sharma Savita"],"meta":["July 2010","DOI:10.5121/ijwest.2010.1301"],"references":["243772462_Ontology_Development_101_A_Guide_to_Creating_Your_First_Ontology","231908719_Overview_and_analysis_of_methodologies_for_building_ontologies","221009791_Towards_the_Use_of_Ontologies_for_Improving_User_Interaction_for_People_with_Special_Needs","319393397_Towards_a_Methodology_for_Building_Ontologies","303229779_Ontology","258368687_Encyclopedia_of_Database_Systems","244956886_A_Guide_to_Creating_Your_First_Ontology","228057911_The_Semantic_Web","222709884_Swoop_A_Web_Ontology_Editing_Browser","220426611_A_collaborative_approach_to_ontology_design"]}