{"id":"45929183_Heapable_Sequences_and_Subsequences","abstract":"Let us call a sequence of numbers heapable if they can be sequentially inserted to form a binary tree with the heap property, where each insertion subsequent to the first occurs at a leaf of the tree, i.e. below a previously placed number. In this paper we consider a variety of problems related to heapable sequences and subsequences that do not appear to have been studied previously. Our motivation for introducing these concepts is two-fold. First, such problems correspond to natural extensions of the well-known secretary problem for hiring an organization with a hierarchical structure. Second, from a purely combinatorial perspective, our problems are interesting variations on similar longest increasing subsequence problems, a problem paradigm that has led to many deep mathematical connections. We provide several basic results. We obtain an efficient algorithm for determining the heapability of a sequence, and also prove that the question of whether a sequence can be arranged in a complete binary heap is NP-hard. Regarding subsequences we show that, with high probability, the longest heapable subsequence of a random permutation of n numbers has length (1 - o(1)) n, and a subsequence of length (1 - o(1)) n can in fact be found online with high probability. We similarly show that for a random permutation a subsequence that yields a complete heap of size \\alpha n for a constant \\alpha can be found with high probability. Our work highlights the interesting structure underlying this class of subsequence problems, and we leave many further interesting variations open for future work. Comment: 15 pages, 6 figures","authors":["John Byers","Brent Heeringa","Michael Mitzenmacher","Georgios Zervas"],"meta":["July 2010","SourcearXiv"],"references":["234816674_The_Hiring_Problem_and_Lake_Wobegon_Strategies","220779991_The_hiring_problem_and_Lake_Wobegon_strategies","272675777_A_combinatorial_problem_in_geometry","265351744_Variations_on_the_Monotone_Subsequence_Theme_of_Erds_and_Szekeres","245340494_Longest_increasing_subsequences_From_patience_sorting_to_the_Baik-Deift-Johansson_theorem","240332741_The_Secretary_Problem_and_Its_Extensions_A_Review","227146912_A_Combinatorial_Problem_in_Geometry","220544365_Design_and_Implementation_of_an_Efficient_Priority_Queue","38363507_Who_Solved_the_Secretary_Problem","38362952_The_Height_of_a_Random_Partial_Order_Concentration_of_Measure"]}