{"id":"46093467_Diffusion_of_Innovation_in_Social_Networking_Sites_among_University_Students","abstract":"Diffusion of Innovations (DOI) is a theory of how, why, and at what rate newideas and technology spread through cultures. This study tested the attributes ofDOI empirically, using Social networking sites (SNS) as the target innovation.The study was conducted among students of the University of Agriculture,Abeokuta in Nigeria. The population comprised of people already connected toone social networking site or the other. Data collection instrument was astructured questionnaire administered to 120 respondents of which 102 werereturned giving 85% return rate. Principal Factor Analysis and MultipleRegression were the analytical techniques used. Demographic characteristics ofthe respondents revealed that most of them were students and youths. From thefactor analysis performed, it was revealed the constructs: relative advantage,complexity, and observability of SNS do not positively affect the attitude towardsusing the technology while the compatibility and trialability of SNS does positivelyaffect the attitude towards using the technology. The study concluded that theattitude of university students towards SNS does positively affect the intention touse the technology.","authors":["Olusegun Folorunso","Olufunke Rebecca Vincent","Adebayo Felix Adekoya"],"meta":["January 2010"],"references":["237739832_The_Adoption_of_Automatic_Teller_Machines_in_Nigeria_An_Application_of_the_Theory_of_Diffusion_of_Innovation","227446117_User_Acceptance_of_Computer_Technology_A_Comparison_of_Two_Theoretical_Models","220438020_Social_Network_Sites_Definition_History_and_Scholarship","200775164_Friendster_and_Publicly_Articulated_Social_Networks","51992897_Social_Capital_Prospects_for_A_New_Concept","267922562_The_Diffusion_of_Innovations","227613743_The_Diffusion_of_technological_innovation_in_the_commercial_banking_industry","224534981_3G_Mobile_Phone_Usage_in_China_Viewpoint_from_Innovation_Diffusion_Theory_and_Technology_Acceptance_Model","8902775_The_Internet_and_Social_Life"]}