{"id":"46093594_Iris_Recognition_Using_Modified_Hierarchical_Phase-Based_Matching_HPM_Technique","abstract":"This paper explores an efficient algorithm for iris recognition based on Hierarchical Phase-Based Image Matching (HPM) technique. One of the difficult problems in feature-based iris recognition is that the matching performance is significantly influenced by many parameters in feature extraction process, which may vary depending on environmental factors of image acquisition. The proposed system is designed for applications where the training database contains an iris for each individual. The final decision is made by HPM at \"matching score level architecture\" in which feature vectors are created independently for query images and are then compared to the enrollment templates which are stored during database preparation for each biometric trait. Based on the proximity of feature vector and template, each subsystem computes its own matching score. These individual scores are finally combined into a total score, which is passed to the decision module. In this proposed technique, the use of phase components in 2D (two dimensional) discrete Fourier transforms of iris images makes possible to achieve highly robust iris recognition in a unified fashion with a simple matching algorithm. The technique has been successfully applied and also clearly demonstrates an efficient matching performance of the proposed algorithm.","authors":["D. Chinnadurai","Karnan M"],"meta":["May 2010International Journal of Computer Science Issues 7(3)","Project: Library and Information Science"],"references":["321595814_Fundamentals_of_the_New_Artificial_Intelligence_Neural_Evolutionary_Fuzzy_and_More","321594314_Automated_Practical_Reasoning_Algebraic_Approaches","319765539_Object_Oriented_Modeling","297228975_GROUPWARE_-_SOME_ISSUES_AND_EXPERIENCES","286707454_Embedded_Image_Coding_using_Zerotrees_of_Wavelet_Coefficients","272139836_Artificial_Intelligence_A_Systems_Approach","268889612_Computational_intelligence_Principles_techniques_and_applications_With_CD-ROM","266344338_Multi-agent_systems_Towards_a_collective_intelligence","263261963_A_New_Approach_to_the_State-transfer_Problem","262314091_Formal_Ontology_Conceptual_Analysis_and_Knowledge_Representation","262007807_Taking_CSCW_seriously","261122223_The_traffic_carrying_capacity_of_wireless_networks","247544041_Skills_rules_knowledge_Signals_signs_and_symbols_and_other_distinctions_in_humans_performance_mo","247484540_Semantic_Networks_in_Artificial_Intelligence","244422360_Controllability_of_Linear_Dynamical_Systems"]}