{"id":"46287616_Does_the_mind_map_learning_strategy_facilitate_information_retrieval_and_critical_thinking_in_medical_students","abstract":"A learning strategy underutilized in medical education is mind mapping. Mind maps are multi-sensory tools that may help medical students organize, integrate, and retain information. Recent work suggests that using mind mapping as a note-taking strategy facilitates critical thinking. The purpose of this study was to investigate whether a relationship existed between mind mapping and critical thinking, as measured by the Health Sciences Reasoning Test (HSRT), and whether a relationship existed between mind mapping and recall of domain-based information.\nIn this quasi-experimental study, 131 first-year medical students were randomly assigned to a standard note-taking (SNT) group or mind map (MM) group during orientation. Subjects were given a demographic survey and pre-HSRT. They were then given an unfamiliar text passage, a pre-quiz based upon the passage, and a 30-minute break, during which time subjects in the MM group were given a presentation on mind mapping. After the break, subjects were given the same passage and wrote notes based on their group (SNT or MM) assignment. A post-quiz based upon the passage was administered, followed by a post-HSRT. Differences in mean pre- and post-quiz scores between groups were analyzed using independent samples t-tests, whereas differences in mean pre- and post-HSRT total scores and subscores between groups were analyzed using ANOVA. Mind map depth was assessed using the Mind Map Assessment Rubric (MMAR).\nThere were no significant differences in mean scores on both the pre- and post-quizzes between note-taking groups. And, no significant differences were found between pre- and post-HSRT mean total scores and subscores.\nAlthough mind mapping was not found to increase short-term recall of domain-based information or critical thinking compared to SNT, a brief introduction to mind mapping allowed novice MM subjects to perform similarly to SNT subjects. This demonstrates that medical students using mind maps can successfully retrieve information in the short term, and does not put them at a disadvantage compared to SNT students. Future studies should explore longitudinal effects of mind-map proficiency training on both short- and long-term information retrieval and critical thinking.","authors":["Anthony V D'Antoni","Genevieve Pinto Zipp","Valerie G Olson","Terrence F Cahill"],"meta":["September 2010BMC Medical Education 10(1):61","DOI:10.1186/1472-6920-10-61","SourcePubMed"],"references":["307728177_Anteil_Stigma-assoziierter_Themen_im_Psychiatrie-Konzept_von_Medizinstudierenden_in_der_Einfuhrung_in_die_klinische_Medizin_Eine_Mind-Map_Studie_Proportion_of_stigma-associated_items_in_medical_studen","277694243_Critical_Thinking_in_Graduate_Medical_Education","267416000_Mind_Maps_Useful_Schematic_Tool_For_Organizing_And_Integrating_Concepts_Of_Complex_Patient_Care_In_The_Clinic_And_Classroom","247433802_The_locus_of_contextual_interference_in_motor-skill_acquistion","297172567_THE_SPATIAL-ARRANGEMENT_MNEMONIC","276055029_It's_Called_Andragogy","255577796_Applications_of_the_Mind_Map_Learning_Technique_in_Chiropractic_Education_A_Pilot_Study_and_Literature","249824961_Sociological_Paradigms_and_Organisational_Analysis","246016116_Educational_psychology_a_cognitive_view_New_York","243766879_The_Modern_Practice_of_Adult_Education_Andragogy_Versus_Pedagog"]}