{"id":"46478990_Should_you_believe_in_the_Shanghai_ranking_An_MCDM_view_1","abstract":"This paper proposes a critical analysis of the \"Academic Ranking of World Universities\", published every year by the Institute of Higher Education of the Jiao Tong University in Shanghai and more commonly known as the Shanghai ranking. After having recalled how the ranking is built, we first discuss the relevance of the criteria and then analyze the proposed aggregation method. Our analysis uses tools and concepts from Multiple Criteria Decision Making (MCDM). Our main conclusions are that the criteria that are used are not relevant, that the aggregation methodology is plagued by a number of major problems and that the whole exercise suffers from an insufficient attention paid to fundamental structuring issues. Hence, our view is that the Shanghai ranking, in spite of the media coverage it receives, does not qualify as a useful and pertinent tool to discuss the \"quality\" of academic institutions, let alone to guide the choice of students and family or to promote reforms of higher education systems. We outline the type of work that should be undertaken to oer sound alternatives to the Shanghai ranking.","authors":["Jean-Charles Billaut","Denis Bouyssou","Philippe Vincke"],"meta":["July 2009Scientometrics 84(hal-00388319_v2)","DOI:10.1007/s11192-009-0115-x","SourceRePEc","Project: Bibliometrics"],"references":["325896868_Ranking_of_Higher_Education_Institutions","321619879_Data_Envelopment_Analysis_A_Comprehensive_Text_with_Models_Applications_References_and_DEA-Solver_Software","305397097_Higher_education_rankings_Robustness_issues_and_critical_assessment","346790257_Measuring_the_efficiency_of_decision-making_units","324319758_Research_for_Marketing_Decisions","322622227_Integrated_support_from_problem_structuring_through_to_alternative_evaluation_using_cope_and_VISA","316249304_Decisions_with_Multiple_Objectives_--_Preferences_and_Value_Tradeoffs","311244996_Du_mauvais_usage_de_faux_indicateurs","300977562_MAIN_SOURCES_OF_INACCURATE_DETERMINATION_UNCERTAINTY_AND_IMPRECISION_IN_DECISION_MODELS","299822834_Decision_Analysis_and_Behavioral_Research"]}