{"id":"46533906_Decision_Making_A_Computer-Science_and_Information-Technology_Viewpoint","abstract":"We address the phenomenon of decision making from the viewpoint of computer science and information technology. The basic question from this viewpoint is: what can the computer offer to decision makers and how it can support their work? Therefore, the main issue is to provide support to people who make complex decisions. In this article, we first present the taxonomy of disciplines that are concerned with methodological and operational aspects of decision support. At the main level, we distinguish between decision sciences, which are concerned with human decision making, and decision systems, which address computer decision making. This is followed by basic definitions related to decision processes and their components. We also describe properties that characterise different classes of decision problems. In the main part of the article, we present three prevailing approaches to decision support and give illustrative examples of their application: decision analysis, operational research, and decision support systems. Finally, we make a short overview of the area of decision systems and its achievements.","authors":["Marko Bohanec"],"meta":["December 2009Interdisciplinary Description of Complex Systems 7(2):22-37","SourceRePEc"],"references":["284679050_DEX_An_Expert_System_Shell_for_Decision_Support","255621095_Guidebook_to_Decision-Making_Methods","234799082_Decision_Support_and_Data_Warehouse_Systems","324690241_Decision_Support_Systems_Concepts_and_Resources_for_Managers","312469285_Machine_learning_an_algorithmic_perspective","260869406_Behind_Deep_Blue_Building_the_Computer_that_Defeated_the_World_Chess_Champion","243554343_Multicriteria_Decision_Making_The_Analytic_Hierarchy_Process","242377427_Operations_Research_An_Introduction","236824023_Behind_Deep_Blue_Building_the_Computer_that_Defeated_the_World_Chess_Champion_review","234825127_Decision_Theory_An_Introduction_to_the_Mathematics_of_Rationality"]}