{"id":"4755412_Arrow's_Theorem_with_Weak_Independence","abstract":"Arrow's widely known theorem on social welfare functions asserted the inconsistency of a set of individually plausible conditions [1].1 In the extensive literature which followed it was frequently argued that the Independence of Irrelevant Alternatives (IIA) was too strong an assumption. This paper explores the consequences of weakening it. When the independence condition is removed, those which remain are consistent; for a finite number of alternatives, one may use summation of utilities; but this ignores the large body of successful theory based upon the ordinalist position, and is not a serious attempt to resolve the dilemma posed by Arrow's theorem. On the other hand IIA is indeed a powerful assumption, and plays a central, apparently vital, role in the proof of Arrow's theorem [2], [3]. I propose to take a position in the middle ground between IIA and no independence at all, thereby permitting some interpersonal comparison of utility. The main question to be answered, of course, is whether the weakened condition is, unlike the original, consistent with Arrow's other conditions. My reasoning will be expressed within Arrow's theory. Some noted economists have suggested that the problem of social choice was incorrectly posed by Arrow; but he has argued cogently that his \"formulation of the social choice problem as the selection of a constitution is not only compatible with the views of such critics . . ., but in fact is a logical corollary of their positive position\" ([2], p. 103). Thus the dispute concerns, not the idea of social welfare function, but rather the conditions to be imposed upon it. Of these, Arrow has removed monotonicity as an issue, by means of a technical advance in [2], leaving the independence condition as the main target. Arrow's theorem, as revised in 1963, asserts that the Independence of Irrelevant Alternatives is inconsistent with universal domain (i.e. no restriction on individual preferences), non-dictatorship, and the principle that unanimity prevails. The independence condition requires that the social ranking of a set B of alternatives shall be fully determined by the individual rankings of B, and thus shall be independent of individual opinions concerning the \"irrelevant\" alternatives not in B. (A precise statement will be given in the next section.) This is equivalent to the same requirement for all pairs, as opposed to all sets B. I call this the binary property,","authors":["Julian H Blau"],"meta":["February 1971Economica 38(152):413-20","DOI:10.2307/2551881","SourceRePEc"],"references":[]}