{"id":"47792778_The_Deglutition_Handicap_Index_a_self-administrated_dysphagia-specific_quality_of_life_questionnaire_temporal_reliability","abstract":"The aim of this study is to contribute to the psychometric validation of the self-administrated dysphagia-specific quality of life questionnaire, the Deglutition Handicap Index. Created on the model of the \"Voice Handicap Index\". this questionnaire consists of 30 statements on deglutition related aspects in daily life (5 point-rating scale). It is subdivided in three domains of 10 items: physical (symptoms), functional (nutritional and respiratory consequences) and emotional (psychosocial consequences).\n57 patients were included suffering of any kind of swallowing disorders. 17 questionnaires were eliminated because 1 to 3 items were not anchored. A test retest performed in an interval of 2 weeks, allowed the measure of the intraclasse correlation coefficient and the limits of agreement with Bland and Altman graphics.\nThe intraclasse correlation coefficient was respectively 0.77 (0.64-0.90), 0.87 (0.79-0.94), 0.90 (0.84-0.96), 0.91 (0.85-0.96) for the Physical, Functional, Emotional and Total Scores. The limits of agreement are 9 points for the subscales and 20 points for the total score.\nThe DHI has been validated in term of content, concurrent and construct validity. The reliability was satisfied in term of internal consistency. It is now validated for the temporal reliability. The DHI is the solely specific quality of life questionnaire related to deglutition available for all kind of oropharyngeal swallowing disorders in adults available in clinical practice.","authors":["Virginie Woisard","B Lepage"],"meta":["April 2010Revue de Laryngologie - Otologie - Rhinologie 131(1):19-22","SourcePubMed"],"references":["263537954_The_Voice_Handicap_Index_VHI_Development_and_Validation","225744956_The_SWAL-QOL_Outcomes_Tool_for_Oropharyngeal_Dysphagiain_Adults_II_Item_Reduction_and_Preliminary_Scaling","51389218_Validation_of_a_self-assessment_questionnaire_for_swallowing_disorders_Deglutition_Handicap_Index","11410149_Social_and_Psychological_Burden_of_Dysphagia_Its_Impact_on_Diagnosis_and_Treatment","11410145_The_SWAL-QOL_and_SWAL-CARE_outcomes_tool_for_oropharyngeal_dysphagia_in_adults_III_documentation_of_reliability_and_validity","23234549_Adaptation_and_validation_of_the_Italian_MD_Anderson_Dysphagia_Inventory_MDADI","15214093_Assessment_of_functional_status_in_general_medicine_the_COOPWONCA_indices","11893856_The_development_and_validation_of_a_dysphagia-specific_quality-of-life_questionnaire_for_patients_with_head_and_neck_cancer_The_M_D_Anderson_Dysphagia_Inventory"]}