{"id":"48667242_Joyce_Appleby_The_Relentless_Revolution_A_History_of_Capitalism_Norton_2010","abstract":"Today everybody wants to be a capitalist, even Chinese communists. It would be easy to think, then, that capitalism is \"natural,\" that there is a little profit-seeker in each one of us just waiting to pop out. There is some truth to this notion: humans are the most cooperative species on earth, and one of the most common ways we cooperate is through trade. Some form of \"you scratch my back and I'll scratch yours\" lies at the heart of almost every human relationship. We are built for reciprocation, and we do it remarkably well. But, as Joyce Appleby shows in her provocative, readable, and thoroughly entertaining The Relentless Revolution: A History of Capitalism (Norton, 2010), the natural impulse for reciprocal back-scratching did not capitalism make. A set of very unusual historical forces did. These historical forces were not everywhere and always. On the contrary, they came together in one place at one time: Northwestern Europe in what we might call the \"long modern period,\" roughly the 15th though 18th centuries. Of course people in other places and other times traded, and even traded a lot. But they did not develop the culture of capitalism, that is, a set of values that suggested making money was good not only for the money-maker but for everyone else. Alexander Pope, one of the early apologists of capitalism, put the capitalist ethic this way: \"Thus God and Nature link'd the gen'ral frame, and bade self-love and social be the same.\" (An Essay on Man, 1733) Gordon Gekko, in the (anti-capitalist) film Wall Street (1987), put it more crudely: \"Greed...is good.\" Neither, it should be said, did pre-capitalist traders develop the institutions that make capitalism operate, that is, things like investment banks, credits, stock markets, insurance, and a whole host of government regulations (yes, government regulations) without which \"free trade\" could not be \"free\" at all. Caesar was not concerned about in the federal reserve. He didn't even have a federal reserve to be concerned about. All of which leads to a single and startling conclusion: the culture and institutions of capitalism are Western. Thus when we in the West promote capitalism as the \"best\" way of going about things economic, we are engaging in a subtle form of cross-cultural persuasion. We may be right, capitalism may indeed be the best way to provision goods and services to the masses (I think it obviously is). But that doesn't make capitalist culture any the less foreign to most of the world.","authors":["Marshall Poe","Joyce Appleby"],"meta":["January 2011"],"references":[]}