{"id":"49607114_O_Impacto_dos_Estilos_de_Aprendizagem_no_Ensino_de_Contabilidade","abstract":"Esse estudo tem como objetivo principal avaliar o impacto dos estilos de aprendizagem dos alunos e professores e estilos das disciplinas no desempenho acadêmico dos alunos de um curso de graduação em Contabilidade no Brasil. Para identificação dos estilos de aprendizagem foi utilizado o questionário ILS de Felder e Soloman (1991), baseado no modelo teórico de Felder e Silverman (1988). Participaram da pesquisa 194 alunos e 29 professores. Os professores, além do ILS, responderam outro questionário, elaborado pelos pesquisadores com mesmo embasamento teórico, para identificação dos estilos de 40 disciplinas do curso. O desempenho acadêmico dos alunos foi mensurado pelas médias finais das notas das disciplinas. Os resultados mostraram que os estilos de aprendizagem predominantes nos alunos são ativo, sensorial, visual e sequencial e nos professores são reflexivo, intuitivo, visual e sequencial. Nas disciplinas são predominantes os estilos reflexivo, sensorial, verbal e sequencial. Foi constatado o impacto dos estilos desses elementos no desempenho acadêmico dos alunos, tanto individualmente, como combinados.","authors":["Denise Mendes da Silva","Jose Dutra Oliveira Neto"],"meta":["January 2010Contabilidade Vista & Revista","Project: Learning Styles"],"references":["312470401_Learningteaching_styles_in_engineering_education","284045871_Meet_your_students_2_Susan_and_Glenda","279894244_Applications_reliability_and_validity_of_the_Index_of_Learning_Styles","265397499_Analise_dos_estilos_de_aprendizagem_dos_alunos_e_professores_do_curso_de_graduacao_em_ciencias_contabeis_de_uma_universidade_publica_do_estado_do_Parana_com_a_aplicacao_do_inventario_de_David_Kolb","325886251_Introduction_Introduction","304373193_Analise_multivariada_de_dados","292399742_Learning_Style_A_Determinant_of_Student_Performance_for_the_Introductory_Financial_Accounting_Course","284377593_An_assessment_of_the_learning_style_preferences_of_accounting_majors","275714380_Adaptive_Style_Inventory_Self_Scored_Inventory_and_Interpretation_Booklet","265405800_ENSINO_As_abordagens_do_processo"]}