{"id":"49617100_A_Novel_Density_based_improved_k-means_Clustering_Algorithm_-_Dbkmeans","abstract":"Mining knowledge from large amounts of spatial data isknown as spatial data mining. It becomes a highly demandingfield because huge amounts of spatial data have been collected invarious applications ranging from geo-spatial data to bio-medicalknowledge. The amount of spatial data being collected isincreasing exponentially. So, it far exceeded human’s ability toanalyze. Recently, clustering has been recognized as a primarydata mining method for knowledge discovery in spatial database.The database can be clustered in many ways depending on theclustering algorithm employed, parameter settings used, andother factors. Multiple clustering can be combined so that thefinal partitioning of data provides better clustering. In this paper,a novel density based k-means clustering algorithm has beenproposed to overcome the drawbacks of DBSCAN and kmeansclustering algorithms. The result will be an improved version of kmeansclustering algorithm. This algorithm will perform betterthan DBSCAN while handling clusters of circularly distributeddata points and slightly overlapped clusters.","authors":["Kainaat Mumtaz","K. Duraiswamy"],"meta":["March 2010International Journal on Computer Science and Engineering 2(2)"],"references":["221214752_OPTICS_Ordering_Points_to_Identify_the_Clustering_Structure","220695963_Finding_Groups_in_Data_An_Introduction_To_Cluster_Analysis","3297085_CLARANS_A_method_for_clustering_objects_for_spatial_data_mining","324286003_Finding_Groups_in_Data_An_Introduction_to_Cluster_Analysis","312388900_STING_A_statistical_information_grid_approach_to_spatial_data_mining","240157352_Automatic_Subspace_Clustering_of_High_Dimensional_Data_for_data_mining_applications","223624491_CURE_An_efficient_clustering_algorithm_for_large_databases","221653977_A_Density-Based_Algorithm_for_Discovering_Clusters_in_Large_Spatial_Databases_with_Noise","221311096_STING_A_Statistical_Information_Grid_Approach_to_Spatial_Data_Mining","2500574_BIRCH_An_Efficient_Data_Clustering_Method_for_Very_Large_Databases"]}