{"id":"4967860_Competing_Models_of_Entrepreneurial_Intention","abstract":"Why are intentions interesting to those who care about new venture formation? Entrepreneurship is a way of thinking, a way of thinking that emphasizes opportunities over threats. The opportunity identification process is clearly an intentional process, and, therefore, entrepreneurial intentions clearly merit our attention. Equally important, they offer a means to better explain—and predict—entrepreneurship.We don't start a business as a reflex, do we? We may respond to the conditions around us, such as an intriguing market niche, by starting a new venture. Yet, we think about it first; we process the cues from the environment around us and set about constructing the perceived opportunity into a viable business proposition.In the psychological literature, intentions have proven the best predictor of planned behavior, particularly when that behavior is rare, hard to observe, or involves unpredictable time lags. New businesses emerge over time and involve considerable planning. Thus, entrepreneurship is exactly the type of planned behavior and for which intention models are ideally suited. If intention models prove useful in understanding business venture formation intentions, they offer a coherent, parsimonious, highly-generalizable, and robust theoretical framework for understanding and prediction.Empirically, we have learned that situational (for example, employment status or informational cues) or individual (for example, demographic characteristics or personality traits) variables are poor predictors. That is, predicting entrepreneurial activities by modeling only situational or personal factors usually resulted in disappointingly small explanatory power and even smaller predictive validity. Intentions models offer us a significant opportunity to increase our ability to understand and predict entrepreneurial activity.The current study compares two intention-based models in terms of their ability to predict entrepreneurial intentions: Ajzen's theory of planned behavior (TPB) and Shapero's model of the entrepreneurial event (SEE). Ajzen argues that intentions in general depend on perceptions of personal attractiveness, social norms, and feasibility. Shapero argues that entrepreneurial intentions depend on perceptions of personal desirability, feasibility, and propensity to act. We employed a competing models approach, comparing regression analyses results for the two models. We tested for overall statistical fit and how well the results supported each component of the models. The sample consisted of student subjects facing imminent career decisions. Results offered strong statistical support for both models.(1) Intentions are the single best predictor of any planned behavior, including entrepreneurship. Understanding the antecedents of intentions increases our understanding of the intended behavior. Attitudes influence behavior by their impact on intentions. Intentions and attitudes depend on the situation and person. Accordingly, intentions models will predict behavior better than either individual (for example, personality) or situational (for example, employment status) variables. Predictive power is critical to better post hoc explanations of entrepreneurial behavior; intentions models provide superior predictive validity. (2) Personal and situational variables typically have an indirect influence on entrepreneurship through influencing key attitudes and general motivation to act. For instance, role models will affect entrepreneurial intentions only if they change attitudes and beliefs such as perceived self-efficacy. Intention-based models describe how exogenous influences (for eample, perceptions of resource availability) change intentions and, ultimately, venture creation. (3) The versatility and robustness of intention models support the broader use of comprehensive, theory-driven, testable process models in entrepreneurship research (MacMillan and Katz 1992). Intentional behavior helps explain and model why many entrepreneurs decide to start a business long before they scan for opportunities.Understanding intentions helps researchers and theoreticians to understand related phenomena. These include: what triggers opportunity scanning, the sources of ideas for a business venture, and how the venture ultimately becomes a reality. Intention models can describe how entrepreneurial training molds intentions in subsequent venture creation (for example, how does training in business plan writing change attitudes and intentions?). Past research has extensively explored aspects of new venture plans once written. Intentionality argues instead that we study the planning process itself for determinants of venturing behavior. We can apply intentions models to other strategic decisions such as the decision to grow or exit a business. Researchers can model the intentions of critical stakeholders in the venture, such as venture capitalists' intentions toward investing in a given company. Finally, management researchers can explore the overlaps between venture formation intentions and venture opportunity identification.Entrepreneurs themselves (and those who teach and train them) should benefit from a better understanding of their own motives. The lens provided by intentions affords them the opportunity to understand why they made certain choices in their vision of the new venture.Intentions-based models provide practical insight to any planned behavior. This allows us to better encourage the identification of personally-viable, personally-credible opportunities. Teachers, consultants, advisors, and entrepreneurs should benefit from a better general understanding of how intentions are formed, as well as a specific understanding of how founders' beliefs, perceptions, and motives coalesce into the intent to start a business. This understanding offers sizable diagnostic power, thus entrepreneurship educators can use this model to better understand the motivations and intentions of students and trainees and to help students and trainees understand their own motivations and intentions.Carefully targeted training becomes possible. For example, ethnic and gender differences in career choice are largely explained by self-efficacy differences. Applied work in psychology and sociology tells us that we already know how to remediate self-efficacy differences. Raising entrepreneurial efficacies will raise perceptions of venture feasibility, thus increasing the perception of opportunity.Economic and community development hinges not on chasing smokestacks, but on growing new businesses. To encourage economic development in the form of new enterprises we must first increase perceptions of feasibility and desirability. Policy initiatives will increase business formations if those initiatives positively influence attitudes and thus influence intentions. The growing trends of downsizing and outsourcing make this more than a sterile academic exercise. Even if we successfully increase the quantity and quality of potential entrepreneurs, we must also promote such perceptions among critical stakeholders including suppliers, financiers, neighbors, government officials, and the larger community.The findings of this study argue that promoting entrepreneurial intentions by promoting public perceptions of feasibility and desirability is not just desirable; promoting entrepreneurial intentions is also thoroughly feasible.","authors":["Norris F. KruegerJR","Michael D. Reilly","Alan Carsrud"],"meta":["February 2000Journal of Business Venturing 15(5-6):411-432","DOI:10.1016/S0883-9026(98)00033-0","SourceRePEc"],"references":["284145947_Entrepreneurial_research_on_student_subjects_does_not_generalize_to_real_world_entrepreneurs","272790646_The_Theory_of_Planned_Behavior","270820380_Sociology_and_Entrepreneurship","270820261_An_Attitude_Approach_to_the_Prediction_of_Entrepreneurship","255640136_Person_Process_Choice_The_Psychology_of_New_Venture_Creation","243457330_Cognition_enactment_and_learning_in_the_entrepreneurial_process","232926814_Entrepreneurial_intentions_Applying_the_theory_of_planned_behaviour","232504333_Gender_Ethnicity_and_Social_Cognitive_Factors_Predicting_the_Academic_Achievement_of_Students_in_Engineering","232444612_The_Stability_of_Behavior_I_On_Predicting_Most_of_the_People_Much_of_the_Time","230557657_Toward_a_Unifying_Social_Cognitive_Theory_of_Career_and_Academic_Interest_Choice_and_Performance","229875646_How_Believing_in_Ourselves_Increases_Risk_Taking_Perceived_Self-Efficacy_and_Opportunity_Recognition","228316104_Properties_of_Emerging_Organizations","228314734_Implementing_Entrepreneurial_Ideas_The_Case_for_Intention","228314730_The_Impact_of_Prior_Entrepreneurial_Exposure_on_Perceptions_of_New_Venture_Feasibility_and_Desirability","228314339_Personal_and_Extended_Networks_Are_Central_to_the_Entrepreneurial_Process","4968232_Continued_Entrepreneurship_Ability_Need_and_Opportunity_As_Determinants_of_Small_Firm_Growth","312967656_Implementing_entrepreneurial_ideas_The_case_for_intentions","310842441_Social_dimensions_of_entrepreneurship","308058706_The_theory_of_planned_behavior_organizational_behavior_and_human_decision_processes","291981262_Modelling_Entrepreneurial_Career_Progressions_Concepts_and_Considerations","288180506_The_making_of_organizational_opportunities_An_interpretive_pathway_to_organizational_change","285319831_The_Long-Term_Supply_of_Entrepreneurs_Students'_Career_Aspirations_in_Relation_to_Entrepreneurship","284695352_The_social_dimension_of_entrepreneurship_in_Encyclopaedia_of_Entrepreneurship","284023886_Entrepreneurs--Mentors_Networks_and_Successful_New_Venture_Development_An_Exploratory_Study","272152586_The_Method_of_Multiple_Working_Hypotheses","270820317_The_Art_and_Science_of_Entrepreneurship_Ed","264667904_Attitudes_Traits_and_Actions_Dispositional_Prediction_of_Behavior_in_Personality_and_Social_Psychology","258130513_Relationships_Among_Attitudes_Behavioral_Intentions_and_Behavior_A_Meta-Analysis_of_Past_Research_Part_2","254619355_Role_Model_Performance_Effects_on_Development_of_Entrepreneurial_Career_Preference","242416080_The_Social_Foundations_of_Thought_and_Action","232606901_A_Retrospective_Study_of_Career_Development_I_Relationship_among_First_Aspirations_Parental_Occupations_and_Current_Occupations","230010226_The_psychological_context_of_strategic_decisions_A_test_of_relevance_to_practitioners","228321308_The_Art_and_Science_of_Entrepreneurship","228149510_Idiosyncratic_Milieus_of_Entrepreneurial_Research_The_Need_for_Comprehensive_Theories","222896892_The_Founder's_Self-Assessed_Competence_and_Venture_Performance","24098715_State_Versus_Action_Orientation_and_the_Theory_of_Reasoned_Action_An_Application_to_Coupon_Usage","24098423_Effects_of_Unexpected_Situations_on_Behavior-Intention_Differences_A_Garbology_Analysis","6091191_The_Method_of_Multiple_Working_Hypotheses_With_this_method_the_dangers_of_parental_affection_for_a_favorite_theory_can_be_circumvented","4838778_An_Investigation_into_the_Role_of_Intentions_as_Mediators_of_the_Attitude-Behavior_Relationship","2436596_Entrepreneurial_Attitudes_and_Intentions_of_Career_Decision_Makers","2436239_Where_Do_We_Learn_That_Entrepreneurship_Is_Feasible_Desirable_andor_Profitable-A_Look_at_the_Processes_Leading_to_Entrepreneurial_Potential"]}