{"id":"49771962_Stressors_and_Reactions_to_Stressors_Among_University_Students","abstract":"University students are prone to stressors due to the transitional nature of university life. High levels of stress are believed to affect students' health as well as their academic performance.\nThe aims of this study were to identify stressors and reactions to stressors among university students, and to examine the correlations between student stressors and study variables.\nA correlational descriptive design was used. Student-life Stress Inventory (SSI) was used to measure the stressors and reactions to stressors. Stratified random sampling was employed to recruit participants. The final sample consisted of 877 participants (students).\n\ns indicated that the highest group of stressors experienced by students were 'self-imposed' stressors followed by 'pressures'. Cognitive responses were found to be the highest responses to stressors experienced by students. Negative correlations were found with student's perception of health, and father's and mother's level of education.\nThis study revealed that stressors among university students come from 'self-imposed' stressors and 'pressures'. Stress management, assertiveness skills, time management and counselling sessions will be effective in reducing stress experienced by students.","authors":["Shaher H Hamaideh"],"meta":["January 2011International Journal of Social Psychiatry 57(1):69-80","DOI:10.1177/0020764010348442","SourcePubMed"],"references":["232551506_Differences_in_life_stress_and_reasons_for_living_among_college_suicide_ideators_and_non-ideators","281339714_Confirmatory_Factor_Analysis_and_Internal_Consistency_of_the_Student-life_Stress_Inventory","279405717_Environmental_Stress","255585043_Identifying_stressors_and_reactions_to_stressors_in_gifted_and_non-gifted_students","237036447_Nursing_Research_Principles_and_Methods","232563026_Psychological_Stress_and_The_Coping_Process","232510794_Coping_and_emotion","232490346_Psychoeducational_Interventions_for_Stress_Management_and_Well-Being","232442564_Campus_recreation_and_perceived_academic_stress","229517718_Stress_Active_Coping_and_Academic_Performance_Among_Persisting_and_Nonpersisting_College_Students"]}