{"id":"49819096_Target_detection_and_localization_in_shallow_water_An_experimental_demonstration_of_the_acoustic_barrier_problem_at_the_laboratory_scale","abstract":"This study demonstrates experimentally at the laboratory scale the detection and localization of a wavelength-sized target in a shallow ultrasonic waveguide between two source-receiver arrays at 3 MHz. In the framework of the acoustic barrier problem, at the 1/1000 scale, the waveguide represents a 1.1-km-long, 52-m-deep ocean acoustic channel in the kilohertz frequency range. The two coplanar arrays record in the time-domain the transfer matrix of the waveguide between each pair of source-receiver transducers. Invoking the reciprocity principle, a time-domain double-beamforming algorithm is simultaneously performed on the source and receiver arrays. This array processing projects the multireverberated acoustic echoes into an equivalent set of eigenrays, which are defined by their launch and arrival angles. Comparison is made between the intensity of each eigenray without and with a target for detection in the waveguide. Localization is performed through tomography inversion of the acoustic impedance of the target, using all of the eigenrays extracted from double beamforming. The use of the diffraction-based sensitivity kernel for each eigenray provides both the localization and the signature of the target. Experimental results are shown in the presence of surface waves, and methodological issues are discussed for detection and localization.","authors":["Christian Marandet","Philippe Roux","Barbara Nicolas","Jerome Mars"],"meta":["January 2011The Journal of the Acoustical Society of America 129(1):85-97","DOI:10.1121/1.3514503","SourcePubMed"],"references":["252895777_Phase_conjugation_in_the_ocean_Experimental_demonstration_of_an_acoustic_time-reversal_mirror","279402524_Physical_limitations_of_travel-time-based_shallow_water_tomography","274119375_Ocean_Acoustic_Tomography","269005001_Fundamentals_of_Ocean_Acoustics","261004632_Measurements_of_the_form_function_and_total_scattering_cross_section_for_a_suspension_of_spheres","253904442_Experimental_demonstration_of_an_acoustic_time-reversal_mirror_in_the_ocean","253704393_Tomography_Adjoint_Methods_Time-Reversal_and_Banana-Doughnut_Kernels","253255451_Forward-scatter_barrier_with_a_time-reversal_mirror","252657502_RST_analysis_of_monostatic_and_bistatic_acoustic_echos_from_an_elastic_sphere","249865023_Wave-equation_tomography"]}