{"id":"49911101_Product_structure_ontology_to_support_semantic_search_in_manufacturing_requirements_management","abstract":"Automated information extraction of 2D CAD engineering drawing ensures more accurate extracted information of product manufacturing requirements. However, an occurring problem from the automation process is the existence of heterogeneous terms in the engineering drawing. The problem can be solved by formalizing the knowledge in this domain. Therefore, a dynamic ontology called the Product Structure Ontology (PSO) has been developed. The process of developing the PSO is extended from Noy and McGuiness’s methodology. It consist of nine steps; determining ontology domain and scope, considering ontology reuse, enumerating important terms, defining classes and class hierarchies, creating instances of classes, designing anatomy and database schema, creating an evidence code, creating an annotation and developing the PSO artifacts. With the aim of enabling the PSO to be reused and extended, the PSO artifacts such as website, browser, database and documentations have been shared on the World Wide Web (WWW). In order to test the applicability and usage of the PSO in digital engineering drawing extraction, Semantic Ontology-based Searching Algorithm (SOBSA) has been developed. The SOBSA entails the use of PSO to overcome the limitation of keyword-based search by using information content approach and considering the three types of ontology relationships; subsumption, meronymy and association. The performance of SOBSA has been tested by using real digital engineering drawing and evaluated by using the standard information retrieval measures which are precision, recall and F1. The experimental evaluation demonstrates that the query search SOBSA improves the accuracy of the query retrieval results compared to conventional method. Besides that, the performance of SOBSA also depends on the type of relationship used and the completeness of the knowledge base.","authors":["Nadhiya N. Mohammad"],"meta":["January 2010"],"references":[]}