{"id":"50598827_Impact_of_psychiatric_diagnoses_on_hospital_length_of_stay_in_children_with_sickle_cell_anemia","abstract":"Patients with sickle cell anemia (SCA) experience a broad range of psychiatric disorders, placing them at risk for more complicated and longer hospitalizations for vaso-occlusive crises (VOC). The current study examined the frequency of psychiatric disorders in SCA patients (ages birth to 20 years) admitted for VOC in a nationally representative sample and the association between psychiatric disorders and hospital length of stay (LOS).\nPatients with a primary diagnosis of SCA with crisis identified through the nationally representative Kids' Inpatient Database (KID) 2006 from the Agency of Healthcare Research and Quality were included for analysis. Patients with psychiatric disorders listed as secondary diagnoses were categorized under specific psychiatric disorders (mood disorder, anxiety disorder, disruptive behavior disorder, substance use disorder). Non-parametric and regression analyses were utilized for nationally weighted data, to determine the effect of psychiatric disorders on LOS, while controlling for significant covariates.\nFor 21,255 hospital discharges for children with SCA with crisis in 2006, the mean LOS was 4.51 days. Approximately 6% of the patients discharged had a psychiatric disorder. After adjusting for significant covariates, mood disorders, anxiety disorders, and any psychiatric disorder were each associated with significantly longer LOS (P < 0.01). Substance and disruptive behavior disorders were not associated with LOS.\nPediatric patients diagnosed with a psychiatric disorder, specifically mood or anxiety disorders, have longer LOS for VOC. These findings suggest that future interventions aimed at managing VOC may need to consider adjunctive psychiatric assessment and intervention.","authors":["Matthew Myrvik","Andrew Campbell","Matthew Davis","Jennifer L Butcher"],"meta":["February 2012Pediatric Blood & Cancer 58(2):239-43","DOI:10.1002/pbc.23117","SourcePubMed"],"references":["51318722_Pain_inhibition_nicotine_and_gender","21214105_The_role_of_depression_in_hospital_admissions_and_emergency_treatment_of_patients_with_sickle_cell_disease","325146503_Role_of_Child_and_Maternal_Processes_in_the_Psychological_Adjustment_of_Children_With_Sickle_Cell_Disease","279416678_Daily_Hassles_and_Social_Support_as_Predictors_of_Adjustment_in_Children_With_Pediatric_Rheumatic_Disease","279393747_A_Review_of_Empirically_Supported_Psychosocial_Interventions_for_Pain_and_Adherence_Outcomes_in_Sickle_Cell_Disease","51377362_Socioeconomic_status_and_length_of_hospital_stay_in_children_with_vaso-occlusive_crises_of_sickle_cell_disease","40760440_The_number_of_people_with_sickle_cell_disease_in_the_United_States_National_and_state_estimates","21378137_Psychiatric_morbidity_among_children_with_sickle-cell_disease","21023536_Effects_of_cigarette_smoking_in_women","20556458_Sickle_Cell_Disease_Pain_Relation_of_Coping_Strategies_to_Adjustment"]}