{"id":"51060273_Household_expansion_linked_to_agricultural_intensification_during_emergence_of_Hawaiian_archaic_states","abstract":"The Leeward Kohala Field System (LKFS) covering ∼ 60 km(2) on Hawai'i Island is one of the world's best-studied archaeological examples of preindustrial agricultural intensification. Archaeological correlates for households over a 400-y period of intensification of the LKFS (A.D. 1400-1800) indicate that household age, number, and distribution closely match the expansion of agricultural features at both macro- and microscales. We excavated and dated residential complexes within portions of five traditional Hawaiian land units (ahupua'a), two in the central core of the field system and three in the southern margins. Forty-eight radiocarbon dates from 43 residential features indicate an overall pattern of exponential increase in the numbers of households over time. Spatial distribution of these dates suggests that the core of the LKFS may have reached a population saturation point earlier than in the southern margins. Bayesian statistical analysis of radiocarbon dates from residential features in the core region, combined with spatial analysis of agricultural and residential construction sequences, demonstrates that the progressive subdivision of territories into smaller socioeconomic units was matched by addition of new residences, probably through a process of household fissioning. These results provide insights into the economic processes underlying the sociopolitical transformation from chiefdom to archaic state in precontact Hawai'i.","authors":["Julie S. Field","Thegn N Ladefoged","Patrick Kirch"],"meta":["May 2011Proceedings of the National Academy of Sciences 108(18):7327-32","DOI:10.1073/pnas.1103805108","SourcePubMed"],"references":["274315300_The_Structure_of_Settlement_Space_in_a_Polynesian_Chiefdom_Kawela_Moloka'i_Hawaiian_Islands","271689654_It's_a_Small_World_after_All_Comparative_Analyses_of_Community_Organization_in_Archaeology","259870328_Dryland_agricultural_expansion_and_intensification_in_Kohala_Hawai'i_Island","351909853_The_Great_Mahele_Hawaii's_Land_Division_of_1848","313658319_Agricultural_intensification_A_Polynesian_perspective","305971172_Bayesian_Analysis_of_Radiocarbon_Dates","298567423_The_Polynesian_Family_System_in_Ka'u_Hawaii","286030922_How_chiefs_became_kings_Divine_kingship_and_the_rise_of_archaic_states_in_ancient_Hawai'i","283363455_Aboriginal_Hawaiian_Structural_Remains_and_Settlement_Patterns_in_the_Upland_Agricultural_Zone_at_Lapakahi_Island_of_Hawaii","270325402_Melanesia_A_Geographical_Interpretation_of_an_Island_World"]}