{"id":"51147445_Simple_line_drawings_suffice_for_functional_MRI_decoding_of_natural_scene_categories","abstract":"Humans are remarkably efficient at categorizing natural scenes. In fact, scene categories can be decoded from functional MRI (fMRI) data throughout the ventral visual cortex, including the primary visual cortex, the parahippocampal place area (PPA), and the retrosplenial cortex (RSC). Here we ask whether, and where, we can still decode scene category if we reduce the scenes to mere lines. We collected fMRI data while participants viewed photographs and line drawings of beaches, city streets, forests, highways, mountains, and offices. Despite the marked difference in scene statistics, we were able to decode scene category from fMRI data for line drawings just as well as from activity for color photographs, in primary visual cortex through PPA and RSC. Even more remarkably, in PPA and RSC, error patterns for decoding from line drawings were very similar to those from color photographs. These data suggest that, in these regions, the information used to distinguish scene category is similar for line drawings and photographs. To determine the relative contributions of local and global structure to the human ability to categorize scenes, we selectively removed long or short contours from the line drawings. In a category-matching task, participants performed significantly worse when long contours were removed than when short contours were removed. We conclude that global scene structure, which is preserved in line drawings, plays an integral part in representing scene categories.","authors":["Dirk B Walther","Barry Chai","Eamon Caddigan","Diane M Beck"],"meta":["June 2011Proceedings of the National Academy of Sciences 108(23):9661-6","DOI:10.1073/pnas.1015666108","SourcePubMed"],"references":["221625273_SUMA_An_interface_for_surface-based_intra-_and_inter-subject_analysis_with_AFNI","26770294_Natural_Scene_Categories_Revealed_in_Distributed_Patterns_of_Activity_in_the_Human_Brain","288033914_The_Parahippocampal_Place_Area_A_Cortical_Representation_of_the_Local_Visual_Environment","285058764_Receptive_fields_binocular_interaction_and_functional_architecture_in_the_cat's_visual_cortex","277684999_A_Standardized_Set_of_260_Pictures_Norms_for_Name_Agreement_Image_Agreement_Familiarity_and_Visual_Complexity","247514428_Why_does_natural_scene_categorization_require_little_attention_Exploring_attentional_requirements_for_natural_and_synthetic_stimuli","245608399_Categorization_of_good_and_bad_examples_of_natural_scene_categories","237128254_Binocular_interaction_and_functional_architecture_in_the_cat''s_visual_cortex_''''J","220660299_Modeling_the_Shape_of_the_Scene_A_Holistic_Representation_of_the_Spatial_Envelope","49673973_Where_Do_Objects_Become_Scenes"]}