{"id":"51156863_Standards_for_Scalable_Clinical_Decision_Support_Need_Current_and_Emerging_Standards_Gaps_and_Proposal_for_Progress","abstract":"Despite their potential to significantly improve health care, advanced clinical decision support (CDS) capabilities are not widely available in the clinical setting. An important reason for this limited availability of CDS capabilities is the application-specific and institution-specific nature of most current CDS implementations. Thus, a critical need for enabling CDS capabilities on a much larger scale is the development and adoption of standards that enable current and emerging CDS resources to be more effectively leveraged across multiple applications and care settings. Standards required for such effective scaling of CDS include (i) standard terminologies and information models to represent and communicate about health care data; (ii) standard approaches to representing clinical knowledge in both human-readable and machine-executable formats; and (iii) standard approaches for leveraging these knowledge resources to provide CDS capabilities across various applications and care settings. A number of standards do exist or are under development to meet these needs. However, many gaps and challenges remain, including the excessive complexity of many standards; the limited availability of easily accessible knowledge resources implemented using standard approaches; and the lack of tooling and other practical resources to enable the efficient adoption of existing standards. Thus, the future development and widespread adoption of current CDS standards will depend critically on the availability of tooling, knowledge bases, and other resources that make the adoption of CDS standards not only the right approach to take, but the cost-effective path to follow given the alternative of using a traditional, ad hoc approach to implementing CDS.","authors":["Kensaku Kawamoto","Guilherme Del Fiol","David F Lobach","Robert A Jenders"],"meta":["December 2010The Open Medical Informatics Journal 4(1):235-44","DOI:10.2174/1874431101004010235","SourcePubMed"],"references":["265199211_Improving_Outcomes_with_Clinical_Decision_Support_An_Implementer's_Guide","258305862_The_Impact_of_Computerized_Physician_Order_Entry_on_Medication_Error_Prevention","286323549_Guidelines_and_Workflow_Models","282104043_Arden_Syntax_for_Medical_Logic_Modules","279425936_Integration_of_Knowledge_Resources_into_Applications_to_Enable_Clinical_Decision_Support_Architectural_Considerations","275590862_Integrating_the_Healthcare_Enterprise_A_Primer","239606276_Logical_Observation_Identifiers_Names_and_Codes_LOINCR_users'_guide","236672137_2007_IMIA_Yearbook_of_Medical_Informatics","225891640_Clinical_Decision_Support","225070340_Unified_medical_language_system_UMLSR","221450522_Open-Source_Publishing_of_Medical_Knowledge_for_Creation_of_Computer-Interpretable_Guidelines","51431713_Biomedical_Ontologies_in_Action_Role_in_Knowledge_Management_Data_Integration_and_Decision_Support","42639782_A_Set_of_Preliminary_Standards_Recommended_for_Achieving_a_National_Repository_of_Clinical_Decision_Support_Interventions","51376472_Expressing_clinical_data_sets_with_openEHR_archetypes_A_solid_basis_for_ubiquitous_computing","32100864_WHOInternational_Classification_of_Diseases_for_Oncology_3rd_edn_ICD-O-3"]}