{"id":"51240302_The_Development_of_Open_Access_Journal_Publishing_from_1993_to_2009","abstract":"Open Access (OA) is a model for publishing scholarly peer reviewed journals, made possible by the Internet. The full text of OA journals and articles can be freely read, as the publishing is funded through means other than subscriptions. Empirical research concerning the quantitative development of OA publishing has so far consisted of scattered individual studies providing brief snapshots, using varying methods and data sources. This study adopts a systematic method for studying the development of OA journals from their beginnings in the early 1990s until 2009. Because no comprehensive index of OA articles exists, systematic manual data collection from journal web sites was conducted based on journal-level data extracted from the Directory of Open Access Journals (DOAJ). Due to the high number of journals registered in the DOAJ, almost 5000 at the time of the study, stratified random sampling was used. A separate sample of verified early pioneer OA journals was also studied. The results show a very rapid growth of OA publishing during the period 1993-2009. During the last year an estimated 191 000 articles were published in 4769 journals. Since the year 2000, the average annual growth rate has been 18% for the number of journals and 30% for the number of articles. This can be contrasted to the reported 3,5% yearly volume increase in journal publishing in general. In 2009 the share of articles in OA journals, of all peer reviewed journal articles, reached 7,7%. Overall, the results document a rapid growth in OA journal publishing over the last fifteen years. Based on the sampling results and qualitative data a division into three distinct periods is suggested: The Pioneering years (1993-1999), the Innovation years (2000-2004), and the Consolidation years (2005-2009).","authors":["Mikael Laakso","Patrik Welling","Helena Lovasz-Bukvova","Linus Nyman"],"meta":["June 2011PLoS ONE 6(6):e20961","DOI:10.1371/journal.pone.0020961","SourcePubMed"],"references":["276596421_The_growth_and_number_of_journals","276396085_A_Survey_of_the_Scholarly_Journals_Using_Open_Journal_Systems","319725751_Sampling_Algorithms","315508331_A_Survey_of_Scholarly_Journals_Using_Open_Journal_Systems","296968475_What_if_libraries_are_artifact-bound_institutions","296186864_Free_electronic_refereed_journals_3","283941602_Constrained_An_Analysis_of_US_Academic_Library_Shifts_in_Spending_Staffing_and_Utilization_1998-2008","279644563_The_Use_of_Institutional_Repositories_The_Ohio_State_University_Experience","277071224_Distinctive_Signifiers_of_Excellence_Library_Services_and_the_Future_of_the_Academic_Library","274164493_When_is_a_journal_not_a_journal_A_closer_look_at_the_DOAJ"]}