{"id":"51541331_Automatic_Classification_of_Artifactual_ICA-Components_for_Artifact_Removal_in_EEG_Signals","abstract":"Background: \nArtifacts contained in EEG recordings hamper both, the visual interpretation by experts as well as the algorithmic processing and analysis (e.g. for Brain-Computer Interfaces (BCI) or for Mental State Monitoring). While hand-optimized selection of source components derived from Independent Component Analysis (ICA) to clean EEG data is widespread, the field could greatly profit from automated solutions based on Machine Learning methods. Existing ICA-based removal strategies depend on explicit recordings of an individual's artifacts or have not been shown to reliably identify muscle artifacts.\n\nMethods: \nWe propose an automatic method for the classification of general artifactual source components. They are estimated by TDSEP, an ICA method that takes temporal correlations into account. The linear classifier is based on an optimized feature subset determined by a Linear Programming Machine (LPM). The subset is composed of features from the frequency-, the spatial- and temporal domain. A subject independent classifier was trained on 640 TDSEP components (reaction time (RT) study, n = 12) that were hand labeled by experts as artifactual or brain sources and tested on 1080 new components of RT data of the same study. Generalization was tested on new data from two studies (auditory Event Related Potential (ERP) paradigm, n = 18; motor imagery BCI paradigm, n = 80) that used data with different channel setups and from new subjects.\n\nResults: \nBased on six features only, the optimized linear classifier performed on level with the inter-expert disagreement (<10% Mean Squared Error (MSE)) on the RT data. On data of the auditory ERP study, the same pre-calculated classifier generalized well and achieved 15% MSE. On data of the motor imagery paradigm, we demonstrate that the discriminant information used for BCI is preserved when removing up to 60% of the most artifactual source components.\n\nConclusions: \nWe propose a universal and efficient classifier of ICA components for the subject independent removal of artifacts from EEG data. Based on linear methods, it is applicable for different electrode placements and supports the introspection of results. Trained on expert ratings of large data sets, it is not restricted to the detection of eye- and muscle artifacts. Its performance and generalization ability is demonstrated on data of different EEG studies.","authors":["Irene Dowding","Stefan Haufe","Michael Tangermann"],"meta":["August 2011Behavioral and Brain Functions 7(1):30","DOI:10.1186/1744-9081-7-30","SourcePubMed"],"references":["240763957_Robustifying_EEG_data_analysis_by_removing_outliers","228847761_Blind_source_separation_and_independent_component_analysis_A_review","228561262_T-entropy_of_EEGEOG_sensitive_to_sleep_state","225992971_Brain-Computer_Interfacing_and_Games","221618923_Invariant_Common_Spatial_Patterns_Alleviating_Nonstationarities_in_Brain-Computer_Interfacing","228715647_LIBSVM_A_library_for_support_vector_machines","227550226_Removing_electroencephalographic_artifacts_by_blind_source_separation","223679130_Product_Differentiation_by_Analysis_of_DNA_Melting_Curves_during_the_Polymerase_Chain_Reaction","223561852_Some_periodic_phenomena_arising_during_drowsiness_and_sleep_in_man","222430466_A_Well-Conditioned_Estimator_For_Large_Dimensional_Covariance_Matrices","220049389_Online_artifact_removal_for_brain-computer_interfaces_using_support_vector_machines_and_blind_source_separation_Comput_Intell_Neurosci","216212540_Interpreting_measured_magnetic_fields_of_the_brain_Estimates_of_current_distributions","210296431_Prenatal_development_of_the_visual_system_in_rhesus_monkey248","203917760_Optimizing_spatial_filters_for_robust_EEG_single-trial_analysis","202065953_Single-trial_analysis_and_classification_of_ERP_components_-_A_tutorial"]}