{"id":"51622531_Effect_of_stimulus_spectrum_on_distance_perception_for_nearby_sources","abstract":"The effects of stimulus frequency and bandwidth on distance perception were examined for nearby sources in simulated reverberant space. Sources to the side [containing reverberation-related cues and interaural level difference (ILD) cues] and to the front (without ILDs) were simulated. Listeners judged the distance of noise bursts presented at a randomly roving level from simulated distances ranging from 0.15 to 1.7 m. Six stimuli were tested, varying in center frequency (300-5700 Hz) and bandwidth (200-5400 Hz). Performance, measured as the correlation between simulated and response distances, was worse for frontal than for lateral sources. For both simulated directions, performance was inversely proportional to the low-frequency stimulus cutoff, independent of stimulus bandwidth. The dependence of performance on frequency was stronger for frontal sources. These correlation results were well summarized by considering how mean response, as opposed to response variance, changed with stimulus direction and spectrum: (1) little bias was observed for lateral sources, but listeners consistently overestimated distance for frontal nearby sources; (2) for both directions, increasing the low-frequency cut-off reduced the range of responses. These results are consistent with the hypothesis that listeners used a direction-independent but frequency-dependent mapping of a reverberation-related cue, not the ILD cue, to judge source distance.","authors":["Norbert Kopco","Barbara Shinn-Cunningham"],"meta":["September 2011The Journal of the Acoustical Society of America 130(3):1530-41","DOI:10.1121/1.3613705","SourcePubMed"],"references":["266039885_Distance_perception_of_nearby_sources_in_reverberant_and_anechoic_listening_conditions_Binaural_vs_monaural_cues","247945267_The_Physical_and_Psychophysical_Basis_of_Sound_Localization","238983664_Spatial_Hearing","229068125_Auditory_distance_perception_in_humans_A_summary_of_past_and_present_research","51420748_On_the_minimum_audible_difference_in_direct-to-reverberant_energy_ratio","246712050_Localization_of_near-field_sources_in_a_reverberant_room","243774858_Virtual_Auditory_Space_Generation_and_Applications","229467203_Large_sample_and_other_comparisons_among_means","225670172_Intensity_and_reverberation_as_factors_in_the_auditory_perception_of_egocentric_distance","200045292_New_Method_of_Measuring_Reverberation_Time"]}