{"id":"51631420_Spelling_with_non-invasive_Brain-Computer_Interfaces_-_Current_and_future_trends","abstract":"Brain-Computer Interfaces (BCIs) have become a large research field that include challenges mainly in neuroscience, signal processing, machine learning and user interface. A non-invasive BCI can allow the direct communication between humans and computers by analyzing electrical brain activity, recorded at the surface of the scalp with electroencephalography. The main purpose for BCIs is to enable communication for people with severe disabilities. Spelling is one of the first BCI application, it corresponds to the main communication mean for people who are unable to speak. While spelling can be the most basic application it remains a benchmark for communication applications and one challenge in the BCI community for some patients. This paper proposes a review of the current main strategies, and their limitations, for spelling words. It includes recent BCIs based on P300, steady-state visual evoked potentials and motor imagery. By considering some challenges in BCI spellers and virtual keyboards, some pragmatic issues are pointed out to eliminate false hopes about BCI for both disabled and healthy people.","authors":["Hubert Cecotti"],"meta":["September 2011Journal of Physiology-Paris 105(1-3):106-14","DOI:10.1016/j.jphysparis.2011.08.003","SourcePubMed"],"references":["272563142_Spelling_with_the_Bremen_Brain-computer_Interface_and_the_Integrated_SSVEP_Stimulator","254860596_User_Experience_Evaluation_in_BCI_Bridge_the_Gap","228510937_GeoSpell_an_alternative_P300_based_speller_interface_towards_no_eye_gaze_required","228503423_Optimized_stimulation_events_for_a_visual_ERP_BCI","224580443_Evaluation_of_the_Bremen_SSVEP_based_BCI_in_real_world_conditions","224529480_Evaluation_of_an_SSVEP_based_Brain-Computer_Interface_on_the_command_and_application_levels","324984037_Rhythmic_brain_activity_and_brain_computer_interface_based_on_motor_imagery","265938677_Gaze-independent_visual_brain-computer_interfaces","247933195_A_P300Based_Brain-Computer_Interface_Effects_of_Interface_Type_and_Screen_Size","228570054_Optimized_Stimulation_Events_for_a_Visual_ERP_BCI"]}