{"id":"51696100_Active_tactile_exploration_using_a_brain-machine-brain_interface","abstract":"Brain-machine interfaces use neuronal activity recorded from the brain to establish direct communication with external actuators, such as prosthetic arms. It is hoped that brain-machine interfaces can be used to restore the normal sensorimotor functions of the limbs, but so far they have lacked tactile sensation. Here we report the operation of a brain-machine-brain interface (BMBI) that both controls the exploratory reaching movements of an actuator and allows signalling of artificial tactile feedback through intracortical microstimulation (ICMS) of the primary somatosensory cortex. Monkeys performed an active exploration task in which an actuator (a computer cursor or a virtual-reality arm) was moved using a BMBI that derived motor commands from neuronal ensemble activity recorded in the primary motor cortex. ICMS feedback occurred whenever the actuator touched virtual objects. Temporal patterns of ICMS encoded the artificial tactile properties of each object. Neuronal recordings and ICMS epochs were temporally multiplexed to avoid interference. Two monkeys operated this BMBI to search for and distinguish one of three visually identical objects, using the virtual-reality arm to identify the unique artificial texture associated with each. These results suggest that clinical motor neuroprostheses might benefit from the addition of ICMS feedback to generate artificial somatic perceptions associated with mechanical, robotic or even virtual prostheses.","authors":["Joseph E. O'Doherty","Mikhail A Lebedev","Peter J Ifft","Katie Zhuang"],"meta":["November 2011Nature 479(7372):228-31","DOI:10.1038/nature10489","SourcePubMed"],"references":["281203520_Principles_of_neural_ensemble_physiology_underlying_the_operation_of_brain--machine_interfaces","226424015_Modulation_of_grip_force_with_load_force_during_point-to-point_arm_movements","51329603_Somatosensory_discrimination_based_on_cortical_microstimulation","26808275_A_Brain-Machine_Interface_Instructed_by_Direct_Intracortical_Microstimulation","26671654_Unscented_Kalman_Filter_for_Brain-Machine_Interfaces","24280548_Sensory_capacity_of_reinnervated_skin_after_redirection_of_amputated_upper_limb_nerves_to_the_chest","284678824_Learning_to_control_a_brain-machine_interface_for_reaching_and_grasping_by_primates","220048993_Cortical_control_of_a_prosthetic_arm_for_self-feeding","203918065_Brain-Machine_Interfaces_Past_Present_and_Future","41027284_Neurons_in_Primary_Motor_Cortex_Engaged_During_Action_Observation"]}