{"id":"51860563_Realist_methods_in_medical_education_research_What_are_they_and_what_can_they_contribute","abstract":"Education is a complex intervention which produces different outcomes in different circumstances. Education researchers have long recognised the need to supplement experimental studies of efficacy with a broader range of study designs that will help to unpack the 'how' and 'why' questions and illuminate the many, varied and interdependent mechanisms by which interventions may work (or fail to work) in different contexts.\nOne promising approach is realist evaluation, which seeks to establish what works, for whom, in what circumstances, in what respects, to what extent, and why. This paper introduces the realist approach and explains why it is particularly suited to education research. It gives a brief introduction to the philosophical assumptions underlying realist methods and outlines key principles of realist evaluation (designed for empirical studies) and realist review (the application of realist methods to secondary research).\nThe paper warns that realist approaches are not a panacea and lists the circumstances in which they are likely to be particularly useful.","authors":["Geoff Wong","Trisha Greenhalgh","Gill Westhorp","Ray Pawson"],"meta":["January 2012Medical Education 46(1):89-96","DOI:10.1111/j.1365-2923.2011.04045.x","SourcePubMed"],"references":["278147549_Making_the_neurology_clerkship_more_effective_can_e-Textbook_facilitate_learning","287651935_Development_of_an_instrument_to_measure_perceptions_of_adoption_of_an_information_technology_innovations","286385385_The_Internet_in_Medical_Education_A_Worked_Example_of_a_Realist_Review","274799723_Diffusion_of_Innovations","267922562_The_Diffusion_of_Innovations","266731427_Realistic_Evaluation","258260743_Realistic_Evaluation","254075338_Unpacking_Black_Boxes_Mechanisms_and_Theory_Building_in_Evaluation","247675088_A_Framework_for_Development_and_Evaluation_of_RCT's_for_Complex_Interventions_to_Improve_Health","238659520_Evidence-based_Policy_The_Promise_of_Realist_Synthesis'"]}