{"id":"51873391_Wearable_and_Implantable_Wireless_Sensor_Network_Solutions_for_Healthcare_Monitoring","abstract":"Wireless sensor network (WSN) technologies are considered one of the key research areas in computer science and the healthcare application industries for improving the quality of life. The purpose of this paper is to provide a snapshot of current developments and future direction of research on wearable and implantable body area network systems for continuous monitoring of patients. This paper explains the important role of body sensor networks in medicine to minimize the need for caregivers and help the chronically ill and elderly people live an independent life, besides providing people with quality care. The paper provides several examples of state of the art technology together with the design considerations like unobtrusiveness, scalability, energy efficiency, security and also provides a comprehensive analysis of the various benefits and drawbacks of these systems. Although offering significant benefits, the field of wearable and implantable body sensor networks still faces major challenges and open research problems which are investigated and covered, along with some proposed solutions, in this paper.","authors":["Ashraf Darwish","Aboul Ella Hassanien"],"meta":["December 2011Sensors 11(6):5561-95","DOI:10.3390/s110605561","SourcePubMed"],"references":["270819309_A_wireless_body_area_network_of_intelligent_motion_sensors_for_computer_assisted_physical_rehabilitation","264869195_Physical_Context_Detection_using_Wearable_Wireless_Sensor_Networks","262405946_Wireless_Sensor_Networks_for_Home_Health_Care","294529516_Smart_clothes_self-powered_by_body_heat","285807998_Physical_context_detection_using_multi-modal_sensing_with_wearable_wireless_networks","270545552_Medical_Instrumentation-Application_and_Design","269034336_Directed_Diffusion","247089903_Overview_of_S_ensor_Networks","243776699_Monitoring_behavior_in_home_using_a_smart_fall_sensor","242577686_Mobicom_challenges_mobile_networking_for_'smart_dust"]}