{"id":"51910399_Phase_Selection_Heuristics_for_Satisfiability_Solvers","abstract":"In general, a SAT Solver based on conflict-driven DPLL consists of variable\nselection, phase selection, Boolean Constraint Propagation, conflict analysis,\nclause learning and its database maintenance. Optimizing any part of these\ncomponents can enhance the performance of a solver. This paper focuses on\noptimizing phase selection. Although the ACE (Approximation of the Combined\nlookahead Evaluation) weight is applied to a lookahead SAT solver such as\nMarch, so far, no conflict-driven SAT solver applies successfully the ACE\nweight, since computing the ACE weight is time-consuming. Here we apply the ACE\nweight to partial phase selection of conflict-driven SAT solvers. This can be\nseen as an improvement of the heuristic proposed by Jeroslow-Wang (1990). We\nincorporate the ACE heuristic and the existing phase selection heuristics in\nthe new solver MPhaseSAT, and select a phase heuristic in a way similar to\nportfolio methods. Experimental results show that adding the ACE heuristic can\nimprove the conflict-driven solvers. Particularly on application instances,\nMPhaseSAT with the ACE heuristic is significantly better than MPhaseSAT without\nthe ACE heuristic, and even can solve a few SAT instances that remain\nunsolvable so far.","authors":["Jingchao Chen"],"meta":["June 2011","SourcearXiv"],"references":["234803598_SATzilla-07_the_design_and_analysis_of_an_algorithm_portfolio_for_SAT","228736535_Rsat_20_Sat_solver_description","228566949_SATzilla2009_An_automatic_algorithm_portfolio_for_SAT","220944633_A_Lightweight_Component_Caching_Scheme_for_Satisfiability_Solvers","220944584_Minimizing_Learned_Clauses","220944343_On-the-Fly_Clause_Improvement","47685417_SATzilla_Portfolio-based_Algorithm_Selection_for_SAT","268378466_A_New_SAT_Encoding_of_the_At-Most-One_Constraint","221607107_Latent_Class_Models_for_Algorithm_Portfolio_Methods","220944554_Building_a_Hybrid_SAT_Solver_via_Conflict-Driven_Look-Ahead_and_XOR_Reasoning_Techniques","220812877_Predicting_Learnt_Clauses_Quality_in_Modern_SAT_Solvers","220642599_Solving_Propositional_Satisfiability_Problems"]}