{"id":"51988532_No_Entailing_Laws_but_Enablement_in_the_Evolution_of_the_Biosphere","abstract":"Biological evolution is a complex blend of ever changing structural\nstability, variability and emergence of new phenotypes, niches, ecosystems. We\nwish to argue that the evolution of life marks the end of a physics world view\nof law entailed dynamics. Our considerations depend upon discussing the\nvariability of the very \"contexts of life\": the interactions between organisms,\nbiological niches and ecosystems. These are ever changing, intrinsically\nindeterminate and even unprestatable: we do not know ahead of time the \"niches\"\nwhich constitute the boundary conditions on selection. More generally, by the\nmathematical unprestatability of the \"phase space\" (space of possibilities), no\nlaws of motion can be formulated for evolution. We call this radical emergence,\nfrom life to life. The purpose of this paper is the integration of variation\nand diversity in a sound conceptual frame and situate unpredictability at a\nnovel theoretical level, that of the very phase space. Our argument will be\ncarried on in close comparisons with physics and the mathematical constructions\nof phase spaces in that discipline. The role of (theoretical) symmetries as\ninvariant preserving transformations will allow us to understand the nature of\nphysical phase spaces and to stress the differences required for a sound\nbiological theoretizing. In this frame, we discuss the novel notion of\n\"enablement\". This will restrict causal analyses to differential cases (a\ndifference that causes a difference). Mutations or other causal differences\nwill allow us to stress that \"non conservation principles\" are at the core of\nevolution, in contrast to physical dynamics, largely based on conservation\nprinciples as symmetries. Critical transitions, the main locus of symmetry\nchanges in physics, will be discussed, and lead to \"extended criticality\" as a\nconceptual frame for a better understanding of the living state of matter.","authors":["Giuseppe Longo","Maël Montévil","Stuart A. Kauffman"],"meta":["January 2012","DOI:10.1145/2330784.2330946","SourcearXiv","Conference: GECCO Proceedings 2012"],"references":["262486696_Mathematics_and_the_natural_sciences_The_Physical_Singularity_of_Life","247697811_Extended_critical_situations_The_physical_singularity_of_life_phenomena","269006967_Phase_Transitions_and_Renormalization_Group","268021088_Statistical_Mechanics_Entropy_Order_Parameters_and_Complexity","262487177_The_Society_of_Cells_Cancer_and_Control_of_Cell_Proliferation","262487162_The_Return_of_Hopeful_Monsters","262487079_Niveaux_d'organisation_changements_de_niveaux_finalite","258319825_Symmetry_Breaking","235410361_Statistical_Mechanics_Entropy_Order_Parameters_and_Complexity","233934886_Phase_Transitions_and_Renormalisation_Group"]}