{"id":"5238538_Simulation_of_single-species_bacterial-biofilm_growth_using_the_Glazier-Graner-Hogeweg_model_and_the_CompuCell3D_modeling_environment","abstract":"The CompuCell3D modeling environment provides a convenient platform for biofilm simulations using the Glazier-Graner-Hogeweg (GGH) model, a cell-oriented framework designed to simulate growth and pattern formation due to biological cells' behaviors. We show how to develop such a simulation, based on the hybrid (continuum-discrete) model of Picioreanu, van Loosdrecht, and Heijnen (PLH), simulate the growth of a single-species bacterial biofilm, and study the roles of cell-cell and cell-field interactions in determining biofilm morphology. In our simulations, which generalize the PLH model by treating cells as spatially extended, deformable bodies, differential adhesion between cells, and their competition for a substrate (nutrient), suffice to produce a fingering instability that generates the finger shapes of biofilms. Our results agree with most features of the PLH model, although our inclusion of cell adhesion, which is difficult to implement using other modeling approaches, results in slightly different patterns. Our simulations thus provide the groundwork for simulations of medically and industrially important multispecies biofilms.","authors":["Nikodem J Popławski","Abbas Shirinifard","Maciej Swat","James Alexander Glazier"],"meta":["May 2008Mathematical biosciences and engineering: MBE 5(2):355-88","DOI:10.3934/mbe.2008.5.355","SourcePubMed"],"references":["253418363_Cellular_pattern_formation","237195969_Embryonic_tissues_are_viscoelastic_materials","237044502_Simulation_of_the_Differential_Adhesion_driven_Rearrangement_of_Biological_Cells","282779866_The_Biofilm_Lifestyle_of_Pseudomonads","275510403_Microbial_Biofilms","257296949_Stochastic_simulation_of_benign_avascular_tumor_growth_using_the_Potts_model","247338599_Can_Surface_Adhesion_Drive_Cell-rearrangement_Part_I_Biological_Cell-sorting","245997214_Effects_of_Lattice_Anisotropy_and_Temperature_on_Domain_Growth_in_the_2-Dimensional_Potts-Model","235922882_Modeling_Biofilm_Processes_Using_the_Immersed_Boundary_Method","235227291_Reconstruction_of_Tissues_by_Dissociated_Cells"]}