{"id":"5238250_Changing_Educational_Inequalities_in_India_in_the_Context_of_Affirmative_Action","abstract":"Indian society suffers from substantial inequalities in education, employment, and income based on caste and ethnicity. Compensatory or positive discrimination policies reserve 15% of the seats in institutions of higher education and state and central government jobs for people of the lowest caste, the Scheduled Caste; 7.5% of the seats are reserved for the Scheduled Tribe. These programs have been strengthened by improved enforcement and increased funding in the 1990s. This positive discrimination has also generated popular backlash and on-the-ground sabotage of the programs. This paper examines the changes in educational attainment between various social groups for a period of nearly 20 years to see whether educational inequalities have declined over time. We use data from a large national sample survey of over 100,000 households for each of the four survey years--1983, 1987-1988, 1993-1994, and 1999-2000--and focus on the educational attainment of children and young adults aged 6-29. Our results show a declining gap between dalits, adivasis, and others in the odds of completing primary school. Such improvement is not seen for Muslims, a minority group that does not benefit from affirmative action. We find little improvement in inequality at the college level. Further, we do not find evidence that upper-income groups, the so-called creamy layer of dalits and adivasis, disproportionately benefit from the affirmative action programs at the expense of their lower-income counterparts.","authors":["Sonalde Desai","Veena Kulkarni"],"meta":["June 2008Demography 45(2):245-70","DOI:10.1353/dem.0.0001","SourcePubMed"],"references":["345908473_Caste_Society_and_Politics_in_India_from_the_Eighteenth_Century_to_the_Modern_Age","344487017_The_Untouchables_Subordination_Poverty_and_the_State_in_Modern_India","293119385_Affirmative_action_around_the_world_An_empirical_study","290608747_Affirmative_action_Perspectives_from_the_United_States_India_and_Brazil","290257914_Schooling_in_Capitalist_America_Educational_Reform_and_the_Contradictions_of_Economic_Life","284520329_Schooling_in_Capitalist_America_Educational_Reform_and_the_Contradictions_of_Economic_Life","275842507_Legacy_of_a_Divided_Nation_India's_Muslims_since_Independence","274490481_The_Untouchables_Subordination_Poverty_and_the_State_in_Modern_India","273361663_Castes_Old_and_New_Essays_in_Social_Structure_and_Social_Stratification","272561771_Preferential_Policies_and_Secondary_School_Attainment_in_Peninsular_Malaysia"]}