{"id":"5283266_A_study_of_computer-related_upper_limb_discomfort_and_computer_vision_syndrome","abstract":"Personal computers are one of the commonest office tools in Malaysia today. Their usage, even for three hours per day, leads to a health risk of developing Occupational Overuse Syndrome (OOS), Computer Vision Syndrome (CVS), low back pain, tension headaches and psychosocial stress. The study was conducted to investigate how a multiethnic society in Malaysia is coping with these problems that are increasing at a phenomenal rate in the west. This study investigated computer usage, awareness of ergonomic modifications of computer furniture and peripherals, symptoms of CVS and risk of developing OOS. A cross-sectional questionnaire study of 136 computer users was conducted on a sample population of university students and office staff. A 'Modified Rapid Upper Limb Assessment (RULA) for office work' technique was used for evaluation of OOS. The prevalence of CVS was surveyed incorporating a 10-point scoring system for each of its various symptoms. It was found that many were using standard keyboard and mouse without any ergonomic modifications. Around 50% of those with some low back pain did not have an adjustable backrest. Many users had higher RULA scores of the wrist and neck suggesting increased risk of developing OOS, which needed further intervention. Many (64%) were using refractive corrections and still had high scores of CVS commonly including eye fatigue, headache and burning sensation. The increase of CVS scores (suggesting more subjective symptoms) correlated with increase in computer usage spells. It was concluded that further onsite studies are needed, to follow up this survey to decrease the risks of developing CVS and OOS amongst young computer users.","authors":["A Sen","Stanley Richardson"],"meta":["January 2008Journal of Human Ergology 36(2):45-50","DOI:10.11183/jhe1972.36.2_45","SourcePubMed"],"references":["242457225_A_Proposed_RULA_for_Computer_Users","233551672_The_effects_of_ergonomic_training_and_preventive_physiotherapy_in_musculo-skeletal_pain","228902626_Potential_health_problems_faced_by_an_Asian_youth_population_with_increasing_trends_for_computer_use","13853506_Postural_load_during_VDU_work_A_comparison_between_various_work_postures","12875770_Wrist_and_forearm_postures_and_motion_during_typing","267227869_Some_controversies_relating_to_the_causes_and_preventive_management_of_Computer_Vision_Syndrome","223349995_Prevalence_of_upper_extremity_musculoskeletal_symptoms_and_ergonomic_risk_factors_at_a_Hi-Tech_company_in_Israel","222849655_Computer_workstation_adjustment_A_novel_process_and_large_sample_study","222391752_Male_managers_under_stress_in_Singapore","18115379_The_Muller-Lyer_Illusion_A_Cross-Cultural_Study_in_Singapore","15705185_Is_there_a_typical_VDT_patient_A_demographic_analysis","15242258_Musculoskeletal_problems_in_VDT_work_A_review","12275436_Ergonomic_intervention_Its_effect_on_working_posture_and_musculoskeletal_symptoms_in_female_biomedical_scientists","8055010_RULA_A_Survey_Method_for_the_Investigation_of_Work-Related_Upper_Limb_Disorders"]}