{"id":"5435466_Conducting_a_Meta-Ethnography_of_Qualitative_Literature_Lessons_Learned","abstract":"Qualitative synthesis has become more commonplace in recent years. Meta-ethnography is one of several methods for synthesising qualitative research and is being used increasingly within health care research. However, many aspects of the steps in the process remain ill-defined.\nWe utilized the seven stages of the synthesis process to synthesise qualitative research on adherence to tuberculosis treatment. In this paper we discuss the methodological and practical challenges faced; of particular note are the methods used in our synthesis, the additional steps that we found useful in clarifying the process, and the key methodological challenges encountered in implementing the meta-ethnographic approach. The challenges included shaping an appropriate question for the synthesis; identifying relevant studies; assessing the quality of the studies; and synthesising findings across a very large number of primary studies from different contexts and research traditions. We offer suggestions that may assist in undertaking meta-ethnographies in the future.\nMeta-ethnography is a useful method for synthesising qualitative research and for developing models that interpret findings across multiple studies. Despite its growing use in health research, further research is needed to address the wide range of methodological and epistemological questions raised by the approach.","authors":["Salla Atkins","Simon Lewin","Helen J Smith","Mark E Engel"],"meta":["February 2008BMC Medical Research Methodology 8(1):21","DOI:10.1186/1471-2288-8-21","SourcePubMed"],"references":["277255779_Cochrane_or_Cock-eyed_How_Should_We_Conduct_Systematic_Reviews_of_Qualitative_Research","268397450_Reading_Qualitative_Studies","249763686_Integrative_Approaches_to_Qualitative_and_Quantitative_Evidence","232269428_Assessing_quality_in_qualitative_research","285739465_Qualitative_Methods_for_Health_Research","277815539_Collected_papers_II","272966365_The_problem_of_appraising_qualitative_research","247308379_Quality_in_Qualitative_Evaluation_A_Framework_For_Assessing_Research_Evidence","240252130_Meta-Ethnography_Synthesizing_Qualitative_Studies","228779917_Qualitative_Analysis_on_Stage_Making_the_Research_Process_More_Public"]}