{"id":"5565191_Empirical_comparison_of_ab_initio_repeat_finding_programs","abstract":"Identification of dispersed repetitive elements can be difficult, especially when elements share little or no homology with\npreviously described repeats. Consequently, a growing number of computational tools have been designed to identify repetitive\nelements in an ab initio manner, i.e. without using prior sequence data. Here we present the results of side-by-side evaluations of six of the most\nwidely used ab initio repeat finding programs. Using sequence from rice chromosome 12, tools were compared with regard to time requirements, ability to find known repeats, utility in identifying potential novel\nrepeats, number and types of repeat elements recognized and compactness of family descriptions. The study reveals profound\ndifferences in the utility of the tools with some identifying virtually their entire substrate as repetitive, others making\nreasonable estimates of repetition, and some missing almost all repeats. Of note, even when tools recognized similar numbers\nof repeats they often showed marked differences in the nature and number of repeat families identified. Within the context\nof this comparative study, ReAS and RepeatScout showed the most promise in analysis of sequence reads and assembled genomic\nregions, respectively. Our results should help biologists identify the program(s), if any, that is best suited for their needs.","authors":["Surya Saha","Susan Bridges","Zenaida Magbanua","Daniel G Peterson"],"meta":["May 2008Nucleic Acids Research 36(7):2284-94","DOI:10.1093/nar/gkn064","SourcePubMed"],"references":["248393670_The_map-based_sequence_of_rice_genome","233810747_Reply_A_universal_classification_of_eukaryotic_transposable_elements_implemented_in_Repbase","227108581_Computational_Approaches_and_Tools_Used_in_Identification_of_Dispersed_Repetitive_DNA_Sequences","30932350_ProDom_Automated_clustering_of_homologous_domains","284485252_The_genome_sequence_of_Caenorhabditis_briggsae_A_platform_for_comparative_genomics","273558587_The_repetitive_landscape_of_the_chicken_genome","252658676_Repeated_sequences_in_DNA","229067729_Types_of_viable_variations_induced_by_X-rays_in_Drosophila","226331397_Epigenetic_repeat-induced_gene_silencing_RIGS_in_Arabidopsis","225549251_Types_of_visible_variations_induced_by_X-rays_inDrosophila"]}