{"id":"5576304_Antiextensive_connected_operators_for_image_and_sequence_processing","abstract":"This paper deals with a class of morphological operators called connected operators. These operators filter the signal by merging its flat zones. As a result, they do not create any new contours and are very attractive for filtering tasks where the contour information has to be preserved. This paper shows that connected operators work implicitly on a structured representation of the image made of flat zones. The max-tree is proposed as a suitable and efficient structure to deal with the processing steps involved in antiextensive connected operators. A formal definition of the various processing steps involved in the operator is proposed and, as a result, several lines of generalization are developed. First, the notion of connectivity and its definition are analyzed. Several modifications of the traditional approach are presented. They lead to connected operators that are able to deal with texture. They also allow the definition of connected operators with less leakage than the classical ones. Second, a set of simplification criteria are proposed and discussed. They lead to simplicity-, entropy-, and motion-oriented operators. The problem of using a nonincreasing criterion is analyzed. Its solution is formulated as an optimization problem that can be very efficiently solved by a Viterbi algorithm. Finally, several implementation issues are discussed showing that these operators can be very efficiently implemented.","authors":["Philippe Salembier","Albert Oliveras","Luis Garrido"],"meta":["February 1998IEEE Transactions on Image Processing 7(4):555-70","DOI:10.1109/83.663500","SourcePubMed"],"references":["238808165_Morphological_segmentation","286787870_Toggle_mappings","266917334_Region_Adjacency_Graphs_and_Connected_Morphological_Operators","266332599_Practical_Extensions_of_Connected_Operators","260897016_Generalized_connected_operators","259021707_New_measure_of_contrast_the_dynamics","245309751_An_Attribute-Based_Approach_to_Mathematical_Morphology","240254220_Space_Connectivity_and_Translation-Invariance","234962608_SPIE's_1993_International_Symposium_on_Optics_Imaging_and_Instrumentation","234944913_San_Diego_'92"]}