{"id":"5606734_Face_Recognition_by_Independent_Component_Analysis","abstract":"A number of current face recognition algorithms use face representations found by unsupervised statistical methods. Typically these methods find a set of basis images and represent faces as a linear combination of those images. Principal component analysis (PCA) is a popular example of such methods. The basis images found by PCA depend only on pairwise relationships between pixels in the image database. In a task such as face recognition, in which important information may be contained in the high-order relationships among pixels, it seems reasonable to expect that better basis images may be found by methods sensitive to these high-order statistics. Independent component analysis (ICA), a generalization of PCA, is one such method. We used a version of ICA derived from the principle of optimal information transfer through sigmoidal neurons. ICA was performed on face images in the FERET database under two different architectures, one which treated the images as random variables and the pixels as outcomes, and a second which treated the pixels as random variables and the images as outcomes. The first architecture found spatially local basis images for the faces. The second architecture produced a factorial face code. Both ICA representations were superior to representations based on PCA for recognizing faces across days and changes in expression. A classifier that combined the two ICA representations gave the best performance.","authors":["Marian Stewart Bartlett","Javier R. Movellan","Terrence J. Sejnowski"],"meta":["February 2002IEEE Transactions on Neural Networks 13(6):1450-64","DOI:10.1109/TNN.2002.804287","SourcePubMed"],"references":["260636398_Blind_Source_Separation_of_More_Sources_Than_Mixtures_Using_Overcomplete_Representations","321600731_Advances_in_Independent_Component_Analysis","316268171_Independent_Component_Analysis","298186012_Advances_of_research_in_Independent_Component_Analysis","288233066_Analysis_of_fMRI_data_by_decomposition_into_independent_components","284573451_Normalization_of_cell_responses_in_cat_striate_cortex","282103354_Independent_component_analysis_using_an_extended_Infomax_algorithm_for_mixed_subGaussian_and_superGaussian_sources","266439507_Advances_in_independent_component_analysis","263499383_The_''Independent_Components''_of_Natural_Scenes_are_Edge_Filters","262233668_Unsupervised_Learning"]}