{"id":"5616247_Outcome-Based_Education_the_future_is_today","abstract":"Medical education, perhaps more than at any other time, faces pressures for change in response to the rapid developments in medical and health care delivery, advances in information technology, globalisation influencing medicine and education, changing political and public expectations, demands from within the profession and developments in how we look at teaching and learning. The greatest catalyst for change, it has been argued, is a language that will allow us to discuss what we are expecting students to learn and how we should assess this (Jessup 1995). This themed issue of Medical Teacher illustrates how learning outcomes can provide this necessary language. Jessup’s essential thesis in relation to outcome-based education (OBE) is ‘‘if education or training is defined by outcomes, it opens access to learning and assessment in ways which are not possible in traditional syllabus or programme based systems. Once learning is targeted on outcomes, the other features of the model follow as a natural consequence. Many of the problems we face in education and training could be solved by this model.’’ (Jessup 1991). Traditionally courses in medicine as in other disciplines were defined in terms of their duration – a four year course, a week module or rotation – and in terms of their syllabus with specification of content and the teaching provided in the form of lectures, practical classes etc. Clear statements as to what students were expected to learn was not on the agenda. It was almost as if we expected students to join us in some sort of magical mystery tour with an assessment at the end. As Rowntree (1982) noted: ‘‘to set the student off in pursuit of an unnamed quarry may be merely wasteful, but to punish him for failing to catch it is positively mischievous. Do we sometimes appear to say to the student: ‘I can’t say precisely what skills or knowledge I want you to acquire from this course. Just do your own thing (guessing what might come into my mind) and I’ll give you a grade according to how I feel about it’’’? This has all changed however, with the move to an OBE model. In medicine the process of exploring learning outcomes has been illuminating and has uncovered what in the past has remained mainly hidden. It has made us question the validity of much of what we teach and how we teach it. Course descriptions, for the most part, have made no reference to decision making, self assessment and other personal skills – all essential attributes for a doctor. In OBE it is specified what students are expected to learn and the course of study is arranged so that they achieve this. It is a message difficult to disagree with. This themed issue of Medical Teacher recognizes that a significant change has taken place in medical education with","authors":["Ronald M Harden"],"meta":["October 2007Medical Teacher 29(7):625-9","DOI:10.1080/01421590701729930","SourcePubMed"],"references":["319394522_Taxonomy_of_Educational_Objectives_The_Classification_Of_Educational_Goals_Handbook_I","316045654_Outcome-based_education_Developing_programs_through_strategic_planning","285661374_AMEE_Guide_No_14_Outcome-based_education_Part_5_-_From_competency_to_meta-competency_A_model_for_the_specification_of_learning_outcomes","270372776_Educational_Technology_in_Curriculum_Development","247699111_Taxonomy_of_Educational_Objectives_The_Classification_of_Educational_Objectives","247087990_Outcomes_NVQs_and_the_Emerging_Model_of_Education_and_Training","245581412_The_Basic_Principles_of_Curriculum_and_Instruction","240034098_AMEE_Guide_No_14_Outcome-based_education_Part_1An_introduction_to_outcome-based_education","232439370_Taxonomy_of_educational_objectives_The_classification_of_educational_goals_1st_ed","201381680_Taxonomy_of_Educational_Objectives"]}