{"id":"6131274_A_Long-Term_Evolutionary_Pressure_on_the_Amount_of_Noncoding_DNA","abstract":"A significant part of eukaryotic noncoding DNA is viewed as the passive result of mutational processes, such as the proliferation of mobile elements. However, sequences lacking an immediate utility can nonetheless play a major role in the long-term evolvability of a lineage, for instance by promoting genomic rearrangements. They could thus be subject to an indirect selection. Yet, such a long-term effect is difficult to isolate either in vivo or in vitro. Here, by performing in silico experimental evolution, we demonstrate that, under low mutation rates, the indirect selection of variability promotes the accumulation of noncoding sequences: Even in the absence of self-replicating elements and mutational bias, noncoding sequences constituted an important fraction of the evolved genome because the indirectly selected genomes were those that were variable enough to discover beneficial mutations. On the other hand, high mutation rates lead to compact genomes, much like the viral ones, although no selective cost of genome size was applied: The indirectly selected genomes were those that were small enough for the genetic information to be reliably transmitted. Thus, the spontaneous evolution of the amount of noncoding DNA strongly depends on the mutation rate. Our results suggest the existence of an additional pressure on the amount of noncoding DNA, namely the indirect selection of an appropriate trade-off between the fidelity of the transmission of the genetic information and the exploration of the mutational neighborhood. Interestingly, this trade-off resulted robustly in the accumulation of noncoding DNA so that the best individual leaves one offspring without mutation (or only neutral ones) per generation.","authors":["Carole Knibbe","Antoine Coulon","Olivier Mazet","Jean-Michel Fayard"],"meta":["November 2007Molecular Biology and Evolution 24(10):2344-53","DOI:10.1093/molbev/msm165","SourcePubMed"],"references":["286441245_Genome_evolution_in_yeasts","286440992_Genome_evolution_in_yeasts","345978464_Impact_of_Homologous_Recombination_on_Genome_Organization_and_Stability","291777199_Digital_genetics_unravelling_the_genetic_basis_of_evolution","277683566_Evolvability","261144662_Models_of_Evolution_and_Discussion","243775275_Evolution_of_digital_organisms_at_high_mutation_rate_leads_to_survival_of_the_flattest","237132986_Robustness_and_Evolvability_in_Living_Systems","229588764_Evolution_of_Evolvabilitya","227616499_SELECTION_FOR_FITNESS_VERSUS_SELECTION_FOR_ROBUSTNESS_IN_RNA_SECONDARY_STRUCTURE_FOLDING"]}