{"id":"6162566_Physics-conforming_constraints-oriented_numerical_method","abstract":"A general high-order finite element method for solving partial differential equations, called the COnstraints Oriented Library (COOL) method, is presented. This hp approach takes into account the underlying nature of the corresponding physical problem, and thus avoids the generation of nonphysical solutions. In the COOL method, all terms in a variational form are represented by the same functional dependence and by the same regularity, thus eliminating regularity constraints imposed by standard numerical methods. External constraints, such as the incompressibility condition appearing in the Maxwell or Navier-Stokes equations, can then be satisfied identically and are eliminated algebraically. This reduces the number of variables, and leads to well-conditioned matrix problems. The consequence is that only physically relevant solutions remain. The COOL method also satisfies automatically internal constraints, such as occur for the grad(div) and curl(curl) operators, and this for any geometry. This approach can be applied to a wide range of physical problems, including fluid flows, electromagnetics, material sciences, ideal linear magnetohydrodynamic stability analysis, and Alfvén wave heating of fusion plasmas. Results obtained by applying the COOL method to the grad(div) and curl(curl) operators, the Stokes problem, and the steady and unsteady Navier-Stokes equations are presented.","authors":["Etienne Ahusborde","Ralf Gruber","Mejdi Azaiez","Mark Sawley"],"meta":["June 2007Physical Review E 75(5 Pt 2):056704","DOI:10.1103/PhysRevE.75.056704","SourcePubMed"],"references":["220576722_On_the_problem_of_spurious_eigenvalues_in_the_approximation_of_linear_elliptic_problems_in_mixed_form","51992021_Viscous_and_Resistive_Eddies_Near_a_Sharp_Corner","346680185_High-Order_Methods_for_Incompressible_Fluid_Flow","234384975_Finite_Element_Methods_For_Navier_Stokes_Equations","234372621_Finite_Element_Methods_in_Linear_Ideal_Magnetohydrodynamics","231874862_Laminar_flow_behind_two-dimensional_grid","231113971_On_the_transport_of_neutral_hydrogen_atoms_in_a_hydrogen_plasma","222399116_Stokes_eigenmodes_in_square_domain_and_the_stream_function-vorticity_correlation","222334238_Large_amplitude_solutions_of_the_nonlinear_wave_equation_for_an_ideal_cold_three-fluid_plasma","202243110_Finite_Element_Methods_for_Navier_Stokes_Equations"]}