{"id":"6207106_Adaptive_Fast_Walking_in_a_Biped_Robot_under_Neuronal_Control_and_Learning","abstract":"Human walking is a dynamic, partly self-stabilizing process relying on the interaction of the biomechanical design with its neuronal control. The coordination of this process is a very difficult problem, and it has been suggested that it involves a hierarchy of levels, where the lower ones, e.g., interactions between muscles and the spinal cord, are largely autonomous, and where higher level control (e.g., cortical) arises only pointwise, as needed. This requires an architecture of several nested, sensori-motor loops where the walking process provides feedback signals to the walker's sensory systems, which can be used to coordinate its movements. To complicate the situation, at a maximal walking speed of more than four leg-lengths per second, the cycle period available to coordinate all these loops is rather short. In this study we present a planar biped robot, which uses the design principle of nested loops to combine the self-stabilizing properties of its biomechanical design with several levels of neuronal control. Specifically, we show how to adapt control by including online learning mechanisms based on simulated synaptic plasticity. This robot can walk with a high speed (>3.0 leg length/s), self-adapting to minor disturbances, and reacting in a robust way to abruptly induced gait changes. At the same time, it can learn walking on different terrains, requiring only few learning experiences. This study shows that the tight coupling of physical with neuronal control, guided by sensory feedback from the walking pattern itself, combined with synaptic learning may be a way forward to better understand and solve coordination problems in other complex motor tasks.","authors":["Poramate Manoonpong","Tao Geng","Tomas Kulvicius","Bernd Porr"],"meta":["August 2007PLoS Computational Biology 3(7):e134","DOI:10.1371/journal.pcbi.0030134","SourcePubMed"],"references":["316263438_Normal_Human_Locomotion_Part_1_Basic_Concepts_and_Terminology","291821118_How_we_walk_Central_control_of_muscle_activity_during_human_walking","288983729_Chapter_III_Biodynamics_of_Locomotion","279375323_Dynamics_of_Biped_Locomotion","278980348_Infants'_Sensitivity_to_Optical_Flow_for_Controlling_Posture","277449244_A_Three-Dimensional_Passive-Dynamic_Walking_Robot_with_Two_Legs_and_Knees","277369436_Fast_Biped_Walking_with_a_Sensor-driven_Neuronal_Controller_and_Real-time_Online_Learning","271559120_Learning_from_demonstration_and_adaptation_of_biped_locomotion","262169528_Differential_Hebbian_learning","259674076_Legged_Robots_That_Balance","245988076_Dynamics_of_a_single_model_neuron","259673964_Neural_Control_of_Locomotion_From_Mollusc_to_Man","246437255_Neural_control_of_locomotion_Part_1_The_central_pattern_generator_from_cats_to_humans","246436772_Understanding_the_roles_of_vision_in_the_control_of_human_locomotion","245587815_Biped_Locomotion_Dynamics_Stability_Control_and_Application"]}