{"id":"6482956_Chromosome_Rearrangements_and_the_Evolution_of_Genome_Structuring_and_Adaptability","abstract":"Eukaryotes appear to evolve by micro and macro rearrangements. This is observed not only for long-term evolutionary adaptation, but also in short-term experimental evolution of yeast, Saccharomyces cerevisiae. Moreover, based on these and other experiments it has been postulated that repeat elements, retroposons for example, mediate such events.\nWe study an evolutionary model in which genomes with retroposons and a breaking/repair mechanism are subjected to a changing environment. We show that retroposon-mediated rearrangements can be a beneficial mutational operator for short-term adaptations to a new environment. But simply having the ability of rearranging chromosomes does not imply an advantage over genomes in which only single-gene insertions and deletions occur. Instead, a structuring of the genome is needed: genes that need to be amplified (or deleted) in a new environment have to cluster. We show that genomes hosting retroposons, starting with a random order of genes, will in the long run become organized, which enables (fast) rearrangement-based adaptations to the environment.\nIn other words, our model provides a “proof of principle” that genomes can structure themselves in order to increase the beneficial effect of chromosome rearrangements.","authors":["Anton Crombach","Paulien Hogeweg"],"meta":["June 2007Molecular Biology and Evolution 24(5):1130-9","DOI:10.1093/molbev/msm033","SourcePubMed"],"references":["31986373_Widespread_aneuploidy_revealed_by_DNA_microarray_expression_profiling","13566227_Multiple_Duplications_of_Yeast_Hexose-Transport_Genes_in_Response_to_Selection_in_a_Glucose-Limited_Environment","12849610_Systematic_changes_in_gene_expression_patterns_following_adaptive_evolution_in_yeast","12306816_A_computational_analysis_of_whole-genome_expression_data_reveals_chromosomal_domains_of_gene_expression","12239655_Prevalence_of_small_inversions_in_yeast_gene_order_evolution","11623696_Evolution_of_Gene_Order_in_the_Genomes_of_Two_Related_Yeast_Species","292357734_Self-organisation_and_evolution_of_social_systems","286500326_Interlocking_of_self-organisation_and_evolution","21839025_Fitness_Effects_of_Ty_Transposition_in_Saccharomyces_Cerevisiae","12477838_Chromosomal_evolution_in_Saccharomyces"]}