{"id":"6506629_Person_Authentication_Using_Brainwaves_EEG_and_Maximum_A_Posteriori_Model_Adaptation","abstract":"In this paper, we investigate the use of brain activity for person authentication. It has been shown in previous studies that the brain-wave pattern of every individual is unique and that the electroencephalogram (EEG) can be used for biometric identification. EEG-based biometry is an emerging research topic and we believe that it may open new research directions and applications in the future. However, very little work has been done in this area and was focusing mainly on person identification but not on person authentication. Person authentication aims to accept or to reject a person claiming an identity, i.e., comparing a biometric data to one template, while the goal of person identification is to match the biometric data against all the records in a database. We propose the use of a statistical framework based on Gaussian Mixture Models and Maximum A Posteriori model adaptation, successfully applied to speaker and face authentication, which can deal with only one training session. We perform intensive experimental simulations using several strict train/test protocols to show the potential of our method. We also show that there are some mental tasks that are more appropriate for person authentication than others.","authors":["Sébastien Marcel","Jose del R. Millan"],"meta":["May 2007IEEE Transactions on Pattern Analysis and Machine Intelligence 29(4):743-52","DOI:10.1109/TPAMI.2007.1012","SourcePubMed"],"references":["230887766_The_Handbook_of_Brain_Theory_and_Neural_Network","221597921_Comparison_of_MLP_and_GMM_classifiers_for_face_verification_on_XM2VTS","37433104_Comparison_of_MLP_and_GMM_Classifiers_for_Face_Verification_on_XM2VTS","303517922_Maximum_a_posteriori_estimation_for_multivariate_Gaussian_mixture_observations_of_Markov_chains","278319127_Brain-Computer_Interfaces","222837705_Multi-modal_identity_verification_using_expert_fusion","222674333_Speaker_Verification_Using_Adapted_Gaussian_Mixture_Models","221995817_Maximum_Likelihood_from_Incomplete_Data_Via_EM_Algorithm","220928385_Evaluating_the_Performance_of_Three_Feature_Sets_for_Brain-Computer_Interfaces_with_an_Early_Stopping_MLP_Committee","215721461_Maximum_Likelihood_From_Incomplete_Data_Via_The_EM_algorithm"]}