{"id":"6611490_Predictive_data_mining_in_clinical_medicine_Current_issues_and_guidelines","abstract":"The widespread availability of new computational methods and tools for data analysis and predictive modeling requires medical informatics researchers and practitioners to systematically select the most appropriate strategy to cope with clinical prediction problems. In particular, the collection of methods known as 'data mining' offers methodological and technical solutions to deal with the analysis of medical data and construction of prediction models. A large variety of these methods requires general and simple guidelines that may help practitioners in the appropriate selection of data mining tools, construction and validation of predictive models, along with the dissemination of predictive models within clinical environments.\nThe goal of this review is to discuss the extent and role of the research area of predictive data mining and to propose a framework to cope with the problems of constructing, assessing and exploiting data mining models in clinical medicine.\nWe review the recent relevant work published in the area of predictive data mining in clinical medicine, highlighting critical issues and summarizing the approaches in a set of learned lessons.\nThe paper provides a comprehensive review of the state of the art of predictive data mining in clinical medicine and gives guidelines to carry out data mining studies in this field.\nPredictive data mining is becoming an essential instrument for researchers and clinical practitioners in medicine. Understanding the main issues underlying these methods and the application of agreed and standardized procedures is mandatory for their deployment and the dissemination of results. Thanks to the integration of molecular and clinical data taking place within genomic medicine, the area has recently not only gained a fresh impulse but also a new set of complex problems it needs to address.","authors":["Riccardo Bellazzi","Blaz Zupan"],"meta":["March 2008International Journal of Medical Informatics 77(2):81-97","DOI:10.1016/j.ijmedinf.2006.11.006","SourcePubMed"],"references":["313725795_Building_probabilistic_networks_Where_do_the_numbers_come_from","314031577_Pretreatment_Nomogram_for_Predicting_the_Outcome_of_Three-Dimensional_Conformal_Radiotherapy_in_Prostate_Cancer","310606656_Classification_and_regression_trees","298308436_Gene_expression_profiling_of_breast_cancer_accurately_predicts_clinical_ouitcome_of_disease","297267123_Data_mining_Statistics_and_more","289766440_Applied_Logistic_Regression","285028466_Cluster_analysis_and_display_of_genome-wide_expression_patterns","284240196_Regression_Modeling_Strategies_With_Applications_to_Linear_Models_Logistic_Regression_and_Survival_Analysis","283410159_Stepwise_logistic_regression_Applied_logistic_regression","279397521_Verification_of_Forecasts_Expressed_in_Terms_of_Probability_Monthly_Weather_Review_78_1-3"]}