{"id":"6630519_Connected_Shape-Size_Pattern_Spectra_for_Rotation_and_Scale-Invariant_Classification_of_Gray-Scale_Images","abstract":"In this paper, we describe a multiscale and multishape morphological method for pattern-based analysis and classification of gray-scale images using connected operators. Compared with existing methods, which use structuring elements, our method has three advantages. First, in our method, the time needed for computing pattern spectra does not depend on the number of scales or shapes used, i.e., the computation time is independent of the dimensions of the pattern spectrum. Second, size and strict shape attributes can be computed, which we use for the construction of joint 2D shape-size pattern spectra. Third, our method is significantly less sensitive to noise and is rotation-invariant. Although rotation invariance can also be approximated by methods using structuring elements at different angles, this tends to be computationally intensive. The classification performance of these methods is discussed using four image sets: Brodatz, COIL-20, COIL-100, and diatoms. The new method obtains better or equal classification performance to the best competitor with a 5 to 9-fold speed gain.","authors":["Erik R. Urbach","Jos Roerdink","Michael H. F. Wilkinson"],"meta":["March 2007IEEE Transactions on Pattern Analysis and Machine Intelligence 29(2):272-85","DOI:10.1109/TPAMI.2007.28","SourcePubMed"],"references":["283921280_Visual_Pattern_Recognition_by_Moment_Invariants","275340906_Random_Forests","273047440_The_Diatoms_Applications_for_the_Environmental_and_Earth_Sciences","265546864_Local_Grayscale_Granulometries_Based_on_Opening_Trees","257259967_The_diatoms_Applications_for_the_environmental_and_earth_sciences","246417453_Image_Analysis_and_Mathematical_Morphobgy","243482054_Size_distributions_for_multivariate_morphological_granulometries_Texture_classification_and_statistical_properties","238981153_Gray-scale_morphological_granulometric_texture_classification","237127862_Random_Sets_and_Integral_Geometry","226270700_Bagging_Predictors"]}