{"id":"6664394_Correlation_Between_Airflow_Patterns_and_Performance_of_a_Laboratory_Fume_Hood","abstract":"To understand the physical mechanisms of the contaminant dispersion and containment leakage during the ventilation process through a laboratory fume hood, the complicated three-dimensional flow patterns and the real-time tracer gas (SF6) leakage were studied via the laser-assisted flow visualization method and the standard/special gas sampling technique, respectively. Through flow visualization, the large-scale vortex structures and boundary layer separations were found around the side poles and doorsill of the hood. In the near-wake region of the manikin, large recirculation zones and wavy flow structures were also identified. When tracer gas concentration measurements were conducted point-by-point across the sash opening, the areas near the doorsill, the lower parts of the side poles, and the sides of the manikin showed significant contaminant leaks. These areas with high contaminant leaks exactly corresponded to where the flow recirculated or separated. However, when the ANSI/ASHRAE 110-1995 protocol was used to measure the concentration of SF6 at the breathing zone of the manikin, no appreciable leakage was detected. It is suggested that a method based on the aerodynamic features and multipoint leakage detections would reflect a more realistic evaluation of overall performance of laboratory fume hood than a single-point sampling method at the manikin's breathing zone.","authors":["Li-Ching Tseng","R. F. Huang","Chih-Chieh Chen","cheng-ping Chang"],"meta":["January 2007Journal of Occupational and Environmental Hygiene 3(12):694-706","DOI:10.1080/15459620601015695","SourcePubMed"],"references":["311708587_Required_response_time_for_variable_air_volume_fume_hood_controllers","304551570_Computational_fluid_dynamics_as_a_method_for_assessing_fume_cupboard_performance","260585050_A_First_Course_in_Turbulence","249873432_The_Effect_of_Contaminant_Source_Momentum_on_a_Workers_Breathing_Zone_Concentration_in_a_Uniform_Freestream","249873292_A_New_Method_for_Quantitative_In-Use_Testing_of_Laboratory_Fume_Hoods","247576560_Containment_testing_of_fume_cupboards_-_II_Test_room_measurements","245145098_Experimental_and_numerical_investigations_of_the_performance_of_fume_cupboards","241719902_Fume_Hood_Performance_Face_Velocity_Variability_Inconsistent_Air_Volume_Systems","229340097_Numerical_simulation_and_optimization_of_the_aerodynamics_flow_field_inside_fume_cupboards","40958939_Containment_testing_of_fume_cupboards_-_I_Methods"]}