{"id":"6676509_Challenges_and_Issues_in_Medical_Education_in_India","abstract":"The Indian medical education system, one of the largest in the world, produces many physicians who emigrate to the United States, the United Kingdom, and several other countries. The quality of these physicians, therefore, has a broad global impact. Medical schools in India have rapidly proliferated in the past 25 years, doubling since 1980 for a current total of 258. Accreditation by the Medical Council of India (MCI) emphasizes documentation of infrastructure and resources and does not include self-study. The number of schools is determined by each state; the allocation of income-generating \"payment seats\" in private medical schools, coupled with the high emigration, may be motivating the increase in physician production. Student selection is almost exclusively based on performance on an entrance examination, with a lower cutoff score for underrepresented minorities. Curriculum reform has been advocated for over 30 years, with calls for greater relevance of the curriculum to the needs of the community. Revised guidelines from the MCI in 1997 supported these changes. The internship year (the fifth year, focusing on rotating clinical experiences), under the aegis of medical schools in India, has suffered from lack of supervision and minimal assessment; it is often used predominantly as a time to study for residency entrance examinations. The authors recommend wider use of the in-depth accreditation process used by the National Accreditation and Assessment Council, currently applied to only 10% of medical schools, as well as reforms in curriculum, student selection, and internship assessment, in addition to stronger faculty-development efforts.","authors":["Avinash Supe","William Burdick"],"meta":["January 2007Academic medicine: journal of the Association of American Medical Colleges 81(12):1076-80","DOI:10.1097/01.ACM.0000246699.94234.ab","SourcePubMed"],"references":["8246017_Trends_in_medical_education_Challenges_and_directions_for_need-based_reforms_of_medical_training_in_South-East_Asia","7888672_Need_for_Strengthening_of_Internship_Rotatory_Housemanship_Training_in_India","7732575_The_FAIMER_Institute_Creating_international_networks_of_medical_educators","7254900_The_International_Medical_Graduate_Pipeline_Recent_Trends_In_Certification_And_Residency_Training","6242048_Slowing_the_brain_drain_FAIMER_education_programs","266604863_Technical_Education_in_North_Eastern_India_Problems_and_prospects","14997965_Need-based_undergraduate_medical_curriculum","11035586_History_of_anatomy_in_India"]}