{"id":"6719694_Evolving_research_trends_in_bioinformatics","abstract":"The cross-disciplinary nature of bioinformatics entails co-evolution with other biomedical disciplines, whereby some bioinformatics applications become popular in certain disciplines and, in turn, these disciplines influence the focus of future bioinformatics development efforts. We observe here that the growth of computational approaches within various biomedical disciplines is not merely a reflection of a general extended usage of computers and the Internet, but due to the production of useful bioinformatics databases and methods for the rest of the biomedical scientific community. We have used the abstracts stored both in the MEDLINE database of biomedical literature and in NIH-funded project grants, to quantify two effects. First, we examine the biomedical literature as a whole and find that the use of computational methods has become increasingly prevalent across biomedical disciplines over the past three decades, while use of databases and the Internet have been rapidly increasing over the past decade. Second, we study the recent trends in the use of bioinformatics topics. We observe that molecular sequence databases are a widely adopted contribution in biomedicine from the field of bioinformatics, and that microarray analysis is one of the major new topics engaged by the bioinformatics community. Via this analysis, we were able to identify areas of rapid growth in the use of informatics to aid in curriculum planning, development of computational infrastructure and strategies for workforce education and funding.","authors":["Carol Perez-Iratxeta","Miguel Andrade","Jonathan Daniel Wren"],"meta":["April 2007Briefings in Bioinformatics 8(2):88-95","DOI:10.1093/bib/bbl035","SourcePubMed"],"references":["10569997_Educating_Future_Scientists","8962087_Evolving_Strategies_for_the_Incorporation_of_Bioinformatics_Within_the_Undergraduate_Cell_Biology_Curriculum","8927661_Immunoinformatics_-_The_new_kid_in_town","8884370_Introductory_Science_and_Mathematics_Education_for_21st-Century_Biologists","259599925_NASA_reworks_its_sums_after_Mars_fiasco","13446792_A_curriculum_for_bioinformatics_The_time_is_ripe","12921705_Reichhardt_T_It's_sink_or_swim_as_a_tidal_wave_of_data_approaches_Nature_399_517-520","12099310_Computational_Biology_Bioinformatics_-_Trying_to_Swim_in_a_Sea_of_Data","11788031_Cheminformatics_A_tool_for_decision-makers_in_drug_discovery","8628854_Educating_Biologists_in_the_21st_Century_Bioinformatics_Scientists_versus_Bioinformatics_Technicians"]}