{"id":"7485023_Gait_Velocity_as_a_Single_Predictor_of_Adverse_Events_in_Healthy_Seniors_Aged_75_Years_and_Older","abstract":"Although gait velocity (GV) measurement could predict poor outcomes, few studies regarding its usefulness as a single test in well functioning elderly persons have been pursued. The aim of this study was to asses whether GV could be sufficient to predict adverse events such as hospitalization for any cause, requirement for a caregiver, nursing home placement, falls, fractures, or death in healthy elderly persons.\nOurs was a cohort study comprising 102 well functioning participants aged 75 and older. Demographic features, health status, and functional capacity were assessed at baseline and followed for adverse outcomes. Measurements included evaluation of cognition, activities of daily living, and mobility. The time required to walk the middle 8 meters of 10 meters was defined as GV. Three GV groups were distinguished: high GV (>1.1 m/s), median GV (1-0.7 m/s), and low GV (<0.7 m/s).\nAt baseline, the three groups were comparable in their health status with an average age of 79.6 +/- 4 years. At 24 months, the low GV group had a significantly higher incidence of adverse events than did the other groups. Low GV was a predictor of hospitalization (relative risk [RR] = 5.9, 95% confidence interval [CI], 1.9-8.5), requirement of a caregiver (RR = 9.5, 95% CI, 1.3-2.5), and new falls (RR = 5.4, 95% CI, 2.0-4.3). These associations remained significant after a multiple logistic regression analysis.\nGV measurement in the ambulatory setting may allow the detection of healthy elderly people at risk for adverse events. These data may suggest that simple assessment of GV is enough to predict adverse events in well functioning older persons.","authors":["Manuel Montero-Odasso","Marcelo Schapira","Enrique R Soriano","Miguel Varela"],"meta":["November 2005The Journals of Gerontology Series A Biological Sciences and Medical Sciences 60(10):1304-9","DOI:10.1093/gerona/60.10.1304","SourcePubMed"],"references":["316991409_Mini-Mental_State_A_practical_method_for_grading_the_cognitive_state_of_patients_for_the_clinician","296455129_Efficient_use_of_performance_measures_in_the_clinical_setting","285307785_Balance_in_Elderly_Patients_The_Get-up_and_Go_Test","284688476_Assessment_of_older_people_Self_maintaining_and_Instrumental_Activities_of_Daily_Living","247663554_Studies_of_illness_in_the_aged-the_index_of_ADL_a_standardized_measure_of_biological_and_psychosoci","246597705_Fall-risk_screening_test","245909813_Development_and_validation_of_a_Geriatric_Depression_Screening_Scale_A_preliminary_report","236284799_Katz_S_Ford_A_B_Moskowitz_R_W_Jackson_B_A_Jaffe_M_W_Studies_of_illness_in_the_aged_The_Index_of_ADL_a_standardized_measure_of_biological_and_psychosocial_function_JAMA_185_914-919","51303850_Geriatric_Medicine_in_Britain--the_Growth_of_a_Specialty","22646398_Geriatric_Medicine_Whose_Specialty"]}