{"id":"7574783_Ways_of_thinking_about_and_teaching_ethical_problem_solving_Microethics_and_macroethics_in_engineering","abstract":"Engineering ethics entails three frames of reference: individual, professional, and social. \"Microethics\" considers individuals and internal relations of the engineering profession; \"macroethics\" applies to the collective social responsibility of the profession and to societal decisions about technology. Most research and teaching in engineering ethics, including online resources, has had a \"micro\" focus. Mechanisms for incorporating macroethical perspectives include: integrating engineering ethics and science, technology and society (STS); closer integration of engineering ethics and computer ethics; and consideration of the influence of professional engineering societies and corporate social responsibility programs on ethical engineering practice. Integrating macroethical issues and concerns in engineering ethics involves broadening the context of ethical problem solving. This in turn implies: developing courses emphasizing both micro and macro perspectives, providing faculty development that includes training in both STS and practical ethics; and revision of curriculum materials, including online resources. Multidisciplinary collaboration is recommended 1) to create online case studies emphasizing ethical decision making in individual, professional, and societal contexts; 2) to leverage existing online computer ethics resources with relevance to engineering education and practice; and 3) to create transparent linkages between public policy positions advocated by professional societies and codes of ethics.","authors":["Joseph R. Herkert"],"meta":["August 2005Science and Engineering Ethics 11(3):373-85","DOI:10.1007/s11948-005-0006-3","SourcePubMed"],"references":["330942065_Thinking_Like_an_Engineer","344017923_Using_Detailed_Multimedia_Cases_To_Teach_Engineering_Ethics","300312975_Engineering_Ethics_and_Political_Imagination","269956130_Engineering_Ethics_and_Computer_Ethics","264295636_Engineering_in_Context_An_Empirical_Study_of_Freshmen_Students'_Conceptual_Frameworks","260943918_Beyond_Greening_Strategies_for_a_Sustainable_World","245303277_Structural_Failures_and_Engineering_Ethics","245290603_Preventive_Engineering_Strategy_for_Dealing_with_Negative_Social_and_Environmental_Implications_of_Technology","239427344_Engineering_ethics_education_in_the_USA_Content_pedagogy_and_curriculum_European_Journal_of_Engineering_Education_254_303-314","239388255_Engineering_Perceptions_of_ABET_Accreditation_Criteria"]}