{"id":"7578089_Detecting_Deception_Using_Functional_Magnetic_Resonance_Imaging","abstract":"The ability to accurately detect deception is presently very limited. Detecting deception might be more accurately achieved by measuring the brain correlates of lying in an individual. In addition, a method to investigate the neurocircuitry of deception might provide a unique opportunity to test the neurocircuitry of persons in whom deception is a prominent component (i.e., conduct disorder, antisocial personality disorder, etc.).\nIn this study, we used functional magnetic resonance imaging (fMRI) to show that specific regions were reproducibly activated when subjects deceived. Subjects participated in a mock crime stealing either a ring or a watch. While undergoing an fMRI, the subjects denied taking either object, thus telling the truth with some responses, and lying with others. A Model-Building Group (MBG, n = 30) was used to develop the analysis methods, and the methods were subsequently applied to an independent Model-Testing Group (MTG, n = 31).\nWe were able to correctly differentiate truthful from deceptive responses, correctly identifying the object stolen, for 93% of the subjects in the MBG and 90% of the subjects in the MTG.\nThis is the first study to use fMRI to detect deception at the individual level. Further work is required to determine how well this technology will work in different settings and populations.","authors":["Frank Andrew Kozel","Kevin A Johnson","Qiwen Mu","Emily L Grenesko"],"meta":["November 2005Biological Psychiatry 58(8):605-13","DOI:10.1016/j.biopsych.2005.07.040","SourcePubMed"],"references":["232152496_Behavioral_and_functional_anatomical_correlates_of_deception","303083728_Assessing_the_significance_of_focal_activations_using_their_spatial_extent","285778854_The_counting_Stroop_An_interference_task_specialized_for_functional_neuroimaging-validation_study_with_functional_MRI","285714101_Statistical_parametric_mapping","283827717_Experimental_Design_and_Statistical_Parametric_Mapping","280089012_A_cognitive_neurobiological_account_of_deception_evidence_from_functional_neuroimaging","272783896_Structured_Clinical_Interview_for_DSM-IV_SCID","247661144_Structured_clinical_interview_for_DSM-IV_Axis-II_disorders","238235427_Functional_brain_mapping_by_blood_oxygenation_level-dependent_contrast_magnetic_resonance_imaging","227681521_The_Truth_Will_Out_Interrogative_Polygraphy_Lie_Detection_With_Event-Related_Brain_Potentials"]}