{"id":"7829716_Musculoskeletal_pain_associated_with_the_use_of_computer_systems_in_Nigeria","abstract":"Computer related musculoskeletal disorders affect millions of computer users yearly in developed nations as reported in the literature. With proliferation of computer systems in the developing nations, the associated musculoskeletal pain has yet to be investigated. This serves as impetus for this study.\nA structured questionnaire was used to obtain information from computer users across six federal university campuses in Nigeria. The questionnaire contained two sections of 35 items each. The questions requested the respondents to provide information on age, sex, years of computer usage, hour spent on computer per week, associated musculoskeletal pain, pain severity and knowledge of preventive measures. 1041 questionnaires were analyzed using descriptive statistics.\nLow back pain and neck pain were found to be the highest pain complaint with 74% and 73% respectively. 67% of the respondents complained of wrist pain, followed by finger pain (65%), shoulder pain 63% and general body pain 61%. The knee and foot pains were the least reported complaints with 26% and 25% respectively. In terms of pain severity, low back pain, finger pain, neck pain and shoulder pain are rated to be moderate, while all other joints were said to be of mild pain.\nThe results of this study indicated that low back pain, neck pain and upper limbs are the common disorders complaints among the users. The cause of the pain may be attributed to bad ergonomics among the users.","authors":["Rufus Adedoyin","Bimbo O Idowu","Rotimi E Adagunodo","Ayodeji A Owoyomi"],"meta":["February 2005Technology and health care: official journal of the European Society for Engineering and Medicine 13(2):125-30","DOI:10.3233/THC-2005-13206","SourcePubMed"],"references":["235248559_Information_Communication_Technology_In_Nigeria_The_Health_Sector_Experience","11765667_Use_of_keyboards_and_symptoms_in_the_neck_and_arm_evidence_from_a_national_survey"]}