{"id":"7976590_Isotropic_Fractionator_A_Simple_Rapid_Method_for_the_Quantification_of_Total_Cell_and_Neuron_Numbers_in_the_Brain","abstract":"Stereological techniques that estimate cell numbers must be restricted to well defined structures of isotropic architecture and therefore do not apply to the whole brain or to large neural regions. We developed a novel, fast, and inexpensive method to quantify total numbers of neuronal and non-neuronal cells in the brain or any dissectable regions thereof. It consists of transforming highly anisotropic brain structures into homogeneous, isotropic suspensions of cell nuclei, which can be counted and identified immunocytochemically as neuronal or non-neuronal. Estimates of total cell, neuronal, and non-neuronal numbers can be obtained in 24 h and vary by <10% among animals. Because the estimates obtained are independent of brain volume, they can be used in comparative studies of brain-volume variation among species and in studies of phylogenesis, development, adult neurogenesis, and pathology. Applying this method to the adult rat brain, we show, for example, that it contains approximately 330 million cells, of which 200 million are neurons, and almost 70% of these are located in the cerebellum alone. Moreover, contrary to what is commonly assumed in the literature, we show that glial cells are not the majority in the rat brain.","authors":["Suzana Herculano-Houzel","Roberto Lent"],"meta":["March 2005The Journal of Neuroscience : The Official Journal of the Society for Neuroscience 25(10):2518-21","DOI:10.1523/JNEUROSCI.4526-04.2005","SourcePubMed"],"references":["275068655_The_Control_Of_Neuron_Number","279430003_Postnatal_Changes_in_GliaNeuron_Index_with_a_Comparison_of_Methods_of_Cell_Enumeration_in_the_White_Rat","244958784_NeuN_a_neuronal_specific_nuclear_protein_in_vertebrates","21673108_Mullen_RJ_Buck_CR_Smith_AM_NeuN_a_neuronal_specific_nuclear_protein_in_vertebrates_Development_116_201-211","21671844_A_quantitative_study_of_the_human_cerebellum_with_unbiased_sterological_techniques","21365509_Glia_Neurons_and_Plasticity","20975261_An_efficient_method_for_estimating_the_total_number_of_neurons_in_rat_brain_cortex","19872756_The_Control_of_Neuron_Number","19487853_Brain_sizes_surfaces_and_neuronal_sizes_of_the_cortex_cerebri_A_stereological_investigation_of_man_and_his_variability_and_a_comparison_with_some_mammals_primates_whales_marsupials_insectivores_and_on","17737111_Nerve_Cells_and_Behavior"]}