{"id":"8264912_Region_Filling_and_Object_Removal_by_Exemplar-Based_Image_Inpainting","abstract":"A new algorithm is proposed for removing large objects from digital images. The challenge is to fill in the hole that is left behind in a visually plausible way. In the past, this problem has been addressed by two classes of algorithms: 1) \"texture synthesis\" algorithms for generating large image regions from sample textures and 2) \"inpainting\" techniques for filling in small image gaps. The former has been demonstrated for \"textures\"--repeating two-dimensional patterns with some stochasticity; the latter focus on linear \"structures\" which can be thought of as one-dimensional patterns, such as lines and object contours. This paper presents a novel and efficient algorithm that combines the advantages of these two approaches. We first note that exemplar-based texture synthesis contains the essential process required to replicate both texture and structure; the success of structure propagation, however, is highly dependent on the order in which the filling proceeds. We propose a best-first algorithm in which the confidence in the synthesized pixel values is propagated in a manner similar to the propagation of information in inpainting. The actual color values are computed using exemplar-based synthesis. In this paper, the simultaneous propagation of texture and structure information is achieved by a single, efficient algorithm. Computational efficiency is achieved by a block-based sampling process. A number of examples on real and synthetic images demonstrate the effectiveness of our algorithm in removing large occluding objects, as well as thin scratches. Robustness with respect to the shape of the manually selected target region is also demonstrated. Our results compare favorably to those obtained by existing techniques.","authors":["Antonio Criminisi","Patrick Pérez","Kentaro Toyama"],"meta":["October 2004IEEE Transactions on Image Processing 13(9):1200-12","DOI:10.1109/TIP.2004.833105","SourcePubMed"],"references":["221625806_Viewpoint_Consistent_Texture_Synthesis","221573898_Missing_data_correction_in_still_images_and_image_sequences","221364725_Object_Removal_by_Exemplar-Based_Inpainting","220660439_Learning_Low-Level_Vision","314801352_Missing_data_correction_in_still_images_and_image_sequences","271543045_Computational_Models_For_Texture_Analysis_And_Synthesis","261389896_Pyramid-Based_texture_analysissynthesis","247936609_The_Organization_of_Vision","224513817_Simultaneous_Structure_and_Texture_Image_Inpainting","222522486_Nontexture_Inpainting_by_Curvature-Driven_Diffusions"]}