{"id":"8977270_Monte_Carlo_modelling_of_external_radiotherapy_photon_beams","abstract":"An essential requirement for successful radiation therapy is that the discrepancies between dose distributions calculated at the treatment planning stage and those delivered to the patient are minimized. An important component in the treatment planning process is the accurate calculation of dose distributions. The most accurate way to do this is by Monte Carlo calculation of particle transport, first in the geometry of the external or internal source followed by tracking the transport and energy deposition in the tissues of interest. Additionally, Monte Carlo simulations allow one to investigate the influence of source components on beams of a particular type and their contaminant particles. Since the mid 1990s, there has been an enormous increase in Monte Carlo studies dealing specifically with the subject of the present review, i.e., external photon beam Monte Carlo calculations, aided by the advent of new codes and fast computers. The foundations for this work were laid from the late 1970s until the early 1990s. In this paper we will review the progress made in this field over the last 25 years. The review will be focused mainly on Monte Carlo modelling of linear accelerator treatment heads but sections will also be devoted to kilovoltage x-ray units and 60Co teletherapy sources.","authors":["Frank Verhaegen","Jan Seuntjens"],"meta":["December 2003Physics in Medicine and Biology 48(21):R107-64","DOI:10.1088/0031-9155/48/21/R01","SourcePubMed"],"references":["319080798_CYLTRAN","306334970_Therapy_Imaging_Source_Sizes_of_Radiotherapy_Beams","301119647_Applicability_of_a_multi-hole_collimator_for_scanned_photon_beams_A_Monte_Carlo_study","292760886_Performance_benchmarks_of_the_MCV_Monte_Carlo_system","289350369_Simulation_of_photon_beams_from_a_Saturne_43_accelerator_using_the_code_PENELOPE","289221241_Monte_Carlo_PENELOPE_code_study_of_the_x-ray_beams_from_SL_linacs_Elekta","284675529_Monte_Carlo_Techniques_of_Electron_and_Photon_Transport_for_Radiation_Dosimetry","284472502_Stopping-Power_Ratios_for_Dosimetry","279407427_Cross_Sections_for_Bremsstrahlung_Production_and_Electron-Impact_Ionization","277423371_Monte_Carlo_calculation_of_the_wall_correction_factors_for_ionization_chambers_and_Aeq_for_60Co_g_rays"]}