{"id":"9025891_Cytoscape_A_Software_Environment_for_Integrated_Models_of_Biomolecular_Interaction_Networks","abstract":"Cytoscape is an open source software project for integrating biomolecular interaction networks with high-throughput expression data and other molecular states into a unified conceptual framework. Although applicable to any system of molecular components and interactions, Cytoscape is most powerful when used in conjunction with large databases of protein-protein, protein-DNA, and genetic interactions that are increasingly available for humans and model organisms. Cytoscape's software Core provides basic functionality to layout and query the network; to visually integrate the network with expression profiles, phenotypes, and other molecular states; and to link the network to databases of functional annotations. The Core is extensible through a straightforward plug-in architecture, allowing rapid development of additional computational analyses and features. Several case studies of Cytoscape plug-ins are surveyed, including a search for interaction pathways correlating with changes in gene expression, a study of protein complexes involved in cellular recovery to DNA damage, inference of a combined physical/functional interaction network for Halobacterium, and an interface to detailed stochastic/kinetic gene regulatory models.","authors":["Paul Shannon","Andrew Markiel","Owen Ozier","Nitin Baliga"],"meta":["December 2003Genome Research 13(11):2498-504","DOI:10.1101/gr.1239303","SourcePubMed"],"references":["301345304_Pajek-program_for_large_Network_analysis","242452121_Assigning_protein_functions_by_comparative_genome_analysis_Protein_phylogenetic_profiles_genomicybioinformaticsymetabolic_pathwaysystructural_complexes","24459736_The_COG_database_New_developments_in_phylogenetic_classification_of_proteins_from_complete_genomes","289277208_Exploring_the_metabolic_and_genetic_control_of_gene_expression_on_a_genomic_scale","285028466_Cluster_analysis_and_display_of_genome-wide_expression_patterns","279338677_The_TRANSFAC_system_on_gene_expression_regulation","220695896_Graph_Drawing_Algorithms_for_the_Visualization_of_Graphs","216633399_A_Heuristic_for_Graph_Drawing","24682463_Creating_the_Gene_Ontology_Resource_Design_and_Implementation","18648011_Functions_of_a_New_Photoreceptor_Membrane"]}